     H DECEDIT('0,') DATEDIT(*DMY.)
     H**************************************************************************
     H/TITLE  Übernahen KDEW in KUND
     H**************************************************************************
     H*  Copyright 2012 by    trend SWM
     H*                       Verwaltungs GmbH
     H*                       Ziegelhofstraße 210a
     H*                       DE 79110 Freiburg
     H*  -----------------------------------------------------------------------
     H*  Erstellung: ZG 04.07.2012 DOMETIC Projekt 8399
     H*  -----------------------------------------------------------------------
     F**************************************************************************
     F*
     F*
     D**************************************************************************
     D***     T A B E L L E N  U N D  F E L D G R U P P E N                  ***
     D**************************************************************************
     D/COPY QCPYSRC,EXTRDR
     D*
     D**************************************************************************
     D***     DATEIEN                                                        ***
     D**************************************************************************
     D KDEW          E DS                  INZ
     D KYKDEW        E DS                  INZ
     D*
     D KUND          E DS                  INZ
     D KYKUND        E DS                  INZ
     D*
     D TRPA          E DS                  INZ
     D KYTRPA        E DS                  INZ
     D*
     D**************************************************************************
     D***     KOMMUNIKATIONSPARAMETER                                        ***
     D**************************************************************************
     D EXTR01        E DS                  INZ
     D EXTR02        E DS                  INZ
     D*
     D EXFIRM        E DS                  INZ
     D*
     D**************************************************************************
     D***  DATENSTATIONSARBEITSBEREICH                                       ***
     D**************************************************************************
     D EXTRLD        EUDS
     D*
     D**************************************************************************
     D***  INTERNE DATENSTRUKTUR                                             ***
     D**************************************************************************
     D/COPY QCPYSRC,EXTRIN
     D*
     D**************************************************************************
     D***  PROGRAMMSTATUS DATENSTRUKTUR                                      ***
     D**************************************************************************
     D/COPY QCPYSRC,EXPSDS
     D*
     C**************************************************************************
     C***       R E C H E N B E S T I M M U N G E N                          ***
     C**************************************************************************
     C                   EXSR      ANFANG
     C**************************************************************************
     C***     P R O G R A M M S T E U E R U N G                             ****
     C**************************************************************************
     C                   EXSR      VKUND
     C*-------------------------------------------------------------------------
     C                   MOVE      *ON           *INLR
     C**************************************************************************
     C***  ERÖFFNUNGSZYKLUS                                                  ***
     C**************************************************************************
     C     ANFANG        BEGSR
     C*
     C*-------------------------------------------------------------------------
     C                   MOVE      *BLANK        WKC001            1            INITIALISIEREN
     C                   MOVE      *ZERO         WKN010            1 0          FELDER
     C*-------------------------------------------------------------------------
     C                   MOVEL(P)  EXPSDSPROC    WKCHPN
     C                   MOVEL(P)  EXPSDSBIBL    WKCHPL
     C                   MOVEL(P)  EXPSDSUSER    WKUSER
     C*-------------------------------------------------------------------------
     C*
     C                   ENDSR
     C**************************************************************************
     C***  VERARBEITEN DATEI KUND                                            ***
     C**************************************************************************
     C     VKUND         BEGSR
     C*
     C*-------------------------------------------------------------------------
     C                   CLEAR                   KYKUND
     C                   MOVEA     '01+     '    CHI
     C                   EXSR      CHKUND
     C*-------------------------------------------------------------------------
     C     CHI(5)        DOWEQ     'J'
     C*--------------------------------------------------------
     C                   IF        KDFIRM     <> EXFIRMFIRM
     C                   MOVEL     KDFIRM        EXFIRMFIRM                     ERMITTELN JA/NEIN-KZ
     C                   EXSR      PRFIRMFIRM
     C                   EXSR      ETRPA
     C                   ENDIF
     C*
     C                   MOVEL(P)  KDFIRM        KYKDEWFIRM
     C                   MOVEL(P)  KDKDNR        KYKDEWKDNR
     C                   MOVEA     '01C     '    CHI
     C                   EXSR      CHKDEW
     C*
     C                   EXSR      UKUND
     C*--------------------------------------------------------
     C                   MOVEA     '01R     '    CHI
     C                   EXSR      CHKUND
     C                   ENDDO
     C*-------------------------------------------------------------------------
     C*
     C                   ENDSR
     C**************************************************************************
     C***  UPDATE DATEI KUND                                                 ***
     C**************************************************************************
     C     UKUND         BEGSR
     C*
     C*-------------------------------------------------------------------------
     C                   MOVEL(P)  KDFIRM        KYKDFI
     C                   MOVEL(P)  KDKDNR        KYKDNR
     C                   MOVEA     '01CU    '    CHI
     C                   EXSR      CHKUND
     C*-------------------------------------------------------------------------
     C                   IF        KDDRUL      = *BLANK
     C                   EVAL      KDDRUL      = KDEWURLD
     C                   ENDIF
     C*
     C                   IF        KDDRZN      = *BLANK
     C                   EVAL      KDDRZN      = KDEWZOTN
     C                   ENDIF
     C*
     C                   IF        KDDRZP      = *BLANK
     C                   EVAL      KDDRZP      = KDEWZPUR
     C                   ENDIF
     C*
     C                   IF        KDSORT      = *BLANK  AND KDEWZPUR='0'
     C                   EVAL      KDSORT      = '1'
     C                   ENDIF
     C                   IF        KDSORT      = *BLANK  AND KDEWZPUR='1'
     C                   EVAL      KDSORT      = '9'
     C                   ENDIF
     C*-------------------------------------------------------------------------
     C                   SELECT
     C*--------------------------------------------------------
     C     CHI(6)        WHENEQ    *OFF
     C                   MOVEA     '01U     '    CHI
     C                   EXSR      CHKUND
     C*--------------------------------------------------------
     C                   ENDSL
     C*-------------------------------------------------------------------------
     C*
     C                   ENDSR
     C**************************************************************************
     C***  ERMITTELN PARAMETERWERTE                                          ***
     C**************************************************************************
     C     ETRPA         BEGSR
     C*
     C*-------------------------------------------------------------------------
     C*-------------------------------------------------------------------------
     C*
     C                   ENDSR
     C**************************************************************************
     C***  DEFINITION DER WORKFELDER...                                      ***
     C**************************************************************************
     C     VLIKE         BEGSR
     C*
     C*-------------------------------------------------------------------------
     C***  ...ANHAND WKC001                                                  ***
     C*-------------------------------------------------------------------------
     C     *LIKE         DEFINE    WKC001        ##CHI           + 7            STEUERUNG
     C     *LIKE         DEFINE    WKC001        ##RTCD                         RETURN-CODE
     C     *LIKE         DEFINE    WKC001        ##PGST                         PROGRAMMSTATUS
     C*--------------------------------------------------------
     C     *LIKE         DEFINE    WKC001        WKFENR          + 3            FEHLERNUMMER
     C*-------------------------------------------------------------------------
     C***  ...ANHAND WKN...                                                  ***
     C*-------------------------------------------------------------------------
     C     *LIKE         DEFINE    WKN010        I1              + 2            INDEX 1
     C*-------------------------------------------------------------------------
     C***  ...ANHAND DATEI-/DATENSTRUKTURFELDERN                             ***
     C*-------------------------------------------------------------------------
     C     *LIKE         DEFINE    KDBIBL        WKCHPL
     C     *LIKE         DEFINE    KDPROG        WKCHPN
     C     *LIKE         DEFINE    KDUSER        WKUSER
     C*-------------------------------------------------------------------------
     C*
     C                   ENDSR
     C**************************************************************************
     C***  COPY-MODULE                                                       ***
     C**************************************************************************
     C/COPY QCPYSRC,CHKDEW
     C/COPY QCPYSRC,CHKUND
     C/COPY QCPYSRC,CHTRPA
     C/COPY QCPYSRC,PRFIRMFIRM
     O**************************************************************************
     O***  ENDE DES PROGRAMMS                                                ***
     O**************************************************************************
