     H DECEDIT('0,') DATEDIT(*DMY.)
     H OPTION(*SRCSTMT : *NODEBUGIO)
     H COPYRIGHT('(C) Copyright trend SWM Verwaltungs GmbH - 2013')
     H**************************************************************************
     H/TITLE  Übernahme LPIF-Daten nach TEIL
     H**************************************************************************
     H*  Copyright 2013    by trend SWM
     H*                       Verwaltung GmbH
     H*                       Gundelfinger Straße 11
     H*                       DE 79108 Freiburg
     H*  -----------------------------------------------------------------------
     H*  Erstellt: GS 06.05.2025
     H*  -----------------------------------------------------------------------
     H*
     F**************************************************************************
     F*
     F* Dieses Programm übernimmt LPIF-Informationen und überträgt diese
     F* in den Identstamm
     F*
     D**************************************************************************
     D***  T A B E L L E N   U N D   F E L D G R U P P E N                   ***
     D**************************************************************************
     D CHIDS           DS
     D CHI                            1    DIM(8)                               STEUERUNG ZUGRIFF
     D*
     D KOMDS           DS
     D KOMUC                        110C   CCSID(13488)
     D KOM                            1    DIM(220)                             KOMMUNIKATION
     D**************************************************************************
     D***  DATEIEN                                                           ***
     D**************************************************************************
     D TEIL          E DS                  INZ
     D KYTEIL        E DS                  INZ
     D*
     D LPIF          E DS                  INZ
     D KYLPIF        E DS                  INZ
     D*
     D**************************************************************************
     D***  KOMMUNIKATIONSPARAMETER                                           ***
     D**************************************************************************
     D EXTR01        E DS                  INZ
     D EXTR02        E DS                  INZ
     D*
     D**************************************************************************
     D***  DATENSTATIONSARBEITSBEREICH                                       ***
     D**************************************************************************
     D EXTRLD        EUDS
     D*
     D**************************************************************************
     D***  PROGRAMMSTATUS DATENSTRUKTUR                                      ***
     D**************************************************************************
     D/COPY QCPYSRC,EXPSDS
     D*
     C**************************************************************************
     C***  R E C H E N B E S T I M M U N G E N                               ***
     C**************************************************************************
     C     *DTAARA       DEFINE    *LDA          EXTRLD
     C                   IN        EXTRLD
     C*-------------------------------------------------------------------------
     C                   EXSR      ANFANG
     C**************************************************************************
     C***  P R O G R A M M S T E U E R U N G                                 ***
     C**************************************************************************
     C                   EXSR      VLPIF
     C*-------------------------------------------------------------------------
     C                   MOVE      *ON           *INLR
     C**************************************************************************
     C***  EROEFFNUNGSZYKLUS                                                 ***
     C**************************************************************************
     C     ANFANG        BEGSR
     C*-------------------------------------------------------------------------
     C                   MOVE      *OFF          *IN
     C*-------------------------------------------------------------------------
     C                   MOVE      *BLANK        WKC001            1            INITIALISIEREN
     C                   MOVE      *ZERO         WKN010            1 0          FELDER
     C*-------------------------------------------------------------------------
     C                   MOVEL(P)  EXPSDSPROC    WKCHPN
     C                   MOVEL(P)  EXPSDSBIBL    WKCHPL
     C                   MOVEL(P)  EXPSDSUSER    WKUSER
     C*-------------------------------------------------------------------------
     C                   MOVE      *BLANK        DAFEHL
     C                   MOVE      *BLANK        ##RTCD
     C*-------------------------------------------------------------------------
     C                   MOVEL(P)  DAFIRM        KYTEFI
     C                   MOVEL(P)  DAFIRM        KYLPFI
     C*-------------------------------------------------------------------------
     C                   MOVE      *ZERO         WKFENR
     C*-------------------------------------------------------------------------
     C                   ENDSR
     C**************************************************************************
     C***  DEFINIION DER WORKFELDER                                          ***
     C**************************************************************************
     C     VLIKE         BEGSR
     C*-------------------------------------------------------------------------
     C     *LIKE         DEFINE    WKC001        ##CHI           + 7            STEUERUNG
     C     *LIKE         DEFINE    WKC001        ##PGST                         PROGRAMMSTATUS
     C     *LIKE         DEFINE    WKC001        ##RTCD                         RETURN-CODE
     C*--------------------------------------------------------
     C     *LIKE         DEFINE    WKC001        WKI000                         IND.ANFANG
     C*--------------------------------------------------------
     C     *LIKE         DEFINE    WKC001        WKFENR          + 3            FEHLERNUMMER
     C*-------------------------------------------------------------------------
     C     *LIKE         DEFINE    WKN010        I0              + 2            INDEX 0
     C*-------------------------------------------------------------------------
     C     *LIKE         DEFINE    DAUSER        WKUSER
     C*-------------------------------------------------------------------------
     C                   ENDSR
     C**************************************************************************
     C***  VERARBEITEN LPIF                           ***
     C**************************************************************************
     C     VLPIF         BEGSR
     C*-------------------------------------------------------------------------
     C/EXEC SQL
     C+ DECLARE LPIFC1 CURSOR FOR SELECT * FROM LPIF
     C+ WHERE LPFIRM   = :DAFIRM
     C+ FOR FETCH ONLY
     C/END-EXEC
     C*-------------------------------------------------------------------------
     C/EXEC SQL
     C+ OPEN LPIFC1
     C/END-EXEC
     C*-------------------------------------------------------------------------
     C                   EVAL      SQLCOD = *ZERO
     C*-------------------------------------------------------------------------
     C                   DOW       SQLCOD = *ZERO
     C*----------------------------------------------------------
     C/EXEC SQL
     C+ FETCH NEXT FROM LPIFC1 INTO :LPIF
     C/END-EXEC
     C*----------------------------------------------------------
     C                   IF        (SQLCOD < 0 OR
     C                              SQLCOD >= 100)
     C                   LEAVE
     C                   ENDIF
     C*----------------------------------------------------------
     C                   EXSR      UTEILSTLF
     C                   ENDDO
     C*-------------------------------------------------------------------------
     C/EXEC SQL
     C+ CLOSE LPIFC1
     C/END-EXEC
     C*-------------------------------------------------------------------------
     C                   ENDSR
      /free
       //----------------------------------------------------------------------
       //  Upadte Datei TEIL
       //----------------------------------------------------------------------
       begsr UTEILSTLF;
         KYTENR = LPTENR;
         CHIDS = '01C';
         exsr CHTEIL;
         // Stammlieferant
         if TESTLF = LPLFNR;
           KYTENR = LPTENR;
           CHIDS = '01CU';
           exsr CHTEIL;

           // Übernahme Daten aus LF-Produkt-Info
           //  TEURLD = LPHKLD;
           //  TEUREG = LPUREG;
           TEMIBM = LPMIBM;
           TELVZ1 = LPLZTG;
           TELVA1 = LPLZTD;

           CHIDS = '01U';
           exsr CHTEIL;
         endif;
       endsr;
      /end-free
     C**************************************************************************
     C***  COPY-MODULE                                                       ***
     C**************************************************************************
     C/COPY QCPYSRC,CHTEIL
     O**************************************************************************
     O***  E N D E   D E S   P R O G R A M M S                               ***
     O**************************************************************************
