     H DECEDIT('0,') DATEDIT(*DMY.)
     H**************************************************************************
     H/TITLE  Update Datei AFPO
     H**************************************************************************
     H*  Copyright 2013 by    trend SWM
     H*                       Verwaltung GmbH
     H*                       Gundelfinger Straße 11
     H*                       DE 79108 Freiburg
     H*  -----------------------------------------------------------------------
     H*  Erstellt: MG 06.02.2013
     H*  -----------------------------------------------------------------------
     H*
     F**************************************************************************
     F*/
     F*/ Update Datei AFPO
     F*/
     D**************************************************************************
     D***  T A B E L L E N   U N D   F E L D G R U P P E N                   ***
     D**************************************************************************
     D/COPY QCPYSRC,EXTRDR
     D*
     D**************************************************************************
     D***  DATEIEN                                                           ***
     D**************************************************************************
     D AFPO          E DS                  INZ
     D KYAFPO        E DS                  INZ
     D*
     D KPIF          E DS                  INZ
     D KYKPIF        E DS                  INZ
     D*
     D TEIL          E DS                  INZ
     D KYTEIL        E DS                  INZ
     D*
     D**************************************************************************
     D***  KOMMUNIKATIONSPARAMETER                                           ***
     D**************************************************************************
     D EXTR01        E DS                  INZ
     D EXTR02        E DS                  INZ
     D*
     D EXAFPO        E DS                  INZ
     D RTAFPO        E DS                  INZ
     D*
     D**************************************************************************
     D***  DATENSTATIONSARBEITSBEREICH                                       ***
     D**************************************************************************
     D EXTRLD        EUDS
     D*
     D**************************************************************************
     D***  INTERNE DATENSTRUKTUR                                             ***
     D**************************************************************************
     D/COPY QCPYSRC,EXTRIN
     D*
     D  WKTDAT                         D   DATFMT(*ISO) INZ
     D*
     D**************************************************************************
     D***  PROGRAMMSTATUS DATENSTRUKTUR                                      ***
     D**************************************************************************
     D/COPY QCPYSRC,EXPSDS
     D*
     C**************************************************************************
     C***  R E C H E N B E S T I M M U N G E N                               ***
     C**************************************************************************
     C     *DTAARA       DEFINE    *LDA          EXTRLD
     C                   IN        EXTRLD
     C*-------------------------------------------------------------------------
     C                   EVAL      DAPROG      = 'DRLBAK'
     C                   OUT       EXTRLD
     C*-------------------------------------------------------------------------
     C                   EXSR      ANFANG
     C**************************************************************************
     C***  P R O G R A M M S T E U E R U N G                                 ***
     C**************************************************************************
     C                   EXSR      OAFPO
     C                   EXSR      VAFPO
     C*-------------------------------------------------------------------------
     C                   MOVE      *ON           *INLR
     C**************************************************************************
     C***  ERÖFFNUNGSZYKLUS                                                  ***
     C**************************************************************************
     C     ANFANG        BEGSR
     C*
     C*-------------------------------------------------------------------------
     C                   MOVE      *BLANK        WKC001            1            INITIALISIEREN
     C                   MOVE      *ZERO         WKN010            1 0          FELDER
     C*-------------------------------------------------------------------------
     C                   MOVEL     DAFIRM        KYAPFI                         AFPO
     C                   MOVEL     DAFIRM        KYKPFI                         KPIF
     C                   MOVEL     DAFIRM        KYTEFI                         TEIL
     C*-------------------------------------------------------------------------
     C*
     C                   ENDSR
     C**************************************************************************
     C***  ÖFFENEN CURSOR AFPOC1                                             ***
     C**************************************************************************
     C     OAFPO         BEGSR
     C*
     C*-------------------------------------------------------------------------
     C/EXEC SQL
     C+ DECLARE AFPOC1 CURSOR FOR SELECT * FROM AFPO
     C+   WHERE APFIRM = :DAFIRM
     C+   AND   NOT EXISTS(SELECT * FROM TEIL WHERE TEIL.TEFIRM=AFPO.APFIRM
     C+                                       AND   TEIL.TETENR=AFPO.APTENR)
     C/END-EXEC
     C*-------------------------------------------------------------------------
     C/EXEC SQL
     C+ OPEN AFPOC1
     C/END-EXEC
     C*-------------------------------------------------------------------------
     C*
     C                   ENDSR
     C**************************************************************************
     C***  VERARBEITEN AFPO                                                  ***
     C**************************************************************************
     C     VAFPO         BEGSR
     C*
     C*-------------------------------------------------------------------------
     C                   MOVE      *ZERO         SQLCOD
     C*-------------------------------------------------------------------------
     C     SQLCOD        DOWEQ     *ZERO
     C*-------------------------------------------------------------------------
     C/EXEC SQL
     C+  FETCH AFPOC1 INTO :AFPO
     C/END-EXEC
     C*-------------------------------------------------------------------------
     C     SQLCOD        IFEQ      *ZERO
     C*--------------------------------------------------------
     C                   MOVEL(P)  APKDNR        KYKPKD
     C                   MOVEL(P)  APTENR        KYKPID
     C                   MOVEA     '02C     '    CHI
     C                   EXSR      CHKPIF
     C*
     C     CHI(5)        IFEQ      'N'
     C                   ITER
     C                   ENDIF
     C*--------------------------------------------------------
     C                   MOVEL(P)  KPTENR        KYTENR
     C                   MOVEA     '01C     '    CHI
     C                   EXSR      CHTEIL
     C*
     C     CHI(5)        IFEQ      'N'
     C                   ITER
     C                   ENDIF
     C*--------------------------------------------------------
     C                   EXSR      UAFPO
     C*--------------------------------------------------------
     C                   ENDIF
     C                   ENDDO
     C*-------------------------------------------------------------------------
     C/EXEC SQL
     C+ CLOSE AFPOC1
     C/END-EXEC
     C*-------------------------------------------------------------------------
     C*
     C                   ENDSR
     C**************************************************************************
     C***  UAFPO  UPDATE DATEI AFPO                                          ***
     C**************************************************************************
     C     UAFPO         BEGSR
     C*
     C*-------------------------------------------------------------------------
     C                   Z-ADD     APAFJJ        KYAPJH
     C                   MOVEL     APAFNR        KYAPAF
     C                   Z-ADD     APAFPO        KYAPPO
     C                   MOVEA     '01CU    '    CHI                            LESEN FÜR
     C                   EXSR      CHAFPO                                       UPDATE
     C*-------------------------------------------------------------------------
     C                   MOVEL     TETENR        APTENR
     C                   MOVEL     TETBZ1        APTBZ1                         BILD03
     C                   MOVEL     TETBZ2        APTBZ2
     C*-------------------------------------------------------------------------
     C                   SELECT
     C*--------------------------------------------------------
     C     CHI(6)        WHENEQ    *OFF
     C                   MOVEA     '01U     '    CHI
     C                   EXSR      CHAFPO
     C*--------------------------------------------------------
     C                   ENDSL
     C*-------------------------------------------------------------------------
     C*
     C                   ENDSR
     C**************************************************************************
     C***  DEFINITION DER WORKFELDER...                                      ***
     C**************************************************************************
     C     VLIKE         BEGSR
     C*
     C*-------------------------------------------------------------------------
     C***  ...ANHAND WKC001                                                  ***
     C*-------------------------------------------------------------------------
     C     *LIKE         DEFINE    WKC001        ##CHI           + 7            STEUERUNG
     C     *LIKE         DEFINE    WKC001        ##PGST                         PROGRAMMSTATUS
     C     *LIKE         DEFINE    WKC001        ##RTCD                         RETURN-CODE
     C*--------------------------------------------------------
     C     *LIKE         DEFINE    WKC001        WKFENR          + 3
     C*-------------------------------------------------------------------------
     C***  ...ANHAND WKN...                                                  ***
     C*-------------------------------------------------------------------------
     C     *LIKE         DEFINE    WKN010        I1              + 2
     C*-------------------------------------------------------------------------
     C***  ...ANHAND DATEI-/DATENSTRUKTURFELDERN                             ***
     C*-------------------------------------------------------------------------
     C*
     C                   ENDSR
     C**************************************************************************
     C***  COPY-MODULE                                                       ***
     C**************************************************************************
     C/COPY QCPYSRC,CHAFPO
     C/COPY QCPYSRC,CHKPIF
     C/COPY QCPYSRC,CHTEIL
     O**************************************************************************
     O***  ENDE DES PROGRAMMS                                                ***
     O**************************************************************************
