     H DECEDIT('0,') DATEDIT(*DMY.)
     H**************************************************************************
     H/TITLE  Update Datei TEIL
     H**************************************************************************
     H*  Copyright 2012 by    trend SWM
     H*                       Verwaltung GmbH
     H*                       Gundelfinger Straße 11
     H*                       DE 79108 Freiburg
     H*  -----------------------------------------------------------------------
     H*  Erstellt: ZG 11.10.2012
     H*  -----------------------------------------------------------------------
     H*
     F**************************************************************************
     F*/
     F*/ Update TESTLF
     F*/
     D**************************************************************************
     D***  T A B E L L E N   U N D   F E L D G R U P P E N                   ***
     D**************************************************************************
     D/COPY QCPYSRC,EXTRDR
     D*
     D**************************************************************************
     D***  DATEIEN                                                           ***
     D**************************************************************************
     D TEIL          E DS                  INZ
     D KYTEIL        E DS                  INZ
     D*
     D PREI          E DS                  INZ
     D KYPREI        E DS                  INZ
     D*
     D**************************************************************************
     D***  KOMMUNIKATIONSPARAMETER                                           ***
     D**************************************************************************
     D EXTR01        E DS                  INZ
     D EXTR02        E DS                  INZ
     D*
     D EXFIRM        E DS                  INZ
     D*
     D EXIFPE        E DS                  INZ
     D RTIFPE        E DS                  INZ
     D*
     D EXTEIL        E DS                  INZ
     D RTTEIL        E DS                  INZ
     D*
     D**************************************************************************
     D***  DATENSTATIONSARBEITSBEREICH                                       ***
     D**************************************************************************
     D EXTRLD        EUDS
     D*
     D**************************************************************************
     D***  INTERNE DATENSTRUKTUR                                             ***
     D**************************************************************************
     D/COPY QCPYSRC,EXTRIN
     D*
     D  WKTDAT                         D   DATFMT(*ISO) INZ
     D*
     D**************************************************************************
     D***  PROGRAMMSTATUS DATENSTRUKTUR                                      ***
     D**************************************************************************
     D/COPY QCPYSRC,EXPSDS
     D*
     C**************************************************************************
     C***  R E C H E N B E S T I M M U N G E N                               ***
     C**************************************************************************
     C     *DTAARA       DEFINE    *LDA          EXTRLD
     C*                  IN        EXTRLD
     C*-------------------------------------------------------------------------
     C                   EXSR      ANFANG
     C**************************************************************************
     C***  P R O G R A M M S T E U E R U N G                                 ***
     C**************************************************************************
     C                   EXSR      OTEIL
     C                   EXSR      VTEIL
     C*-------------------------------------------------------------------------
     C                   MOVE      *ON           *INLR
     C**************************************************************************
     C***  ERÖFFNUNGSZYKLUS                                                  ***
     C**************************************************************************
     C     ANFANG        BEGSR
     C*
     C*-------------------------------------------------------------------------
     C                   MOVE      *BLANK        WKC001            1            INITIALISIEREN
     C                   MOVE      *ZERO         WKN010            1 0          FELDER
     C*-------------------------------------------------------------------------
     C*
     C                   ENDSR
     C**************************************************************************
     C***  ÖFFENEN CURSOR TEILC1                                             ***
     C**************************************************************************
     C     OTEIL         BEGSR
     C*
     C*-------------------------------------------------------------------------
     C/EXEC SQL
     C+ DECLARE TEILC1 CURSOR FOR SELECT * FROM TEIL WHERE TEFIRM='55'
     C/END-EXEC
     C*-------------------------------------------------------------------------
     C/EXEC SQL
     C+ OPEN TEILC1
     C/END-EXEC
     C*-------------------------------------------------------------------------
     C*
     C                   ENDSR
     C**************************************************************************
     C***  VERARBEITEN TEIL                                                  ***
     C**************************************************************************
     C     VTEIL         BEGSR
     C*
     C*-------------------------------------------------------------------------
     C                   MOVE      *ZERO         SQLCOD
     C*-------------------------------------------------------------------------
     C     SQLCOD        DOWEQ     *ZERO
     C*-------------------------------------------------------------------------
     C/EXEC SQL
     C+  FETCH TEILC1 INTO :TEIL
     C/END-EXEC
     C*-------------------------------------------------------------------------
     C     SQLCOD        IFEQ      *ZERO
     C*--------------------------------------------------------
     C     DAFIRM        IFNE      TEFIRM
     C                   MOVEL(P)  TEFIRM        EXFIRMFIRM
     C                   EXSR      PRFIRMFIRM
     C                   MOVEL(P)  EXFIRMFIRM    DAFIRM
     C                   MOVEL(P)  EXFIRMSPCD    DASPCD
     C                   MOVEL(P)  EXFIRMJAKZ    DAJNKZ
     C                   MOVEL(P)  EXFIRMNEKZ    DANEKZ
     C                   OUT       EXTRLD                                       *LDA
     C                   ENDIF
     C*
     C     TESTLF        CASEQ     *BLANK        TRPREI
     C                   ENDCS
     C*
     C*--------------------------------------------------------
     C                   ENDIF
     C                   ENDDO
     C*-------------------------------------------------------------------------
     C/EXEC SQL
     C+ CLOSE TEILC1
     C/END-EXEC
     C*-------------------------------------------------------------------------
     C*
     C                   ENDSR
     C**************************************************************************
     C***  UPDATE IDENT-PREIS-ZUORDNUNG                                      ***
     C**************************************************************************
     C     TRPREI        BEGSR
     C*
     C*-------------------------------------------------------------------------
     C                   MOVEL(P)  TEFIRM        KYPRFI                         PREI
     C*-------------------------------------------------------------------------
     C                   CLEAR                   KYPREI
     C                   MOVEL     TEFIRM        KYPRFI                         PREI
     C                   MOVE      'LP1'         KYPRBG                         SCHLÜSSEL
     C                   MOVE      TETENR        KYPRTE
     C                   MOVE      *LOVAL        KYPRKL
     C                   MOVE      *LOVAL        KYPRWC
     C                   MOVE      *LOVAL        KYPRDA
     C*-------------------------------------------------------------------
     C                   MOVEA     '04+     '    CHI                            LETZTEN SATZ
     C                   EXSR      CHPREI                                       LESEN
     C*-------------------------------------------------------------------
     C     CHI(5)        DOWEQ     'J'
     C*----------------------------------------------------
     C     PRFIRM        IFNE      KYPRFI                                       UNTERGREM MIT
     C     PRBEGR        ORNE      KYPRBG                                       NEUEREM DATUM
     C     PRTENR        ORNE      KYPRTE
     C                   LEAVE
     C                   END
     C*----------------------------------------------------
     C     PRGADA        IFLE      20130109                                     GEFUNDEN
     C*
     C     PRGBDA        IFEQ      *ZERO                                        GÜLTIG BIS
     C     PRGBDA        ORGE      20130109
     C                   MOVEL     PRKDLI        TESTLF                         lieferant
     C                   LEAVE                                                  GEFUNDEN
     C                   END
     C                   END
     C*----------------------------------------------------
     C                   MOVEA     '04R     '    CHI                            LESEN
     C                   EXSR      CHPREI                                       NÄCHSTER SATZ
     C*-------------------------------------------------------------------
     C                   ENDDO
     C*-------------------------------------------------------------------
     C     TESTLF        CASNE     *BLANK        TRTEIL
     C                   ENDCS
     C*-------------------------------------------------------------------
     C*
     C                   ENDSR
     C**************************************************************************
     C***  UPDATE DATEI TEIL                                                 ***
     C**************************************************************************
     C     TRTEIL        BEGSR
     C*
     C*-------------------------------------------------------------------------
     C                   CLEAR                   EXTEIL
     C                   MOVEL     '2     '      EXTEILPGST
     C                   MOVEL     *ON           EXTEILIFKZ
     C                   MOVEL     TETENR        EXTEILTENR
     C                   MOVEL     TESTLF        EXTEILSTLF
     C*
     C                   CALL      'TRTEIL'
     C                   PARM                    EXTEIL
     C                   PARM                    RTTEIL
     C*-------------------------------------------------------------------------
     C*
     C                   ENDSR
     C**************************************************************************
     C***  DEFINITION DER WORKFELDER...                                      ***
     C**************************************************************************
     C     VLIKE         BEGSR
     C*
     C*-------------------------------------------------------------------------
     C***  ...ANHAND WKC001                                                  ***
     C*-------------------------------------------------------------------------
     C     *LIKE         DEFINE    WKC001        ##CHI           + 7            STEUERUNG
     C     *LIKE         DEFINE    WKC001        ##PGST                         PROGRAMMSTATUS
     C     *LIKE         DEFINE    WKC001        ##RTCD                         RETURN-CODE
     C*--------------------------------------------------------
     C     *LIKE         DEFINE    WKC001        WKFENR          + 3
     C*-------------------------------------------------------------------------
     C***  ...ANHAND WKN...                                                  ***
     C*-------------------------------------------------------------------------
     C     *LIKE         DEFINE    WKN010        I1              + 2
     C*-------------------------------------------------------------------------
     C***  ...ANHAND DATEI-/DATENSTRUKTURFELDERN                             ***
     C*-------------------------------------------------------------------------
     C*
     C                   ENDSR
     C**************************************************************************
     C***  COPY-MODULE                                                       ***
     C**************************************************************************
     C/COPY QCPYSRC,PRFIRMFIRM
     C/COPY QCPYSRC,CHPREI
     O**************************************************************************
     O***  ENDE DES PROGRAMMS                                                ***
     O**************************************************************************
