     H DECEDIT('0,') DATEDIT(*DMY.)
     H OPTION(*SRCSTMT : *NODEBUGIO)
     H COPYRIGHT('(C) Copyright trend SWM Verwaltungs GmbH - 2013')
     H**************************************************************************
     H/TITLE  Verarbeiten Kundenstamm für Schilling
     H**************************************************************************
     H*  Copyright 2013    by trend SWM
     H*                       Verwaltung GmbH
     H*                       Gundelfinger Straße 11
     H*                       DE 79108 Freiburg
     H*  -----------------------------------------------------------------------
     H*  Erstellt: SZ 08.07.2013 Projekt 9110, Dometic NL
     H*  -----------------------------------------------------------------------
     H*
     F**************************************************************************
     F*
     F*  Dieses Programm liest eine Datei mit den relevanten Kundennummern,
     F*  ermittelt die Daten aus dem Kundenstamm und ruft für jeden Datensatz
     F*  das Programm TRKUSC auf, für die Übergabe der Daten an Schilling.
     F*
     D**************************************************************************
     D***  T A B E L L E N   U N D   F E L D G R U P P E N                   ***
     D**************************************************************************
     D CHI             S              1    DIM(8)                               STEUERUNG ZUGRIFF
     D KOM             S              1    DIM(220)                             KOMMUNIKATION
     D W99             S              1    DIM(99)                              WORKFELDGRUPPE
     D*
     D**************************************************************************
     D***  DATEIEN                                                           ***
     D**************************************************************************
     D KUNDX4        E DS                  INZ
     D*
     D KUND          E DS                  INZ
     D KYKUND        E DS                  INZ
     D*
     D**************************************************************************
     D***  KOMMUNIKATIONSPARAMETER                                           ***
     D**************************************************************************
     D EXTR01        E DS                  INZ
     D EXTR02        E DS                  INZ
     D*
     D**************************************************************************
     D***  DATENSTATIONSARBEITSBEREICH                                       ***
     D**************************************************************************
     D EXTRLD        EUDS
     D*
     D**************************************************************************
     D***  PROGRAMMSTATUS DATENSTRUKTUR                                      ***
     D**************************************************************************
     D/COPY QCPYSRC,EXPSDS
     D*
     C**************************************************************************
     C***  R E C H E N B E S T I M M U N G E N                               ***
     C**************************************************************************
     C     *DTAARA       DEFINE    *LDA          EXTRLD
     C                   IN        EXTRLD
     C*-------------------------------------------------------------------------
     C                   EXSR      ANFANG
     C**************************************************************************
     C***  P R O G R A M M S T E U E R U N G                                 ***
     C**************************************************************************
     C                   EXSR      VKUNDX4
     C*-------------------------------------------------------------------------
     C                   MOVE      *ON           *INLR
     C**************************************************************************
     C***  EROEFFNUNGSZYKLUS                                                 ***
     C**************************************************************************
     C     ANFANG        BEGSR
     C*-------------------------------------------------------------------------
     C                   MOVE      *OFF          *IN
     C*-------------------------------------------------------------------------
     C                   MOVE      *BLANK        WKC001            1            INITIALISIEREN
     C                   MOVE      *ZERO         WKN010            1 0          FELDER
     C*-------------------------------------------------------------------------
     C                   MOVEL(P)  EXPSDSPROC    WKCHPN
     C                   MOVEL(P)  EXPSDSBIBL    WKCHPL
     C                   MOVEL(P)  EXPSDSUSER    WKUSER
     C*-------------------------------------------------------------------------
     C                   MOVE      *BLANK        DAFEHL
     C                   MOVE      *BLANK        ##RTCD
     C*-------------------------------------------------------------------------
     C                   MOVEL(P)  DAFIRM        KYKDFI
     C*-------------------------------------------------------------------------
     C                   MOVE      *ZERO         WKFENR
     C*-------------------------------------------------------------------------
     C                   ENDSR
     C**************************************************************************
     C***  DEFINIION DER WORKFELDER                                          ***
     C**************************************************************************
     C     VLIKE         BEGSR
     C*-------------------------------------------------------------------------
     C     *LIKE         DEFINE    WKC001        ##CHI           + 7            STEUERUNG
     C     *LIKE         DEFINE    WKC001        ##PGST                         PROGRAMMSTATUS
     C     *LIKE         DEFINE    WKC001        ##RTCD                         RETURN-CODE
     C*--------------------------------------------------------
     C     *LIKE         DEFINE    WKC001        WKI000                         IND.ANFANG
     C*--------------------------------------------------------
     C     *LIKE         DEFINE    WKC001        WKFENR          + 3            FEHLERNUMMER
     C*-------------------------------------------------------------------------
     C     *LIKE         DEFINE    WKN010        I0              + 2            INDEX 0
     C*-------------------------------------------------------------------------
     C     *LIKE         DEFINE    DAUSER        WKUSER
     C*-------------------------------------------------------------------------
     C                   ENDSR
     C**************************************************************************
     C***  VERARBEITEN DATEI MIT KUNDENNUMMERN                               ***
     C**************************************************************************
     C     VKUNDX4       BEGSR
     C*-------------------------------------------------------------------------
     C/EXEC SQL
     C+ DECLARE KUNDC1 CURSOR FOR SELECT * FROM KUNDX4
     C+ WHERE KUNDFIRM = :DAFIRM
     C+ FOR FETCH ONLY
     C/END-EXEC
     C*-------------------------------------------------------------------------
     C/EXEC SQL
     C+ OPEN KUNDC1
     C/END-EXEC
     C*-------------------------------------------------------------------------
     C                   EVAL      SQLCOD = *ZERO
     C*-------------------------------------------------------------------------
     C                   DOW       SQLCOD = *ZERO
     C*----------------------------------------------------------
     C/EXEC SQL
     C+ FETCH NEXT FROM KUNDC1 INTO :KUNDX4
     C/END-EXEC
     C*----------------------------------------------------------
     C                   IF        (SQLCOD < 0 OR
     C                              SQLCOD >= 100)
     C                   LEAVE
     C                   ENDIF
     C*----------------------------------------------------------
     C                   EXSR      VKUND
     C                   ENDDO
     C*-------------------------------------------------------------------------
     C/EXEC SQL
     C+ CLOSE KUNDC1
     C/END-EXEC
     C*-------------------------------------------------------------------------
     C                   ENDSR
     C**************************************************************************
     C***  VERARBEITEN KUNDENSTAMM                                           ***
     C**************************************************************************
     C     VKUND         BEGSR
     C*-------------------------------------------------------------------------
     C                   EVAL      KYKDFI      = KUNDFIRM
     C                   EVAL      KYKDNR      = KUNDKDNR
     C                   MOVEA     '01C     '    CHI
     C                   EXSR      CHKUND
     C*--------------------------------------------------------
     C                   IF        WKFENR     <> *ZERO
     C                   LEAVESR
     C                   ENDIF
     C*--------------------------------------------------------
     C                   IF        KDKDST     >= '90'                           NICHT RELEVANT
     C**                 LEAVESR
     C                   ENDIF
     C*--------------------------------------------------------
     C                   IF        KDDBKD     <> *BLANK        AND
     C                             KDDBKD     <> KDKDNR
     C                   LEAVESR
     C                   ENDIF
     C*--------------------------------------------------------
     C                   MOVEA     *BLANK        KOM
     C                   MOVEA     KDKDNR        KOM(04)
     C                   MOVEA     KOM(01)       #CKOMM
     C                   MOVEL(P)  'U     '      #CPGST
     C                   CALL      'TRKUSC'                             98
     C                   PARM                    EXTR02
     C                   PARM                    KUND
     C*-------------------------------------------------------------------------
     C                   ENDSR
     C**************************************************************************
     C***  COPY-MODULE                                                       ***
     C**************************************************************************
     C/COPY QCPYSRC,CHKUND
     O**************************************************************************
     O***  E N D E   D E S   P R O G R A M M S                               ***
     O**************************************************************************
