     H DECEDIT('0,') DATEDIT(*DMY.)
     H OPTION(*SRCSTMT : *NODEBUGIO)
     H**************************************************************************
     H/TITLE Übernahme Absatz-Plan Erhöhungstabelle
     F**************************************************************************
     F*
     F*  Dieses Programm übernimmt die Absatz-Plan Erhöhungstabelle
     F*
     F**************************************************************************
     F***  DATEIBESCHREIBUNGEN                                               ***
     F**************************************************************************
     FPARAM     IF   E             DISK
     F                                     RENAME(PARAM:PARAM1)
     F*
     D**************************************************************************
     D***  T A B E L L E N   U N D   F E L D G R U P P E N                   ***
     D**************************************************************************
     D/COPY QCPYSRC,EXTRBR
     D*
     D**************************************************************************
     D***  DATEIEN                                                           ***
     D**************************************************************************
     D APEH          E DS                  INZ
     D KYAPEH        E DS                  INZ
     D*
     D TRPA          E DS                  INZ
     D KYTRPA        E DS                  INZ
     D*
     D**************************************************************************
     D***  KOMMUNIKATIONSPARAMETER                                           ***
     D**************************************************************************
     D EXTR01        E DS                  INZ
     D EXTR02        E DS                  INZ
     D EXTR03        E DS                  INZ
     D*
     D EXAPEH        E DS                  INZ
     D RTAPEH        E DS                  INZ
     D*
     D**************************************************************************
     D***  DATENSTATIONSARBEITSBEREICH                                       ***
     D**************************************************************************
     D EXTRLD        EUDS
     D*
     D**************************************************************************
     D***  INTERNE DATENSTRUKTUR                                             ***
     D**************************************************************************
     D/COPY QCPYSRC,EXTRIN
     D*
     D  WKTDAT                         D   DATFMT(*ISO) INZ
     D*
     D**************************************************************************
     D***  PROGRAMMSTATUS DATENSTRUKTUR                                      ***
     D**************************************************************************
     D/COPY QCPYSRC,EXPSDS
     D*
     C**************************************************************************
     C***  R E C H E N B E S T I M M U N G E N                               ***
     C**************************************************************************
     C     *DTAARA       DEFINE    *LDA          EXTRLD
     C                   IN        EXTRLD
     C*-------------------------------------------------------------------------
     C     WKI000        CASNE     *ON           ANFANG
     C                   ENDCS
     C*-------------------------------------------------------------------------
     C     WKTRPA        CASNE     *ON           ETRPA
     C                   ENDCS
     C*-------------------------------------------------------------------------
     C                   EXSR      VORLAUF
     C**************************************************************************
     C***  P R O G R A M M S T E U E R U N G                                 ***
     C**************************************************************************
     C                   EXSR      VAPEH
     C*-------------------------------------------------------------------------
     C                   MOVE      *ON           *INLR
     C**************************************************************************
     C***  ERÖFFNUNGSZYKLUS                                                  ***
     C**************************************************************************
     C     ANFANG        BEGSR
     C*
     C                   MOVE      *ON           WKI000
     C*-------------------------------------------------------------------------
     C                   MOVE      *BLANK        WKC001            1
     C                   Z-ADD     *ZERO         WKN010            1 0
     C*-------------------------------------------------------------------------
     C                   MOVEL(P)  DAFIRM        KYAPEHFIRM                     APEH
     C                   MOVEL(P)  DAFIRM        KYTAFI                         TRPA
     C*-------------------------------------------------------------------------
     C*
     C                   ENDSR
     C**************************************************************************
     C***  VORLAUF                                                           ***
     C**************************************************************************
     C     VORLAUF       BEGSR
     C*
     C*-------------------------------------------------------------------------
     C*-------------------------------------------------------------------------
     C*
     C                   ENDSR
     C**************************************************************************
     C***  ERMITTELN PARAMETERWERTE                                          ***
     C**************************************************************************
     C     ETRPA         BEGSR
     C*
     C                   MOVEL     *ON           WKTRPA
     C*-------------------------------------------------------------------------
     C*-------------------------------------------------------------------------
     C*
     C                   ENDSR
     C**************************************************************************
     C***  SPEICHERN ERHÜHUNGSTABELLE <- KD-STEUERUNGS-CODE/PRODUKT-GRUPPE   ***
     C**************************************************************************
     C     VAPEH         BEGSR
     C*
     C*-------------------------------------------------------------------------
     C                   MOVE      *OFF          *IN
     C*-------------------------------------------------------------------------
     C     *IN(98)       DOWEQ     *OFF
     C     *IN(99)       ANDEQ     *OFF
     C*-------------------------------------------------------------------------
     C                   READ      PARAM1                               9899
     C*
     C     *IN(98)       IFEQ      *ON
     C     *IN(99)       OREQ      *ON
     C                   LEAVE
     C                   ENDIF
     C*-------------------------------------------------------------------------
     C                   CLEAR                   EXAPEH
     C*
     C                   SELECT
     C*--------------------------------------------------------
     C                   WHEN      %LEN(%TRIM(F1)) = 1
     C                   EVAL      EXAPEHKSTC  = %SUBST(F1:1:1) + '01'
     C*--------------------------------------------------------
     C                   WHEN      %LEN(%TRIM(F1)) = 2
     C                   EVAL      EXAPEHKSTC  = %SUBST(F1:1:1) + '0'
     C                                           + %SUBST(F1:2:1)
     C*--------------------------------------------------------
     C                   OTHER
     C                   ITER
     C*--------------------------------------------------------
     C                   ENDSL
     C*
     C                   EVAL      DUN030      = F2
     C                   EVAL      EXAPEHPRGR  = DUC003
     C                   EVAL      EXAPEHJAHR  = 2011
     C                   EVAL      EXAPEHMGPZ  = F6 * 100
     C                   EVAL      EXAPEHPRPZ  = F7 * 100
     C                   EXSR      UAPEH
     C*
     C                   EVAL      EXAPEHJAHR  = 2012
     C                   EVAL      EXAPEHMGPZ  = F8 * 100
     C                   EVAL      EXAPEHPRPZ  = F9 * 100
     C                   EXSR      UAPEH
     C*
     C                   EVAL      EXAPEHJAHR  = 2013
     C                   EVAL      EXAPEHMGPZ  = F10 * 100
     C                   EVAL      EXAPEHPRPZ  = F11 * 100
     C                   EXSR      UAPEH
     C*
     C                   EVAL      EXAPEHJAHR  = 2014
     C                   EVAL      EXAPEHMGPZ  = F12 * 100
     C                   EVAL      EXAPEHPRPZ  = F13 * 100
     C                   EXSR      UAPEH
     C*-------------------------------------------------------------------------
     C                   MOVE      *OFF          *IN
     C                   ENDDO
     C*-------------------------------------------------------------------------
     C*
     C                   ENDSR
     C**************************************************************************
     C***  UPDATE DATEI APEH                                                 ***
     C**************************************************************************
     C     UAPEH         BEGSR
     C*
     C*-------------------------------------------------------------------------
     C                   MOVEL(P)  EXAPEHKSTC    KYAPEHKSTC
     C                   MOVEL(P)  EXAPEHPRGR    KYAPEHPRGR
     C                   Z-ADD     EXAPEHJAHR    KYAPEHJAHR
     C                   MOVEA     '01CU    '    CHI                            LESEN FÜR
     C                   EXSR      CHAPEH                                       UPDATE
     C*-------------------------------------------------------------------------
     C                   Z-ADD     EXAPEHMGPZ    APEHMGPZ
     C                   Z-ADD     EXAPEHPRPZ    APEHPRPZ
     C*--------------------------------------------------------
     C                   MOVEL(P)  DAJNAM        APEHJNAM
     C                   MOVEL(P)  DAPROG        APEHPROG
     C                   MOVEL(P)  WKCHPL        APEHBIBL
     C                   MOVEL(P)  DAUSER        APEHUSER
     C*--------------------------------------------------------
     C                   TIME                    DUN120
     C                   MOVE      DUN120        DUN060
     C     *JOBRUN       MOVE      DUN060        WKTDAT
     C                   MOVEL     DUN120        APEHJZEI
     C                   MOVE      WKTDAT        APEHJDAT
     C*-------------------------------------------------------------------------
     C                   SELECT
     C*--------------------------------------------------------
     C     CHI(6)        WHENEQ    *ON
     C                   MOVEA     '01W     '    CHI
     C                   EXSR      CHAPEH
     C*--------------------------------------------------------
     C     CHI(6)        WHENEQ    *OFF
     C                   MOVEA     '01U     '    CHI
     C                   EXSR      CHAPEH
     C*--------------------------------------------------------
     C                   ENDSL
     C*-------------------------------------------------------------------------
     C*
     C                   ENDSR
     C**************************************************************************
     C***  DEFINITION DER WORKFELDER...                                      ***
     C**************************************************************************
     C     VLIKE         BEGSR
     C*
     C*-------------------------------------------------------------------------
     C***  ...ANHAND WKC001                                                  ***
     C*-------------------------------------------------------------------------
     C     *LIKE         DEFINE    WKC001        ##CHI           + 7
     C     *LIKE         DEFINE    WKC001        ##RTCD
     C     *LIKE         DEFINE    WKC001        ##PGST
     C*--------------------------------------------------------
     C     *LIKE         DEFINE    WKC001        WKFENR          + 3
     C     *LIKE         DEFINE    WKC001        WKI000
     C     *LIKE         DEFINE    WKC001        WKTRPA
     C*-------------------------------------------------------------------------
     C***  ...ANHAND WKN...                                                  ***
     C*-------------------------------------------------------------------------
     C     *LIKE         DEFINE    WKN010        I0              + 2
     C     *LIKE         DEFINE    WKN010        I1              + 2
     C     *LIKE         DEFINE    WKN010        I2              + 2
     C*-------------------------------------------------------------------------
     C***  ...ANHAND DATEI-/DATENSTRUKTURFELDERN                             ***
     C*-------------------------------------------------------------------------
     C     *LIKE         DEFINE    RTAPEHPROG    WKPROG
     C     *LIKE         DEFINE    RTAPEHDANA    WKDANA
     C     *LIKE         DEFINE    RTAPEHFFLD    WKFFLD
     C*-------------------------------------------------------------------------
     C*
     C                   ENDSR
     C**************************************************************************
     C***  COPY-MODULE                                                       ***
     C**************************************************************************
     C/COPY QCPYSRC,CHAPEH
     C/COPY QCPYSRC,CHTRPA
     O**************************************************************************
     O***  ENDE DES PROGRAMMS                                                ***
     O**************************************************************************
