     H DECEDIT('0,') DATEDIT(*DMY.)
     H COPYRIGHT('(C) Copyright trend SWM Verwaltungs GmbH - 2013')
     H**************************************************************************
     H/TITLE  Füllen Schnittstelle zu TNT
     H**************************************************************************
     H*  Copyright 2013 by    trend SWM
     H*                       Verwaltung GmbH
     H*                       Gundelfinger Straße 11
     H*                       DE 79108 Freiburg
     H*  -----------------------------------------------------------------------
     H*  Erstellt: PH 11.03.2013 DOMETIC Projekt 8997
     H*  -----------------------------------------------------------------------
     H*  Änderung: SZ 14.03.2013 nur mit 'J' gekennzeichnete Sendungen verar-
     H*            beiten. Versandadressnummer ermitteln.
     H*  Änderung: SZ 25.03.2013 Produkt 'KNR' statt '7UHR'
     H**************************************************************************
     F*
     F*  Das Programm verarbeitet aus der Schnittstellendatei SPEDI0 für TNT die
     F*  zum Versand gekennzeichneten ('J') Sendungen. Es wird die Schnittstel-
     F*  lenfile SPEDI1 gefüllt, die ansdchliessend per FTP an TNT gesand wird.
     F*
     F*  Die verarbeiteten Sätze werden im weiteren Verlauf des Jobs erst ko-
     F*  piert und damit gesichert, anschliessend dann aus SPEDI0 gelöscht.
     F*
     D**************************************************************************
     D***  T A B E L L E N   U N D   F E L D G R U P P E N                   ***
     D**************************************************************************
     D/COPY QCPYSRC,EXTRDR
     D*
     D**************************************************************************
     D***  DATEIEN                                                           ***
     D**************************************************************************
     D KUND          E DS                  INZ
     D KYKUND        E DS                  INZ
     C*
     D SPEDI0        E DS                  INZ
     D KYSPI0        E DS                  INZ
     C*
     D SPEDI1        E DS                  INZ
     D*
     D TRPA          E DS                  INZ
     D KYTRPA        E DS                  INZ
     D*
     D TRTP          E DS                  INZ
     D KYTRTP        E DS                  INZ
     D*
     D**************************************************************************
     D***  KOMMUNIKATIONSPARAMETER                                           ***
     D**************************************************************************
     D EXTR01        E DS                  INZ
     D EXTR02        E DS                  INZ
     D*
     D**************************************************************************
     D***  INTERNE DATENSTRUKTUR                                             ***
     D**************************************************************************
     D/COPY QCPYSRC,EXTRIN
     D*
     D  WKTDAT         S               D   DATFMT(*ISO) INZ
     D*
     D**************************************************************************
     D***  DATENSTATIONSARBEITSBEREICH                                       ***
     D**************************************************************************
     D EXTRLD        EUDS
     D*
     D**************************************************************************
     D***  PROGRAMMSTATUS DATENSTRUKTUR                                      ***
     D**************************************************************************
     D/COPY QCPYSRC,EXPSDS
     D*
     C**************************************************************************
     C***  R E C H E N B E S T I M M U N G E N                               ***
     C**************************************************************************
     C     *DTAARA       DEFINE    *LDA          EXTRLD
     C                   IN        EXTRLD
     C*-------------------------------------------------------------------------
     C     WKI000        IFNE      *ON
     C                   EXSR      ANFANG
     C                   EXSR      ETRPA
     C                   ENDIF
     C*-------------------------------------------------------------------------
     C                   EXSR      VORLAUF
     C**************************************************************************
     C***  P R O G R A M M S T E U E R U N G                                 ***
     C**************************************************************************
     C                   EXSR      DSPEDI1
     C                   EXSR      OSPEDI0
     C                   EXSR      VSPEDI0
     C*-------------------------------------------------------------------------
     C                   MOVE      *ON           *INLR
     C**************************************************************************
     C***  ERÖFFNUNGSZYKLUS                                                  ***
     C**************************************************************************
     C     ANFANG        BEGSR
     C*-------------------------------------------------------------------------
     C                   MOVE      *ON           WKI000
     C*-------------------------------------------------------------------------
     C                   MOVE      *BLANK        WKC001            1
     C                   Z-ADD     *ZERO         WKN010            1 0
     C*-------------------------------------------------------------------------
     C                   EVAL      KYKDFI      = DAFIRM                         KUND
     C*-------------------------------------------------------------------------
     C                   ENDSR
     C**************************************************************************
     C***  VORLAUF                                                           ***
     C**************************************************************************
     C     VORLAUF       BEGSR
     C*-------------------------------------------------------------------------
     C                   TIME                    DUN120
     C                   MOVE      DUN120        DUN060
     C     *JOBRUN       MOVE      DUN060        WKTDAT
     C                   MOVEL     DUN120        WKZEIT
     C                   MOVE      WKTDAT        WKDATE
     C*-------------------------------------------------------------------------
     C                   Z-ADD     *ZERO         WKLFNS
     C*-------------------------------------------------------------------------
     C                   ENDSR
     C**************************************************************************
     C***  ERMITTELN PARAMETERWERTE                                          ***
     C**************************************************************************
     C     ETRPA         BEGSR
     C*-------------------------------------------------------------------------
     C*-------------------------------------------------------------------------
     C                   ENDSR
     C**************************************************************************
     C***  LEEREN DATEI SPEDI1
     C**************************************************************************
     C     DSPEDI1       BEGSR
     C*-------------------------------------------------------------------------
     C/EXEC SQL
     C+ DELETE FROM SPEDI1
     C/END-EXEC
     C*-------------------------------------------------------------------------
     C                   ENDSR
     C**************************************************************************
     C***  ÖFFENEN CURSOR SPEDI0C1                                           ***
     C**************************************************************************
     C     OSPEDI0       BEGSR
     C*-------------------------------------------------------------------------
     C/EXEC SQL
     C+ DECLARE SPEDI0C1 CURSOR FOR SELECT * FROM SPEDI0
     C+ WHERE TNT010 = 'S' AND TNT520 = :DAJNKZ
     C+ ORDER BY TNT020
     C+ FOR FETCH ONLY
     C/END-EXEC
     C*-------------------------------------------------------------------------
     C/EXEC SQL
     C+ OPEN SPEDI0C1
     C/END-EXEC
     C*-------------------------------------------------------------------------
     C                   ENDSR
     C**************************************************************************
     C***  LESEN SPEDI0                                                      ***
     C**************************************************************************
     C     VSPEDI0       BEGSR
     C*-------------------------------------------------------------------------
     C                   Z-ADD     *ZERO         SQLCOD
     C*-------------------------------------------------------------------------
     C     SQLCOD        DOWEQ     *ZERO
     C*-------------------------------------------------------------------------
     C/EXEC SQL
     C+ FETCH NEXT FROM SPEDI0C1 INTO :SPEDI0
     C/END-EXEC
     C*-------------------------------------------------------------------------
     C     SQLCOD        IFNE      *ZERO
     C                   LEAVE
     C                   ENDIF
     C*-------------------------------------------------------------------------
     C                   ADD       1             WKLFNS
     C                   EXSR      EKUND
     C                   EXSR      FSPEDI1
     C*-------------------------------------------------------------------------
     C                   MOVEL(P)  TNT020        KYSPI0T020
     C                   MOVEA     '01+     '    CHI
     C                   EXSR      CHSPI0
     C*-------------------------------------------------------------------------
     C     CHI(5)        DOWEQ     'J'
     C     TNT020        ANDEQ     KYSPI0T020
     C*----------------------------------------------------------
     C     TNT010        IFEQ      'P'
     C                   EXSR      FSPEDI1
     C                   ENDIF
     C*----------------------------------------------------------
     C                   MOVEA     '01R     '    CHI
     C                   EXSR      CHSPI0
     C                   ENDDO
     C*-------------------------------------------------------------------------
     C                   ENDDO
     C*-------------------------------------------------------------------------
     C     WKLFNS        IFGT      *ZERO
     C                   Z-ADD     WKTNT360      DUN040
     C                   Z-ADD     WKTNT320      DUN052
     C                   EVAL      DUC1024 = 'SUM' + '|'
     C                             + %TRIM(%EDITC(DUN040 : 'Z')) + '|'
     C                             + %TRIM(%EDITC(DUN052 : '4')) + '||||||||'
     C                   EXSR      ISPEDI1
     C                   ENDIF
     C*-------------------------------------------------------------------------
     C                   ENDSR
     C**************************************************************************
     C***  FÜLLEN SPEDI1                                                     ***
     C**************************************************************************
     C     FSPEDI1       BEGSR
     C*-------------------------------------------------------------------------
     C                   SELECT
     C*--------------------------------------------------------
     C     TNT010        WHENEQ    'S'
     C*
     C     WKLFNS        IFGT      1
     C                   Z-ADD     WKTNT360      DUN040
     C                   Z-ADD     WKTNT320      DUN052
     C                   EVAL      DUC1024 = 'SUM' + '|'
     C                             + %TRIM(%EDITC(DUN040 : 'Z')) + '|'
     C                             + %TRIM(%EDITC(DUN052 : '4')) + '||||||||'
     C                   EXSR      ISPEDI1
     C                   ENDIF
     C*
     C                   Z-ADD     TNT360        WKTNT360
     C                   Z-ADD     TNT320        WKTNT320
     C*
     C                   Z-ADD     WKDATE        DUN080
     C                   Z-ADD     WKLFNS        DUN060
     C                   EVAL      DUC1024 = 'SID' + '|' + '001' + '||' + DUC008
     C                             + '|' + DUC006 + '|' + %TRIM(TNT020) + '|'
     C                             + 'trend SWM' + '|' + '1.8' + '|'
     C                             + %TRIM(TNT500) + '||'
     C                   EXSR      ISPEDI1
     C*
     C                   EVAL      DUC1024 = 'VID' + '|' + %TRIM(WKADNR) + '|'
     C                             + '0001' + '|' + %TRIM(TNT090) + '|||||'
     C                   EXSR      ISPEDI1
     C*
     C                   EVAL      DUC1024 = 'VN1' + '|' + %TRIM(TNT030) + '|'
     C                             + %TRIM(TNT040) + '|'
     C                   EXSR      ISPEDI1
     C*
     C                   EVAL      DUC1024 = 'VST' + '|' + %TRIM(TNT050) + '||'
     C                   EXSR      ISPEDI1
     C*
     C                   EVAL      DUC1024 = 'VOR' + '|' + %TRIM(TNT060) + '|'
     C                             + %TRIM(TNT070) + '|' + %TRIM(TNT080) + '|'
     C                   EXSR      ISPEDI1
     C*
     C                   EVAL      DUC1024 = 'EN1' + '|' + %TRIM(TNT120) + '|'
     C                             + %TRIM(TNT130) + '|'
     C                   EXSR      ISPEDI1
     C*
     C                   EVAL      DUC1024 = 'EST' + '|' + %TRIM(TNT140) + '||'
     C                   EXSR      ISPEDI1
     C*
     C                   EVAL      DUC1024 = 'EOR' + '|' + %TRIM(TNT150) + '|'
     C                             + %TRIM(TNT160) + '|' + %TRIM(TNT170) + '|'
     C                   EXSR      ISPEDI1
     C*
     C                   EVAL      DUC1024 = 'DLS' + '|' + %TRIM(TNT340) + '|'
     C                             + 'KNR' + '||||||'
     C                   EXSR      ISPEDI1
     C*--------------------------------------------------------
     C     TNT010        WHENEQ    'P'
     C                   Z-ADD     TNT320        DUN052
     C                   EVAL      DUC1024 = 'PID' + '|' + %TRIM(TNT480) + '||'
     C                             + %TRIM(%EDITC(DUN052 : '4')) + '||||||'
     C                   EXSR      ISPEDI1
     C*--------------------------------------------------------
     C                   ENDSL
     C*-------------------------------------------------------------------------
     C                   ENDSR
     C**************************************************************************
     C***  AUSGEBEN IN SPEDI1                                                ***
     C**************************************************************************
     C     ISPEDI1       BEGSR
     C*-------------------------------------------------------------------------
     C/EXEC SQL
     C+ INSERT INTO SPEDI1(SPEDI1FELD)
     C+ VALUES (:DUC1024)
     C/END-EXEC
     C*-------------------------------------------------------------------------
     C                   ENDSR
     C**************************************************************************
     C***  ERMITTELN DATEN AUS KUND                                          ***
     C**************************************************************************
     C     EKUND         BEGSR
     C*-------------------------------------------------------------------------
     C                   EVAL      KYKDNR      = TNT180
     C                   MOVEA     '01C     '    CHI
     C                   EXSR      CHKUND
     C*-------------------------------------------------------------------------
     C                   SELECT
     C                   WHEN      KDRAKD      = '009846'                       Trost
     C                   EVAL      WKADNR      = '00000002'
     C                   WHEN      KDRAKD      = '059078'                       KSM
     C                   EVAL      WKADNR      = '00000003'
     C                   WHEN      KDRAKD      = '006123'                       Matthies
     C                   EVAL      WKADNR      = '00000004'
     C                   OTHER                                                  Dometic-WAECO
     C                   EVAL      WKADNR      = '00000001'
     C                   ENDSL
     C*-------------------------------------------------------------------------
     C                   ENDSR
     C**************************************************************************
     C***  DEFINITION DER WORKFELDER...                                      ***
     C**************************************************************************
     C     VLIKE         BEGSR
     C*-------------------------------------------------------------------------
     C***  ...ANHAND WKC001                                                  ***
     C*-------------------------------------------------------------------------
     C     *LIKE         DEFINE    WKC001        ##CHI           + 7
     C     *LIKE         DEFINE    WKC001        ##RTCD
     C     *LIKE         DEFINE    WKC001        ##PGST
     C*--------------------------------------------------------
     C     *LIKE         DEFINE    WKC001        WKRTCD
     C     *LIKE         DEFINE    WKC001        WKFENR          + 3
     C     *LIKE         DEFINE    WKC001        WKI000
     C*--------------------------------------------------------
     C     *LIKE         DEFINE    WKC001        WKADNR          + 7            ADRESSNUMMER
     C*-------------------------------------------------------------------------
     C***  ...ANHAND WKN...                                                  ***
     C*-------------------------------------------------------------------------
     C     *LIKE         DEFINE    WKN010        I0              + 2
     C     *LIKE         DEFINE    WKN010        I1              + 2
     C     *LIKE         DEFINE    WKN010        I2              + 2
     C*-------------------------------------------------------------------------
     C***  ...ANHAND DATEI-/DATENSTRUKTURFELDERN                             ***
     C*-------------------------------------------------------------------------
     C     *LIKE         DEFINE    DUN060        WKZEIT
     C     *LIKE         DEFINE    DUN060        WKLFNS
     C     *LIKE         DEFINE    DUN080        WKDATE
     C     *LIKE         DEFINE    TNT360        WKTNT360
     C     *LIKE         DEFINE    TNT320        WKTNT320
     C*-------------------------------------------------------------------------
     C                   ENDSR
     C**************************************************************************
     C***  COPY-MODULE                                                       ***
     C**************************************************************************
     C/COPY QCPYSRC,CHKUND
     C/COPY QCPYSRC,CHSPI0
     C/COPY QCPYSRC,CHTRPA
     O**************************************************************************
     O***  ENDE DES PROGRAMMS                                                ***
     O**************************************************************************
