     H DECEDIT('0,') DATEDIT(*DMY.)
     H COPYRIGHT('(C) Copyright trend SWM Verwaltungs GmbH - 2011')
     H**************************************************************************
     H/TITLE  Erstellen AFVS, Satz Speditionsdatei über MOAFVS nach Selektion
     H**************************************************************************
     H*  Copyright 2011 by    trend SWM
     H*                       Verwaltung GmbH
     H*                       Gundelfinger Straße 11
     H*                       DE 79108 Freiburg
     H*  -----------------------------------------------------------------------
     H*  Erstellt: SZ 09.03.2011
     H*  -----------------------------------------------------------------------
/*  ÄH*  Änderung:
     H*
     H**************************************************************************
     F*
     F*  Dieses Programm liest LBAK nach den übergebenen Selektionswerten und
     F*  schreibt je Packstück einen Datensatz in AFVS und in die entsprechende
     F*  Speditionsdatei. Dies passiert durch Aufruf MOAFVS.
     F*
     D**************************************************************************
     D***  T A B E L L E N   U N D   F E L D G R U P P E N                   ***
     D**************************************************************************
     D/COPY QCPYSRC,EXTRBR
     D*
     D**************************************************************************
     D***  DATEIEN                                                           ***
     D**************************************************************************
     D LBAK          E DS                  INZ
     D KYLBAK        E DS                  INZ
     D*
     D TRPA          E DS                  INZ
     D KYTRPA        E DS                  INZ
     D*
     D TRTP          E DS                  INZ
     D KYTRTP        E DS                  INZ
     D*
     D**************************************************************************
     D***  KOMMUNIKATIONSPARAMETER                                           ***
     D**************************************************************************
     D EXTR01        E DS                  INZ
     D EXTR02        E DS
     D*
     D EXDATE        E DS                  INZ
     D RTDATE        E DS                  INZ
     D*
     D EXTREND       E DS                  INZ
     D RTTREND       E DS                  INZ
     D*
     D**************************************************************************
     D***  INTERNE DATENSTRUKTUR                                             ***
     D**************************************************************************
     D/COPY QCPYSRC,EXTRIN
     D*
     D  WKTDAT         S               D   DATFMT(*ISO) INZ
     D*
     D**************************************************************************
     D***  DATENSTATIONSARBEITSBEREICH                                       ***
     D**************************************************************************
     D EXTRLD        EUDS
     D*
     D**************************************************************************
     D***  PROGRAMMSTATUS DATENSTRUKTUR                                      ***
     D**************************************************************************
     D/COPY QCPYSRC,EXPSDS
     D*
     C**************************************************************************
     C***  R E C H E N B E S T I M M U N G E N                               ***
     C**************************************************************************
     C     *ENTRY        PLIST
     C                   PARM                    EXTR02
     C*
     C                   EXSR      UEBKOM
     C*-------------------------------------------------------------------------
     C     *DTAARA       DEFINE    *LDA          EXTRLD
     C                   IN        EXTRLD
     C*-------------------------------------------------------------------------
     C                   EXSR      ANFANG
     C                   EXSR      ETRPA
     C*-------------------------------------------------------------------------
     C                   EXSR      VORLAUF
     C**************************************************************************
     C***  P R O G R A M M S T E U E R U N G                                 ***
     C**************************************************************************
     C                   EXSR      OLBAK
     C                   EXSR      VLBAK
     C*-------------------------------------------------------------------------
     C                   MOVE      *ON           *INLR
     C**************************************************************************
     C***  ERÖFFNUNGSZYKLUS                                                  ***
     C**************************************************************************
     C     ANFANG        BEGSR
     C*
     C*-------------------------------------------------------------------------
     C                   MOVE      *BLANK        WKC001            1
     C                   Z-ADD     *ZERO         WKN010            1 0
     C*-------------------------------------------------------------------------
     C                   MOVEL(P)  DAFIRM        KYLBAKFIRM                     LBAK
     C                   MOVEL(P)  DAFIRM        KYTAFI                         TRPA
     C                   MOVEL(P)  DAFIRM        KYTPFI                         TRTP
     C*-------------------------------------------------------------------------
     C                   MOVEL(P)  DASPCD        KYTPSP                         TRTP
     C*-------------------------------------------------------------------------
     C*
     C                   ENDSR
     C**************************************************************************
     C***  UEBERNAHME KOM-BEREICH                                            ***
     C**************************************************************************
     C     UEBKOM        BEGSR
     C*
     C*-------------------------------------------------------------------------
     C                   MOVEA     #CKOMM        KOM
     C*--------------------------------------------------------
     C                   MOVEA     KOM(01)       DUC008
     C                   TESTN                   DUC008               97
     C*
     C                   IF        *IN97       = *ON
     C                   MOVE      DUN080        WKTDAT
     C                   ELSE
     C                   CLEAR                   WKTDAT
     C                   ENDIF
     C*
     C                   MOVE      WKTDAT        WKJDAT
     C*--------------------------------------------------------
     C                   MOVEA     KOM(09)       WKVSBD
     C*--------------------------------------------------------
     C                   Z-ADD     *ZERO         WKAZVP
     C                   MOVEA     KOM(12)       DUC002
     C                   TESTN                   DUC002               97
     C*
     C                   IF        *IN97       = *ON
     C                   Z-ADD     DUN020        WKAZVP
     C                   ENDIF
     C*--------------------------------------------------------
     C                   MOVEA     KOM(14)       WKDANA
     C*-------------------------------------------------------------------------
     C*
     C                   ENDSR
     C**************************************************************************
     C***  VORLAUF                                                           ***
     C**************************************************************************
     C     VORLAUF       BEGSR
     C*
     C*-------------------------------------------------------------------------
     C*-------------------------------------------------------------------------
     C*
     C                   ENDSR
     C**************************************************************************
     C***  ERMITTELN PARAMETERWERTE                                          ***
     C**************************************************************************
     C     ETRPA         BEGSR
     C*
     C*-------------------------------------------------------------------------
     C*-------------------------------------------------------------------------
     C*
     C                   ENDSR
     C**************************************************************************
     C***  ÖFFNEN CURSOR LBAKC1                                              ***
     C**************************************************************************
     C     OLBAK         BEGSR
     C*
     C*-------------------------------------------------------------------------
     C/EXEC SQL
     C+ DECLARE LBAKC1 CURSOR FOR SELECT * FROM LBAK
     C+ WHERE LBAK.LBAKFIRM = :DAFIRM
     C+ AND   LBAK.LBAKDANA = :WKDANA
     C+ AND   LBAK.LBAKVSBD = :WKVSBD
     C+ AND   LBAK.LBAKJDAT = :WKJDAT
     C+ ORDER BY LBAK.LBAKFIRM, LBAK.LBAKDANA, LBAK.LBAKJAHR, LBAK.LBAKNMKR
     C+ FOR FETCH ONLY
     C/END-EXEC
     C*-------------------------------------------------------------------------
     C/EXEC SQL
     C+ OPEN LBAKC1
     C/END-EXEC
     C*-------------------------------------------------------------------------
     C*
     C                   ENDSR
     C**************************************************************************
     C***  VERARBEITEN LBAK                                                  ***
     C**************************************************************************
     C     VLBAK         BEGSR
     C*
     C*-------------------------------------------------------------------------
     C                   MOVE      *ZERO         SQLCOD
     C*-------------------------------------------------------------------------
     C                   DOW       SQLCOD      = *ZERO
     C*----------------------------------------------------------
     C/EXEC SQL
     C+ FETCH NEXT FROM LBAKC1 INTO :LBAK
     C/END-EXEC
     C*----------------------------------------------------------
     C     SQLCOD        IFNE      *ZERO
     C                   LEAVE
     C                   ENDIF
     C*----------------------------------------------------------
     C                   EVAL      I1          = *ZERO
     C*
     C**                 DOU       I1          = WKAZVP
     C**                 EVAL      I1          = I1 + 1
     C                   EXSR      MOAFVS                                       DOCH NUR 1 SATZ AUS-
     C**                 ENDDO                                                  GEBEN, WEGEN ANGABEN
     C*----------------------------------------------------------               1 VON 2, 2 VON 2, ..
     C                   ENDDO
     C*-------------------------------------------------------------------------
     C*
     C                   ENDSR
     C**************************************************************************
     C***  AUFRUF MOAFVS                                                     ***
     C**************************************************************************
     C     MOAFVS        BEGSR
     C*
     C*-------------------------------------------------------------------------
     C                   CLEAR                   EXTREND
     C                   EVAL      EXTRNDPGST  = 'SPED'
     C                   EVAL      EXTRNDPROG  = 'TRLBAK'
     C                   Z-ADD     LBAKJAHR      DUN040
     C                   Z-ADD     WKAZVP        DUN050
     C                   EVAL      DUC010      = *BLANK
     C                   EVAL      EXTRNDKEYB  = DUC004 + LBAKNMKR + DUC010 +
     C                                           DUC005
     C*
     C                   CALL      'MOAFVS'                             98
     C                   PARM                    EXTREND
     C                   PARM                    RTTREND
     C*-------------------------------------------------------------------------
     C*
     C                   ENDSR
     C**************************************************************************
     C***  DEFINITION DER WORKFELDER...                                      ***
     C**************************************************************************
     C     VLIKE         BEGSR
     C*
     C*-------------------------------------------------------------------------
     C***  ...ANHAND WKC001                                                  ***
     C*-------------------------------------------------------------------------
     C     *LIKE         DEFINE    WKC001        ##CHI           + 7
     C     *LIKE         DEFINE    WKC001        ##RTCD
     C     *LIKE         DEFINE    WKC001        ##PGST
     C*--------------------------------------------------------
     C     *LIKE         DEFINE    WKC001        WKIFMT          + 1
     C     *LIKE         DEFINE    WKC001        WKRTCD
     C     *LIKE         DEFINE    WKC001        WKFENR          + 3
     C*-------------------------------------------------------------------------
     C***  ...ANHAND WKN...                                                  ***
     C*-------------------------------------------------------------------------
     C     *LIKE         DEFINE    WKN010        I1              + 2
     C*--------------------------------------------------------
     C     *LIKE         DEFINE    WKN010        WKAZVP          + 1
     C*-------------------------------------------------------------------------
     C***  ...ANHAND DATEI-/DATENSTRUKTURFELDERN                             ***
     C*-------------------------------------------------------------------------
     C     *LIKE         DEFINE    LBAKDANA      WKDANA
     C     *LIKE         DEFINE    LBAKVSBD      WKVSBD
     C     *LIKE         DEFINE    LBAKJDAT      WKJDAT
     C*-------------------------------------------------------------------------
     C*
     C                   ENDSR
     C**************************************************************************
     C***  COPY-MODULE                                                       ***
     C**************************************************************************
     C/COPY QCPYSRC,CHLBAK
     C/COPY QCPYSRC,CHTRPA
     C/COPY QCPYSRC,CHTRTP
     O**************************************************************************
     O***  ENDE DES PROGRAMMS                                                ***
     O**************************************************************************
