     H DECEDIT('0,') DATEDIT(*DMY.)
     H COPYRIGHT('(C) Copyright trend SWM Verwaltung GmbH - 2002')
     H**************************************************************************
     H/TITLE  Aufruf Ermitteln "WV-Termin"
     H**************************************************************************
     H*  Copyright 2003 by    trend SWM
     H*                       Verwaltung GmbH
     H*                       Ziegelhofstraße 210a
     H*                       DE 79110 Freiburg
     H*  -----------------------------------------------------------------------
     H*  Erstellt: RS 17.08.2012 Dometic Projekt 8589
     H*  -----------------------------------------------------------------------
     F**************************************************************************
     F*
     F*
     F**************************************************************************
     F***  DATEIBESCHREIBUNGEN                                               ***
     F**************************************************************************
     D**************************************************************************
     D***  T A B E L L E N   U N D   F E L D G R U P P E N                   ***
     D**************************************************************************
     D/COPY QCPYSRC,EXTRDR
     D*
     D**************************************************************************
     D***  DATEIEN                                                           ***
     D**************************************************************************
     D***  KOMMUNIKATIONSPARAMETER                                           ***
     D**************************************************************************
     D EXTREND       E DS                  INZ
     D RTTREND       E DS                  INZ
     D**************************************************************************
     D***  INTERNE DATENSTRUKTUR                                             ***
     D**************************************************************************
     D/COPY QCPYSRC,EXTRIN
     D**************************************************************************
     D***  DATENSTATIONSARBEITSBEREICH                                       ***
     D**************************************************************************
     D EXTRLD        EUDS
     D*
     D**************************************************************************
     D***  PROGRAMMSTATUS DATENSTRUKTUR                                      ***
     D**************************************************************************
     D/COPY QCPYSRC,EXPSDS
     D*
     C**************************************************************************
     C***  R E C H E N B E S T I M M U N G E N                               ***
     C**************************************************************************
     C     *ENTRY        PLIST
     C                   PARM                    EXTRNDAFJJ
     C                   PARM                    EXTRNDAFNR
     C                   PARM                    EXTRNDAFPO
     C                   PARM                    EXTRNDWVTE
     C*-------------------------------------------------------------------------
     C     *DTAARA       DEFINE    *LDA          EXTRLD
     C                   IN        EXTRLD
     C*-------------------------------------------------------------------------
     C*
     C**************************************************************************
     C***  P R O G R A M M S T E U E R U N G                                 ***
     C**************************************************************************
     C*
     C*-------------------------------------------------------------------------
     C                   MOVE      *ZERO         WKFENR
     C*-------------------------------------------------------------------------
     C     EXTRNDAFJJ    IFNE      *BLANK
     C     EXTRNDAFNR    ORNE      *BLANK
     C     EXTRNDAFPO    ORNE      *BLANK
     C                   CLEAR                   EXTREND
     C                   CLEAR                   RTTREND
     C                   EVAL      EXTRNDKEYB = EXTRNDAFJJ + EXTRNDAFNR
     C                             + EXTRNDAFPO
     C*
     C                   CALL      'WAO008'                             99
     C                   PARM                    EXTREND
     C                   PARM                    RTTREND
     C*-------------------------------------------------------------------------
     C                   EVAL      DUC008=%SUBST(RTTRNDDATE:001:008)
     C                   TESTN                   DUC008               97
     C     *IN97         IFEQ      *OFF
     C                   MOVEL     *ZERO         DUC008
     C                   ENDIF
     C                   Z-ADD(H)  DUN080        EXTRNDWVTE
     C     EXTRNDWVTE    IFLT      *ZERO
     C                   Z-ADD     *ZERO         EXTRNDWVTE
     C                   ENDIF
     C                   ENDIF
     C*-------------------------------------------------------------------------
     C*
     C                   SETON                                        LR
     C**************************************************************************
     C***  DEFINITION DER WORKFELDER...                                      ***
     C**************************************************************************
     C     VLIKE         BEGSR
     C*
     C*-------------------------------------------------------------------------
     C***  ...ANHAND WKC001                                                  ***
     C*-------------------------------------------------------------------------
     C     *LIKE         DEFINE    DUC001        WKFENR          + 3            FEHLERNUMMER
     C     *LIKE         DEFINE    DUC001        EXTRNDAFJJ      + 3
     C     *LIKE         DEFINE    DUC001        EXTRNDAFNR      + 5
     C     *LIKE         DEFINE    DUC001        EXTRNDAFPO      + 4
     C     *LIKE         DEFINE    DUN080        EXTRNDWVTE
     C*-------------------------------------------------------------------------
     C*
     C                   ENDSR
     O**************************************************************************
     O***  ENDE DES PROGRAMMS                                                ***
     O**************************************************************************
