/*    * PROGRAMMNAME.:$FAKTU61_W                                             */
/*    * FUNKTION.....:...                                                    */
/*    * 31.08.11       schneider                                              */
/*    *                                                                       */
/*    *-start Wochenrechung über kalenderdatei                               */
/*    *-parameter: WO = Wochenrechnung                                       */
/*    *            WM = Wochenrechnung+Monatsrechnung                        */
/*    *            M  = Monatsrechnung                                       */
/*    *                                                                      */
/*    * Hinweis:                                                             */
/*    * sind in der kalenderdatei (bar_vert/kalendern) keine einträge        */
/*    * in den zeiten vorhanden, wird die jeweilige standardzeit             */
/*    * vorbelegt.                                                           */
/*    * in diesem fall 12:00 uhr für wochenrechnungen                        */
/*    * bei änderungen der standardzeiten diese im programm ändern!!         */
/*    * dieses programm wird über scde derzeit um 11:45h im sbs qsyswrk      */
/*    * täglich gestartet. ($FAKTU561W)                                      */
/*    *                                                                       */
/******************************************************************************/
             PGM        PARM(&LOKATION)

             DCLF       FILE(BAR_VERT/KALENDERN) OPNID(A)
             DCL        VAR(&DATUMC) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DATUMS) TYPE(*DEC) LEN(6 0)
             DCL        VAR(&QTIME) TYPE(*CHAR) LEN(6)
             DCL        VAR(&TIME61) TYPE(*CHAR) LEN(6) /* Fa 61 */
             DCL        VAR(&TIME61V) TYPE(*CHAR) LEN(6) /* Fa 61 +
                          Vorbelegung */
             DCL        VAR(&RG) TYPE(*CHAR) LEN(2)
             DCL        VAR(&LOKATION) TYPE(*CHAR) LEN(3)
             DCL        VAR(&FIRMA) TYPE(*CHAR) LEN(2) VALUE('  ')

             CHGJOB     LOG(4 00 *SECLVL) LOGCLPGM(*YES) +
                          LOGOUTPUT(*JOBEND)

             ADDLIBLE   LIB(TVRELWAECO) POSITION(*LAST)
             MONMSG     MSGID(CPF0000)

             RTVJOBA    DATE(&DATUMC)
             CHGVAR     VAR(&DATUMS) VALUE(&DATUMC)

/*___   ermitteln firma ____________________________________________________ */
             CALL       PGM(TVRELWAECO/DOWR000) PARM(&LOKATION &FIRMA)

/*___   standardzeiten für faktura vorbelegen aus dtaara bar_vert/tagesrg___ */
             RTVDTAARA  DTAARA(BAR_VERT/TAGESRG (401 6)) +
                          RTNVAR(&TIME61V)

/*___auslesen datei kalender _________________________________________________*/
 LOOP:       RCVF       OPNID(A)
             MONMSG     MSGID(CPF0864) EXEC(GOTO CMDLBL(WEITER))
             IF         COND(&DATUMS *EQ &A_KALDAT2 *AND &A_KALFIRM +
                          *EQ &FIRMA) THEN(CHGVAR VAR(&RG) +
                          VALUE(&A_KALRGPARA))
             IF         COND(&DATUMS *EQ &A_KALDAT2 *AND &A_KALFIRM +
                          *EQ &FIRMA) THEN(CHGVAR VAR(&TIME61) +
                          VALUE(&A_KALRGZEIT))
             GOTO       CMDLBL(LOOP)
/*____________________________________________________________________________*/

/*___   zeiten für faktura vorbelegen, falls in der datei leer _____________ */
/*___   vorbelegung aus dtaara bar_vert/tagesrg ____________________________ */
 WEITER:     IF         COND(&TIME61 *EQ '      ') THEN(CHGVAR +
                          VAR(&TIME61) VALUE(&TIME61V))
/*____________________________________________________________________________*/

             IF         COND(&RG *EQ 'WO' *OR &RG *EQ 'WM' *OR &RG +
                          *EQ 'M ') THEN(DO)

 LOOP2:      RTVSYSVAL  SYSVAL(QTIME) RTNVAR(&QTIME)
             IF         COND(&QTIME *GE &TIME61) THEN(GOTO +
                          CMDLBL(RGLAUF))
             DLYJOB     DLY(300)
             GOTO       CMDLBL(LOOP2)

/*_durchführen wochenrechnungslauf____________________________________________*/
 RGLAUF:     IF         COND(&RG *EQ 'WO' *OR &RG *EQ 'WM') THEN(DO)
             SBMJOB     CMD(CALL PGM(TVPP/TRAB53SJ) PARM('MODWAO' +
                          '61' '1' ' ' ' ' '001')) JOB(FAKTURA61W) +
                          JOBD(MODWAO/JDFIB61) USER(FAKTURA61) /* +
                          'Wo-Sammelrechnungen Kz.1 +
                          erstellen/drucken' */
             ENDDO
/*____________________________________________________________________________*/

             DLYJOB     DLY(180)

/*_durchführen monatsendrechnungen____________________________________________*/
             IF         COND(&RG *EQ 'WM' *OR &RG *EQ 'M ') THEN(DO)
             SBMJOB     CMD(CALL PGM(TVPP/TRAB53SJ) PARM('MODWAO' +
                          '61' '9')) JOB(FAKTURA61M) +
                          JOBD(MODWAO/JDFIB61) USER(FAKTURA61) +
                          /*'Mo-Sammelrechnungen Kz.9 +
                          erstellen/drucken' */
             ENDDO
/*____________________________________________________________________________*/

             ENDDO


             ENDPGM
