/*    * PROGRAMMNAME.:$FAKTU55_W                                             */
/*    * FUNKTION.....:...                                                    */
/*    * 31.08.11       schneider                                              */
/*    *                                                                       */
/*    *-start Wochenrechung über kalenderdatei                               */
/*    *-parameter: WO = Wochenrechnung                                       */
/*    *            WM = Wochenrechnung+Monatsrechnung                        */
/*    *            M  = Monatsrechnung                                       */
/*    *                                                                      */
/*    * Hinweis:                                                             */
/*    * sind in der kalenderdatei (bar_vert/kalendern) keine einträge        */
/*    * in den zeiten vorhanden, wird die jeweilige standardzeit             */
/*    * vorbelegt.                                                           */
/*    * in diesem fall 12:00 uhr für wochenrechnungen                        */
/*    * bei änderungen der standardzeiten diese im programm ändern!!         */
/*    * dieses programm wird über scde derzeit um 11:45h im sbs qsyswrk      */
/*    * täglich gestartet. ($FAKTU55_W)                                      */
/*    *                                                                       */
/******************************************************************************/
             PGM

             DCLF       FILE(BAR_VERT/KALENDERN) OPNID(A)
             DCL        VAR(&DATUMC) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DATUMS) TYPE(*DEC) LEN(6 0)
             DCL        VAR(&QTIME) TYPE(*CHAR) LEN(6)
             DCL        VAR(&TIME55) TYPE(*CHAR) LEN(6) /* Fa 55 */
             DCL        VAR(&TIME55V) TYPE(*CHAR) LEN(6) /* Fa 55 +
                          Vorbelegung */
             DCL        VAR(&RG) TYPE(*CHAR) LEN(2)

             CHGJOB     LOG(4 00 *SECLVL) LOGCLPGM(*YES) +
                          LOGOUTPUT(*JOBEND)

             RTVJOBA    DATE(&DATUMC)
             CHGVAR     VAR(&DATUMS) VALUE(&DATUMC)

/*___   standardzeiten für faktura vorbelegen aus dtaara bar_vert/tagesrg___ */
             RTVDTAARA  DTAARA(BAR_VERT/TAGESRG (401 6)) +
                          RTNVAR(&TIME55V)

/*___auslesen datei kalender _________________________________________________*/
 LOOP:       RCVF       OPNID(A)
             MONMSG     MSGID(CPF0864) EXEC(GOTO CMDLBL(WEITER))
             IF         COND(&DATUMS *EQ &A_KALDAT2 *AND &A_KALFIRM +
                          *EQ '55') THEN(CHGVAR VAR(&RG) +
                          VALUE(&A_KALRGPARA))
             IF         COND(&DATUMS *EQ &A_KALDAT2 *AND &A_KALFIRM +
                          *EQ '55') THEN(CHGVAR VAR(&TIME55) +
                          VALUE(&A_KALRGZEIT))
             GOTO       CMDLBL(LOOP)
/*____________________________________________________________________________*/

/*___   zeiten für faktura vorbelegen, falls in der datei leer _____________ */
/*___   vorbelegung aus dtaara bar_vert/tagesrg ____________________________ */
 WEITER:     IF         COND(&TIME55 *EQ '      ') THEN(CHGVAR +
                          VAR(&TIME55) VALUE(&TIME55V))
/*____________________________________________________________________________*/

             IF         COND(&RG *EQ 'WO' *OR &RG *EQ 'WM' *OR &RG +
                          *EQ 'M ') THEN(DO)

 LOOP2:      RTVSYSVAL  SYSVAL(QTIME) RTNVAR(&QTIME)
             IF         COND(&QTIME *GE &TIME55) THEN(GOTO +
                          CMDLBL(RGLAUF))
             DLYJOB     DLY(300)
             GOTO       CMDLBL(LOOP2)

/*_durchführen wochenrechnungslauf____________________________________________*/
 RGLAUF:     IF         COND(&RG *EQ 'WO' *OR &RG *EQ 'WM') THEN(DO)
             SBMJOB     CMD(CALL PGM(TVPP/TRAB53SJ) PARM('MODWAO' +
                          '55' '1')) JOB(FAKTURA55W) +
                          JOBD(MODWAO/JDFIB01) USER(FAKTURA55) /* +
                          'Wo-Sammelrechnungen Kz.1 +
                          erstellen/drucken' */
             ENDDO
/*____________________________________________________________________________*/

             DLYJOB     DLY(180)

/*_durchführen monatsendrechnungen____________________________________________*/
             IF         COND(&RG *EQ 'WM' *OR &RG *EQ 'M ') THEN(DO)
             SBMJOB     CMD(CALL PGM(TVPP/TRAB53SJ) PARM('MODWAO' +
                          '55' '9')) JOB(FAKTURA55M) +
                          JOBD(MODWAO/JDFIB01) USER(FAKTURA55) +
                          /*'Mo-Sammelrechnungen Kz.9 +
                          erstellen/drucken' */
             ENDDO
/*____________________________________________________________________________*/

             ENDDO


             ENDPGM
