/*    * PROGRAMMNAME.:$FAKTU55_T                                             */
/*    * FUNKTION.....:...                                                    */
/*    * 27.09.12       schneider                                              */
/*    *                                                                       */
/*    * Änderung:                                                             */
/*    *                                                                       */
/*    *                                                                       */
/*    *-start tagesrechnung über kalenderdatei                               */
/*    *-parameter: &JOBQ = J=steurung jobq , N=keine steuerung jobq          */
/*    *                                                                      */
/*    * Hinweis:                                                             */
/*    * sind in der kalenderdatei (bar_vert/kalendern) keine einträge        */
/*    * in den zeiten vorhanden, wird die jeweilige standardzeit             */
/*    * aus dtaara bar_vert/tagesrg vorbelegt                                */
/*    *                                                                      */
/*    * bei änderungen der standardzeiten,diese in dtaara                    */
/*    * bar_vert/tagesrg ändern!                                             */
/*    * !!!!!!!!!!!!!!!!                                                     */
/*    * prüfen mit programmen von hr. gang (ablaufsteuerung)                 */
/*    * bei änderung der zeiten für export                                   */
/*    * !!!!!!!!!!!!!!!!                                                     */
/*    * dieses programm wird über scde derzeit um 17:30h im sbs qsyswrk      */
/*    * täglich gestartet ($FAKTU55_T) mit parameter &JOBQ                   */
/*    *                                                                       */
/******************************************************************************/
             PGM        PARM(&JOBQ)

             DCLF       FILE(BAR_VERT/KALENDERN) OPNID(A)
             DCL        VAR(&FIRMA) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DATUMC) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DATUMS) TYPE(*DEC) LEN(6 0)
             DCL        VAR(&QTIME) TYPE(*CHAR) LEN(6)
             DCL        VAR(&TIME55) TYPE(*CHAR) LEN(6) /* Fa 55 */
             DCL        VAR(&TIME55V) TYPE(*CHAR) LEN(6) /* Fa 55 +
                          Vorbelegung */
             DCL        VAR(&TAG) TYPE(*CHAR) LEN(4)
             DCL        VAR(&JOBQ) TYPE(*CHAR) LEN(1)

             CHGJOB     LOG(4 00 *SECLVL) LOGCLPGM(*YES) +
                          LOGOUTPUT(*JOBEND)

             RTVJOBA    DATE(&DATUMC) DAYOFWEEK(&TAG)
             CHGVAR     VAR(&DATUMS) VALUE(&DATUMC)

/*___   standardzeiten für faktura vorbelegen aus dtaara bar_vert/tagesrg___ */
             RTVDTAARA  DTAARA(BAR_VERT/TAGESRG (401 6)) +
                          RTNVAR(&TIME52V)

/*___nicht an samstagen und sonntagen ________________________________________*/
             IF         COND(&TAG *NE '*SAT' *OR &TAG *NE '*SUN') +
                          THEN(DO)

/*___auslesen datei kalender _________________________________________________*/
 LOOP:       RCVF       OPNID(A)
             MONMSG     MSGID(CPF0864) EXEC(GOTO CMDLBL(WEITER))
             IF         COND(&DATUMS *EQ &A_KALDAT2 *AND &A_KALFIRM +
                          *EQ '55') THEN(CHGVAR VAR(&TIME55) +
                          VALUE(&A_KALRGZEITI))
             GOTO       CMDLBL(LOOP)
/*____________________________________________________________________________*/

/*___   zeiten für faktura vorbelegen, falls in der datei leer _____________ */
/*___   vorbelegung aus dtaara bar_vert/tagesrg ____________________________ */
 WEITER:     IF         COND(&TIME55 *EQ '      ') THEN(CHGVAR +
                          VAR(&TIME55) VALUE(&TIME55V))
/*____________________________________________________________________________*/


/*___   durchführen rechnungslauf Fa. 52 ___________________________________ */

 LOOP55:     RTVSYSVAL  SYSVAL(QTIME) RTNVAR(&QTIME)
             IF         COND(&QTIME *GE &TIME55) THEN(GOTO +
                          CMDLBL(RGLAUF55))
             DLYJOB     DLY(300)
             GOTO       CMDLBL(LOOP55)
/*____________________________________________________________________________*/

/*___   steuerung jobq für druckaufträge JQPRTSVR01 ________________________ */
 RGLAUF55:   IF         COND(&JOBQ = 'J') THEN(DO)
             SBMJOB     CMD(CALL PGM(TVRELWAECO/#RLSJOBQ)) +
                          JOB(JBQSTEUERG) JOBQ(QSYS/QSYSNOMAX)
             ENDDO
/*____________________________________________________________________________*/

             SBMJOB     CMD(CALL PGM(MODWAO/TRAB50SJ) PARM('MODWAO' +
                          '55' '   ' '   ' '   ')) JOB(FAKTURA55E) +
                          JOBD(MODWAO/JDFIB01) USER(FAKTURA55) +
                          LOGCLPGM(*YES) /* 'tägliche Rg Einzel Fa. +
                          55            */
/*____________________________________________________________________________*/

             DLYJOB     DLY(180)

             SBMJOB     CMD(CALL PGM(MODWAO/TRAB53SJ) PARM('MODWAO' +
                          '55' '2' '   ' '   ')) JOB(FAKTURA55S) +
                          JOBD(MODWAO/JDFIB01) USER(FAKTURA55) +
                          LOGCLPGM(*YES) /* 'tägliche Rg Sammel Fa. +
                          55            */
/*____________________________________________________________________________*/

             ENDDO

             ENDPGM
