/*       PROGRAMMNAME:  datumcl                                      */
/*       VERFASSER   :  Schneider    STAND:18.09.2012                */
/*       BESCHREIBUNG:  aufruf mit datum für neuen eintrag in        */
/*                      datei bar_vert/kalender                      */
/*                      format für parameteringabe: ttmmjj (alpha)   */
/*                                                                   */
/*                                                                   */
/*********************************************************************/
             PGM        PARM(&PARA)

             DCL        VAR(&PARA) TYPE(*CHAR) LEN(6)


/* ----programmaufruf --------------------------------------------------------*/

             ADDLIBLE   LIB(BAR_VERT) POSITION(*LAST)
             MONMSG     MSGID(CPF0000)

             CALL       PGM(datum) PARM(&para)


             ENDPGM
