     A*****************************************************************
     A*FIRMA UND TIMESTAMP *******************************************
     A*****************************************************************
     A*
     A          R AFSP1                     PFILE(AFSP)
     A*
     A          K ASFIRM
     A          K ASJAHR
     A          K ASNUMM
     A          O ASJAHR                    CMP(LT 2014)
     A          S ASKART                    CMP(EQ 'KMNR')
