      * Physische Datei: AFLP
      * ANLEGEDATUM: OKTOBER 2010
      *SORT:        ...
      * ÄNDERUNGEN:
      * AUSSCHLUSS:  ...
     A
     A**********                            UNIQUE
     A          R AFUL1                     PFILE(AFUL)
     A
     A          K ULFIRM
     A          K ULLIJJ
     A          K ULLINR
     A          K ULLIPO
     A          K ULUPOS
