     A*****************************************************************
     A*FIRMA UND TIMESTAMP *******************************************
     A*****************************************************************
     A*
     A          R AFSP1                     PFILE(BEAL)
     A*
     A          K ASFIRM
     A          K ASJAHR
     A          K ASNUMM
     A          O ASJAHR                    CMP(LT 2026)
