     A          R #DC0000
      * :STOCK
     A            TETENR        15A
     A            A              1A
     A            BESTAND       11P 4
