     A          R #EXTRAR
      * :ÜBER TEST EINSPIELEN
     A            AMAFJJ        04S 0
     A            AMAFNR         6A
     A          K AMAFJJ
     A          K AMAFNR
