      * Physische Datei: KOND
      * ANLEGEDATUM: OKTOBER 2010
      *SORT:        ...
      * ÄNDERUNGEN:
      * AUSSCHLUSS:  ...
     A
     A*                                     UNIQUE
     A          R KOND1                     PFILE(KOND)
     A
     A                                      TEXT('KONDITIONEN')
     A          K KOFIRM
     A          K KOBEGR
     A          K KOKDLG
     A          K KOTENR
     A          K KOWACD
     A          K KOGADA                    DESCEND
