     A*****************************************************************
     A*FIRMA UND TIMESTAMP *******************************************
     A*****************************************************************
     A*
     A          R LBPC1                     PFILE(LBPC)
     A*
     A          K LBPCFIRM
     A          K LBPCJAHR
     A          K LBPCNMKR
     A          O LBPCJAHR                  CMP(LT 2022)
