     A          R #PHPUSER2
     A
     A            ID             3A
     A            USER#         30A
     A            PASSWORT      30A
     A            NAME          30A
     A            VORNAME       30A
     A            VON           30A
     A            BIS           30A
     A            DOCCUR         7A
