      * Physische Datei: PREI
      * ANLEGEDATUM: 01/2014
      *SORT:        ...
      * ÄNDERUNGEN:
      * AUSSCHLUSS:  ...
     A
     A*                                     UNIQUE
     A          R PREI1                     PFILE(PREI)
     A
     A                                      TEXT('PREISDATEI')
     A          K PRFIRM
     A          K PRBEGR
     A          K PRKDLG
     A          K PRWACD
     A          K PRTENR
     A          K PRGADA                    DESCEND
