     A                                      UNIQUE
     A          R PRGRF                     TEXT('VORBELEGUNG')
     A*****************************************************************
     A            PRPRGR         4A         COLHDG('PRODUKTGRUPPE')
     A*****************************************************************
     A
     A          K PRPRGR
