     A          R #RAB000INR
      * :STOCK
     A            KOFIRM         2A
     A            KOKDLI        10A
     A            KOKOND        10A
     A            KOBEGR         3A
     A            KORABA         9S 2
     A            KOGADA         8S 0
     A            KOPRGR         4A
     A            KOKDLG         4A
     A            KOMG01        11S 2
     A            KORB01         9S 2
     A            KOMG02        11S 2
     A            KORB02         9S 2
     A            KOMG03        11S 2
     A            KORB03         9S 2
