     A          R ABESTANDR
     A
     A            TETENR        15A
     A            LAGER          3A
     A            BESTAND       10S 4
     A            RESERV        10S 4
     A            DVERB         10S 4
     A          K TETENR
     A          K LAGER
