     A          R ARTDATENR
     A
     A            #1A           15A
     A            #1            12S 5
     A            #2            12S 5
     A            #3            12S 5
     A            #4            12S 5
     A            #5            12S 5
     A            #6            12S 5
     A            #7            12S 5
     A            #8            12S 5
     A            #9            12S 5
     A            #10           12S 5
     A            $F1           20A
     A            $F2           20A
     A            $F3           20A
     A            $F4           20A
     A            $F5           20A
     A            $F6           20A
     A            $F7           20A
     A            $F8           20A
     A            $F9           20A
     A            $F10          20A
     A            $F11          20A
     A            $F12          20A
     A            $F13          20A
     A            $F14          20A
     A            $F15          20A
     A            $F16          20A
     A            $F17          20A
     A            $I1            1A
     A            $I2            1A
     A            $I3            1A
     A            F1#           20A
     A            #TEEWTENR     15A
     A          K #1A
