     A*****************************************************************
     A          R AVAILABLE                 TEXT('AVAILABLE')
     A            APAFJJ         4S 0       COLHDG('KD-AF-JAHR       ')
     A            APAFNR         6A         COLHDG('KD-AUFTRAGS-NR   ')
     A            APAFPO         4S 0       COLHDG('KD-AF-POSITION   ')
     A            AKKOSP         1A         COLHDG('KOM. SPERREN     ')
     A            APTENR        15A         COLHDG('IDENT-NR         ')
     A            APTBZ1        30A         COLHDG('DESCRIPTION      ')
     A            APKMTE         8S 0       COLHDG('KOM-TERMIN       ')
     A            APLFTE         8S 0       COLHDG('LIEFER-TERMIN    ')
     A            APRSDA         8S 0       COLHDG('RESERV-DATUM     ')
     A            APBSMG        11S 2       COLHDG('BESTELL-MENGE    ')
     A            AKEIDA         8S 0       COLHDG('EINGANGS-DATUM   ')
     A            AKEIUZ         6S 0       COLHDG('EINGANGS-ZEIT    ')
     A            AKAFAT         3A         COLHDG('KD-AF-ART        ')
     A            AVAILABLE      8P 0       COLHDG('AVAILABLE        ')
     A            LFSINPUT       8P 0       COLHDG('LFSINPUT         ')
     A            LFR            3P 0       COLHDG('LFR              ')
     A            UFR           11P 2       COLHDG('UFR              ')
     A            OFR            3P 0       COLHDG('OFR              ')
     A            LFRPR          3P 0       COLHDG('LFRPR            ')
     A            UFRPR          3P 0       COLHDG('UFRPR            ')
     A            OFRPR          3P 0       COLHDG('OFRPR            ')
     A            LFRPR_         3P 0       COLHDG('LFRPR_WERT       ')
     A            UFRPR_         3P 0       COLHDG('UFRPR_WERT       ')
     A            OFRPR_         3P 0       COLHDG('OFRPR_WERT       ')
     A            WEEK#          2P 0       COLHDG('WEEK#            ')
     A            LFRPRWEEK      3P 0       COLHDG('LFRPRWEEK        ')
     A            UFRPRWEEK      3P 0       COLHDG('UFRPRWEEK        ')
     A            OFRPRWEEK      3P 0       COLHDG('OFRPRWEEK        ')
     A            LFRPRWEEK_     3P 0       COLHDG('LFRPRWEEK_       ')
     A            UFRPRWEEK_     3P 0       COLHDG('UFRPRWEEK_       ')
     A            OFRPRWEEK_     3P 0       COLHDG('OFRPRWEEK_       ')
     A            MONTH#         2P 0       COLHDG('MONTH#           ')
     A            LFRPRMONTH     3P 0       COLHDG('LFRPRMONTH       ')
     A            UFRPRMONTH     3P 0       COLHDG('UFRPRMONTH       ')
     A            OFRPRMONTH     3P 0       COLHDG('OFRPRMONTH       ')
     A            LFRPRMONT_     3P 0       COLHDG('LFRPRMONTH_      ')
     A            UFRPRMONT_     3P 0       COLHDG('UFRPRMONTH_      ')
     A            OFRPRMONT_     3P 0       COLHDG('OFRPRMONTH_      ')
     A            APKURS        11S 6       COLHDG('KURS             ')
     A            APNESU        11S 2       COLHDG('NETTO-SUMME      ')
     A            APNESUEUR     13S 2       COLHDG('UMGERECHNET EUR  ')
     A            OFR_VALUE     13S 2       COLHDG('GELIEFERT WERT   ')
     A            AKKDNR        10A         COLHDG('KUNDE            ')
     A            AKKDNRDES     30A         COLHDG('BESCHREIB        ')
     A            LIEFER        10A         COLHDG('LIEFERANT        ')
     A            LIEFERDES     30A         COLHDG('BESCHREIB LIEFER ')
     A            DISPO         10A         COLHDG('DISPONENT        ')
     A            EINK          10A         COLHDG('EINKÄUFER        ')
     A            DIVISION      10A         COLHDG('DIVISION         ')
     A            DATEINP        8S 0       COLHDG('LFS INPUT DATE   ')
     A            TIMEINP        6S 0       COLHDG('LFS INPUT TIME   ')
     A            DATEOUT        8S 0       COLHDG('LFS OUTPUT DATE  ')
     A            TIMEOUT        6S 0       COLHDG('LFS OUTPUT TIME  ')
     A            STATUS         2A         COLHDG('STATUS           ')
     A            BYTEON         1A         COLHDG('BYTE ON          ')
     A            TSTAMP          Z         COLHDG('                 ')
     A            #TEPRGR        4A         COLHDG('#TEPRGR          ')
     A            OUT_DATE       8P 0       COLHDG('OUT_DATE         ')
     A            OUT_TIME       6P 0       COLHDG('OUT_TIME         ')
     A            PKAVS          7S 0       COLHDG('PKAVS            ')
     A*****************************************************************
