     A*****************************************************************
     A          R BACKORDERS                TEXT('BACKORDERS')
     A            FKT            1A         COLHDG('FKT              ')
     A            ITEM          15A         COLHDG('ITEM             ')
     A            ITEMNAME      40A         COLHDG('ITEMNAME         ')
     A            CUSTOMER#     10A         COLHDG('CUSTOMER#        ')
     A            CUSTOMER      40A         COLHDG('CUSTOMER         ')
     A            DIVISION      10A         COLHDG('DIVISION         ')
     A            BACKCURV      12S 2       COLHDG('BACKCURV         ')
     A            BACKCURP      12S 0       COLHDG('BACKCURP         ')
     A            MAXSTOCK      12S 2       COLHDG('MAXSTOCK         ')
     A            ROOTCAUSE     60A         COLHDG('ROOTCAUSE        ')
     A            LIEFERANT     10A         COLHDG('LIEFERANT        ')
     A            SUPNAME       40A         COLHDG('SUPNAME          ')
     A            FORECAST      12S 0       COLHDG('FORECAST         ')
     A            ONSTOCK       12S 2       COLHDG('ONSTOCK          ')
     A            ARRIVALW1     10P 0       COLHDG('ARRIVALW1        ')
     A            ARRIVALW2     10P 0       COLHDG('ARRIVALW2        ')
     A            ARRIVALW3     10P 0       COLHDG('ARRIVALW3        ')
     A            ARRIVALW4     10P 0       COLHDG('ARRIVALW4        ')
     A            ARRIVALW5     10P 0       COLHDG('ARRIVALW5        ')
     A            ARRIVALW6     10P 0       COLHDG('ARRIVALW6        ')
     A            DISPONENT      5A         COLHDG('DISPONENT        ')
     A            EINK           5A         COLHDG('EINKÄUFER        ')
     A            SAFETY        12S 2       COLHDG('SAFETY STOCK     ')
     A            LEAD          04S 0       COLHDG('LEAD             ')
     A            INFO          60A         COLHDG('INFO             ')
     A            TSTAMP          Z         COLHDG('TSTAMP           ')
     A            RRN#          10P 0       COLHDG('RRN#             ')
     A*****************************************************************
