     A*
     A*         DATUM IMMER TT.MM.JJJJ
     A*         ZEIT  IMMER HH:MM
     A*         SELECT * FROM FOPPK WHERE SUBSTR(OPK0_KTO, 1, 1) ='1' AND
     A*         OPK0_OPSTAT <>'7' AND OPK0_FIRMA = '51' AND OPK0_OPART='B'
     A*
     A*
     A          R CRMOUTPUTR                TEXT(' ')
     A*****************************************************************
     A*           ==> CUSTOMER PART                                  ')
     A            ENTITY        10A         COLHDG('COMPANY          ')
     A            KDKDNR#       10A         COLHDG('CUSTOMER#        ')
     A            KDNAM1#       30A         COLHDG('NAME 1           ')
     A            KDNAM2#       30A         COLHDG('NAME 2           ')
     A            KDNAM3#       30A         COLHDG('NAME 3           ')
     A            KDSTRA#       30A         COLHDG('STREET           ')
     A            KDPOLD#        3A         COLHDG('ZIP CODE COUNTRY ')
     A            KDPOLZ#       10A         COLHDG('ZIP-CODE         ')
     A            KDWORT#       30A         COLHDG('COUNTRY          ')
     A            KDPOFA#       10A         COLHDG('POSTBOX          ')
     A            KDKNAM#       30A         COLHDG('SHORT NAME       ')
     A            KDHINW#       30A         COLHDG('NOTIFY           ')
     A            KDLANR#        3A         COLHDG('MAGAZINE#        ')
     A            KDTLNR#       20A         COLHDG('PHONE NUMBER     ')
     A*           ==> PART REPRESENTATIVE                            ')
     A            VZVTN1#       10A         COLHDG('ASSIGNMENT REP 1 ')
     A            VTNAM1#       30A         COLHDG('REP-NAME 1       ')
     A            VZVTN2#       10A         COLHDG('ASSIGNMENT REP 2 ')
     A            VTNAM2#       30A         COLHDG('REP-NAME 2       ')
     A            VZVTN3#       10A         COLHDG('ASSIGNMENT REP 3 ')
     A            VTNAM3#       30A         COLHDG('REP-NAME 3       ')
     A            VZVTN4#       10A         COLHDG('ASSIGNMENT REP 4 ')
     A            VTNAM4#       30A         COLHDG('REP-NAME 4       ')
     A            VZVTN5#       10A         COLHDG('ASSIGNMENT REP 5 ')
     A            VTNAM5#       30A         COLHDG('REP-NAME 5          ')
     A*           ==> PART DELIVERY ADDRESSES
     A            VSNAM1#       30A         COLHDG('NAME DELIVERY       ')
     A            VSNAM2#       30A         COLHDG('NAME DELIVERY       ')
     A            VSNAM3#       30A         COLHDG('NAME DELIVERY       ')
     A            VSSTRA#       30A         COLHDG('STREET REP          ')
     A            VSPOLD#        3A         COLHDG('ZIP CODE COUNTRY    ')
     A            VSPOLZ#       10A         COLHDG('ZIP-CODE            ')
     A            VSWORT#       30A         COLHDG('COUNTRY             ')
     A            VSTLNR#       20A         COLHDG('TELEPHONE#          ')
     A            VSTXNR#       30A         COLHDG('FAX#                ')
     A*           ==> PART CODE DEFINITIONS
     A            KDKDGR#        5A         COLHDG('CUSTOMER GROUP      ')
     A            KDKDGRS       30A         COLHDG('CUSTOMER GROUP DESCR')
     A            KDKSTC#        5A         COLHDG('AERE BRANCHE        ')
     A            KDKSTCS       30A         COLHDG('AERE BRANCHE DESCR. ')
     A            KDVSBD#        5A         COLHDG('TERMS OF SHIPPING   ')
     A            KDVSBDS       30A         COLHDG('DE.TERMS OF SHIPPING')
     A            KDLIBD#        5A         COLHDG('TERMS OF DELIVERY   ')
     A            KDLIBDS       30A         COLHDG('DE.TERMS OF DELIVERY')
     A            KDZABD#        5A         COLHDG('TERMS OF PAYMENT    ')
     A            KDZABDS       30A         COLHDG('DES.TERMS OF PAYMENT')
     A            KDGRON#       20A         COLHDG('WHOLESALERS         ')
     A            KDNIGB#        8A         COLHDG('BRANCHE CODE        ')
     A            KDNIGBDES     30A         COLHDG('BRANCHE DESCRIPTION ')
     A            DIVISION       8A         COLHDG('DIVISION CUSTOMER   ')
     A            DIVISIONS     40A         COLHDG('DIVISION DESCRIPTION')
     A            RPMGROUP      02A         COLHDG('RPM CLASSIFICATION  ')
     A            RPMDESC       30A         COLHDG('RPM DESCRIPTION     ')
     A*           ==> CURRENT SITUATION
     A            TURNOVER      12S02       COLHDG('TURNO. CURRENT YEAR ')
     A            CURRENCY      06A         COLHDG('TURNO.CURRENT YEAR  ')
     A            TURNOVERE     12S02       COLHDG('TURNO.CURRENT YEAR ¤')
     A            CCLINE        12S02       COLHDG('LINE OF CREDIT      ')
     A            OPORDER       12S02       COLHDG('OPEN ORDERS VALUE   ')
     A            RECEIVABLE    12S02       COLHDG('RECEIVABLES         ')
     A            DUEAMOUNT     12S02       COLHDG('DUE                 ')
     A*****************************************************************
     A*           ==> ADDITIONAL CLASSIFICATION
     A            KDKDB1#       01A         COLHDG('FLAG CLASSIFICATION1')
     A            KDBWBEZ1      30A         COLHDG('DESCRIPTION1        ')
     A            KDBWWERT1     11S02       COLHDG('TURNOVER1           ')
     A            KDKDB2#       01A         COLHDG('FLAG CLASSIFICATION2')
     A            KDBWBEZ2      30A         COLHDG('DESCRIPTION2        ')
     A            KDBWWERT2     11S02       COLHDG('TURNOVER2           ')
     A            KDKDB3#       01A         COLHDG('FLAG CLASSIFICATION3')
     A            KDBWBEZ3      30A         COLHDG('DESCRIPTION3        ')
     A            KDBWWERT3     11S02       COLHDG('TURNOVER3           ')
     A************KDLANR***********************************************
     A            #INFO         64A         COLHDG('#INFO    ')
     A*****************************************************************
     A            H1            10A         TEXT('status')
     A            H2              L         TEXT('Date of transmissing')
     A            H3              Z         TEXT('TIMESTAMP')
     A            H5              L         TEXT('Date of UPLOAD      ')
     A            H6              Z         TEXT('TIMESTAMP OF UPLOAD')
     A
