     A*****************************************************************
     A          R CUTOFFOUTR                TEXT('COUTOFFOUT    ')
     A            LND           40A         COLHDG('LAND    ')
     A            LNDKZ          3A         COLHDG('LANDKZ  ')
     A            LNDNR          3A         COLHDG('LANDNUM ')
     A            VSB            3A         COLHDG('VSB     ')
     A            VSBNAME       40A         COLHDG('VSBNAME ')
     A            TOUR           6A         COLHDG('TOUR    ')
     A            CUTOFFT       06A         COLHDG('TIME CUTOFF')
     A            WODAY          1A         COLHDG('WOCHENTAG  ')
     A            ADVICE        06A         COLHDG('TIME ADVICE')
     A            PICKUPT       06A         COLHDG('TIME PICKUP')
     A            WODAYOICK      1A         COLHDG('WOCHENTAG  ')
     A            FORWARDER     40A         COLHDG('FORWARDER  ')
     A            DAYADV         2S         COLHDG('AUSLAGERUNGSTAGE')
     A            SCREEN1        2S         COLHDG('SCREENVERLAUF')
     A            BEREICH       25A         COLHDG('BEREICH    ')
     A            WOKZ           1S         COLHDG('WOCHENENDE')
     A            AKTIVKZ        1A         COLHDG('AKTIV/INAKTIV')
     A            TSTAMP          Z         COLHDG('TIMESTAMP')
