      * :AB 26.01.2011 VERSION 1.2
     A
     A          R EDI_MOBISR
     A            DEALER        14A         COLHDG('DEALER')
     A            ORDERNO       10A         COLHDG('ORDERNO')
     A            LINECOUNT      6A         COLHDG('LINECOUNT')
     A            ORDERDATE      8A         COLHDG('ORDERDATE')
     A            DELIVERYNO    10A         COLHDG('DELIVERYNO')
     A            LINECOUNT2     6A         COLHDG('LINECOUNT')
     A            DELIVERYDA     8A         COLHDG('DELIVERYDATE')
     A            INVOICENO     10A         COLHDG('INVOICENO')
     A            LINECOUNT3     6A         COLHDG('LINECOUNT')
     A            INVOICEDAT    08A         COLHDG('INOVOICEDATE')
     A            PARTSGROUP    20A         COLHDG('PARTSGROUP')
     A            PARTNO        20A         COLHDG('PARTNO')
     A            DESCRIPTIO   100A         COLHDG('DESCRIPTION')
     A            INVOICEQUA     6A         COLHDG('INVOICEQUA')
     A            DEALERNETU    13A         COLHDG('DEALERNETUNIT13.2')
     A            DEALERNETS    19A         COLHDG('DEALERNETS19.2')
     A            CURRENCY       3A         COLHDG('CURRENCY')
     A            MOBISNETU     13A         COLHDG('MOBISNETU13.2')
     A            MOBISNETS     19A         COLHDG('MOBISNETS19.2')
     A            CURRENCY2      3A         COLHDG('CURRENCY')
     A            REMARK        12A         COLHDG('REMARK')
     A            DEBITCREDI     1A         COLHDG('DEBITCREDI')
     A            INVDUEDATE     8A         COLHDG('DUEDATE   ')
     A            FREE          12A         COLHDG('FREE')
     A            PARTSTYP       2A         COLHDG('PARTSTYPE')
     A            VAT            4A         COLHDG('VAT      ')
     A            ORIGINV#      10A         COLHDG('ORIGINV# ')
     A            SUPPLIERC     04A         COLHDG('OUR MOBIS#')
     A            SUPPCOUNT     03A         COLHDG('OUR COUNT CODE')
     A            BILLLOCAT     03A         COLHDG('BILLING LOC.  ')
