      * :AB 26.12.2012 VERSION 2004/07
     A
     A          R FORTRASR
     A            BOARD512     512A         COLHDG('BOARD512 RECORD  ')
     A*           TSTAMP          T
     A
     A*
     A*         K TSTAMP
