     A          R GEWICHT
     A            ARTIKEL       20A         TEXT('CONTENTS')
     A            LAENGE        15S 6       TEXT('CONTENTS')
     A            BREITE        15S 6       TEXT('CONTENTS')
     A            HOEHE         15S 6       TEXT('CONTENTS')
     A            TEILE         15S 6       TEXT('CONTENTS')
     A            VOLUMEN       15S 6       TEXT('CONTENTS')
     A            BRUTTO_KG     15S 6       TEXT('CONTENTS')
     A            PAPPE_GR      15S 6       TEXT('CONTENTS')
     A            KUNST_GR      15S 6       TEXT('CONTENTS')
     A            HOLZ_GR       15S 6       TEXT('CONTENTS')
     A            CONTENTS11    15A         TEXT('CONTENTS')
     A            CONTENTS12    15A         TEXT('CONTENTS')
     A            CONTENTS13    15A         TEXT('CONTENTS')
     A            CONTENTS14    15A         TEXT('CONTENTS')
     A            CONTENTS15    15A         TEXT('CONTENTS')
     A            CONTENTS16    15A         TEXT('CONTENTS')
     A            ARTIKEL#      15A         TEXT('CONTENTS')
     A            PROTOKOLL     15A         TEXT('CONTENTS')
     A            PROTOKOLLA     1A         TEXT('CONTENTS')
     A            PROTOKOLLB     1A         TEXT('CONTENTS')
     A            PROTOKOLLC     1A         TEXT('CONTENTS')
     A            PROTOKOLLD     1A         TEXT('CONTENTS')
     A            PROTOKOLLE     1A         TEXT('CONTENTS')
     A            PROTOKOLLF     1A         TEXT('CONTENTS')
     A            TIME_INPUT      Z         TEXT('TIMESTAMP')
     A            DATE_INPUT      L         TEXT('dispatch date')
     A            TIME_RELEA      Z         TEXT('TIMESTAMP')
     A            DATE_RELEA      L         TEXT('dispatch date')
