     A*
     A*         DATUM IMMER TT.MM.JJJJ
     A*         ZEIT  IMMER HH:MM
     A*           ORDANLORT     = EMSDETTEN
     A          R HDXORDERR                 TEXT('HDXINPUT')
     A*****************************************************************
     A            H050          10A         COLHDG('HDXORDER#')
     A            H030           7S 0       TEXT('KUNDEN##')
     A            H020           7S 0       TEXT('KUNDEN#DELIVERY')
     A            H310A         60A         TEXT('NUMMER WERK')
     A            H310B         60A         TEXT('NUMMER ABLADESTELLE')
     A            H100          30A         TEXT('NAME ABLADESTELLE')
     A            H130          30A         TEXT('STRASSE ABLADESTELLE')
     A            H160          30A         TEXT('ORT ABLADESTELLE   ')
     A            L080          15A         TEXT('ARTIKEL# HDX')
     A            L110          20A         TEXT('ARTIKEL# TREND')
     A            L060            L         TEXT('LIEFERDATUM')
     A            L100           8S 3       TEXT('MENGE')
     A            L080II        15A         TEXT('ARTIKEL# HDX VERP')
     A            L100II         8S 3       TEXT('MENGE VERPACKUNG')
     A            HDXFM          8S 3       TEXT('HDX FÜLLMENGE')
     A            L080III       15A         TEXT('ARTIKEL# LADEM')
     A            L100III        8S 3       TEXT('MENGE LADEMITTEL')
     A            H330I         30A         TEXT('USER')
     A            LIEFER        10A         TEXT('LIEFERBEDINGUNG')
     A            L050           5S 0       TEXT('LINEPOSITION')
     A            ZIPCODE       12A         TEXT('ZIPCODE     ')
     A            H140           3A         TEXT('LÄNDERKZ    ')
     A            WAHRUNG        5A         TEXT('WÄHRUNG FÜR PREIS')
     A            PREIS          8S 3       TEXT('PREIS JE EINHEIT')
     A            EINHEIT        5A         TEXT('EINHEIT     ')
     A            GLN           10A         TEXT('GLN         ')
     A            EINZELLIEF    10A         TEXT('EINZEL-LIEFERSCHE')
     A            LIEFERPOS      5A         TEXT('LIEFERPOSITION   ')
     A            BESTELLPOS    10A         TEXT('BESTELLPOSITION  ')
     A*****************************************************************
     A            H060            L         TEXT('BELEGDATUM')
     A            H360            L         TEXT('Date of transmissing')
     A            H370            Z         TEXT('TIMESTAMP')
     A*           L050          05S 0       COLHDG('LINE#')
