     A*
     A*         DATUM IMMER TT.MM.JJJJ
     A*         ZEIT  IMMER HH:MM
     A*           ORDANLORT     = EMSDETTEN
     A          R FACTORIESR                TEXT('ORDERS')
     A*****************************************************************
     A            INUMBE        15A         COLHDG('INUMBE   ')
     A            PROGRP         3A         COLHDG('PROGRP   ')
     A            COUNTER        5A         COLHDG('COUNTER  ')
     A            IDCO           8A         COLHDG('IDCO     ')
     A*****************************************************************
     A            H1            10A         TEXT('status')
     A            H2              L         TEXT('Date of transmissing')
     A            H3              Z         TEXT('TIMESTAMP')
     A            H4           256A         TEXT('statusII')
     A            H5              L         TEXT('Date of UPLOAD      ')
     A            H6              Z         TEXT('TIMESTAMP OF UPLOAD')
     A
