     A*
     A*CRTSRCPF FILE(TVRELWAECO/IVEAS_I) RCDLEN(2400)
     A*TEXT('DATA STREAM FOR IVEAS 2400 BYTES')
     A*
     A*CPYFRMSTMF FROMSTMF('/IVEAS/478451.BAK')
     A*TOMBR('/QSYS.LIB/TVRELWAECO.LIB/IVEAS_I.FILE/IVEASI.MBR')
     A*MBROPT(*REPLACE)
     A*
     A*SELECT SUBSTR( SRCDTA , 1, 1810) FROM TVRELWAECO/IVEAS_I WHERE
     A*SUBSTR( SRCDTA , 1, 1) = '1'
     A*DATEI IVEAS_I1 IN TVRELWAECO WURDE ERSTELLT.
     A*
     A*CPYF FROMFILE(IVEAS_I1) TOFILE(IVEAS_SA1) MBROPT(*REPLACE) FMTOPT(*NOCHK)
     A*
     A*
     A*
     A          R IMPKS_SAO                 TEXT('IVEAS')
     A********************************************************************
     A            COM           12A         COLHDG('COM         101   12')
     A            REFNO         35A         COLHDG('REFNO       103   13')
     A            POSNO          8S 0       COLHDG('POSNO       100    1')
     A            SATZART        1A         COLHDG('SATZART     102   12')
     A            TYP            1A         COLHDG('TYP         102   12')
     A            DOKUMENTAR     4A         COLHDG('DOKUMENTAR  104   63')
     A            NUMMER        20A         COLHDG('NUMMER      104   63')
     A            DATUM          8A         COLHDG('DATUM       104   63')
     A            VORLAGE        1A         COLHDG('VORLAGE     104   63')
     A            AFA_WERT      12A         COLHDG('AFA_WERT    104   63')
     A            MASSEINHE      3A         COLHDG('MASSEINHE   104   63')
     A            BEANTRAGTE     3A         COLHDG('BEANTRAGTE  104   63')
     A            ANWENDUNG      1A         COLHDG('ANWENDUNG   104   63')
     A            AFAFAKTOR     12A         COLHDG('AFAFAKTOR   104   63')
     A*****************************************************************
     A*
     A*****************************************************************
     A            H1              L         TEXT('Date of transmissing')
     A            H2              Z         TEXT('TIMESTAMP')
     A            MANDANT        3A         COLHDG('MANDANT  ')
     A            KJAHR          4S 0       COLHDG('JAHR     ')
     A            KRL            1A         COLHDG('R=RECHNUNG, L=LIEF.')
     A            KRECHLIEF     10A         COLHDG('RECHNUNG ODER LIEF.')
     A            VERABKZ        1A         COLHDG('VERARBEITUNGSKZ')
     A*****************************************************************
