      * Physische Datei: SCMUPD1
      * ANLEGEDATUM: ____
      *SORT:        ...
      * ÄNDERUNGEN:
      * AUSSCHLUSS:  ...
     A
     A**********                            UNIQUE
     A          R ITEMIMPV1R                PFILE(ITEMIMPV1)
     A
     A          K #SKU
     A          S RELEASE                   COMP(EQ 'J' )
