     A*
     A*         DATUM IMMER TT.MM.JJJJ
     A*         ZEIT  IMMER HH:MM
     A          R ITEMSOEM#                 TEXT('____')
     A*****************************************************************
     A            ITEM          15A         COLHDG('ITEM      ')
     A            CHENG         15A         COLHDG('CHENG     ')
     A            RPMM          15A         COLHDG('RPMM      ')
     A*****************************************************************
     A            H1            10A         TEXT('status')
     A            H2              L         TEXT('Date of transmissing')
     A            H3              Z         TEXT('TIMESTAMP')
     A            H4           256A         TEXT('statusII')
     A            H5              L         TEXT('Date of UPLOAD      ')
     A            H6              Z         TEXT('TIMESTAMP OF UPLOAD')
     A
