     A*
     A*CRTSRCPF FILE(TVRELWAECO/IVEAS_I) RCDLEN(2400)
     A*TEXT('DATA STREAM FOR IVEAS 2400 BYTES')
     A*
     A*CPYFRMSTMF FROMSTMF('/IVEAS/478451.BAK')
     A*TOMBR('/QSYS.LIB/TVRELWAECO.LIB/IVEAS_I.FILE/IVEASI.MBR')
     A*MBROPT(*REPLACE)
     A*TEILDATEI IVEASI ZU DATEI IVEAS_I IN TVRELWAECO HINZUGEFÜGT.
     A*
     A*SELECT SUBSTR( SRCDTA , 1, 1503) FROM TVRELWAECO/IVEAS_I WHERE
     A*SUBSTR( SRCDTA , 1, 1) = '3'
     A*DATEI IVEAS_I3 IN TVRELWAECO WURDE ERSTELLT.
     A*
     A*CPYF FROMFILE(IVEAS_I3) TOFILE(IVEAS_SA3) MBROPT(*REPLACE) FMTOPT(*NOCHK)
     A*
     A*CPYFRMSTMF FROMSTMF('/IVEAS/478451.BAK')
     A*TOMBR('/QSYS.LIB/QTEMP.LIB/IVEAS_I.FILE/IVEAS_I.MBR')
     A*MBROPT(*REPLACE)
     A*
     A*
     A          R IVEAS_SA3                 TEXT('IVEAS')
     A********************************************************************
     A            SAT            1A         COLHDG('SAT        5300    1')
     A            POSNR          4A         COLHDG('POSNR      5301    2')
     A            ARTNO         50A         COLHDG('ARTNO      5302    6')
     A            LBEZ         255A         COLHDG('LBEZ       5303   56')
     A            ZBEZ         255A         COLHDG('ZBEZ       5304  311')
     A            WANR          20A         COLHDG('WANR       5305  566')
     A            PRAEF          1A         COLHDG('PRAEF      5306  586')
     A            KLASS          1A         COLHDG('KLASS      5307  587')
     A            ME            10A         COLHDG('ME         5308  588')
     A            PREIS         14A         COLHDG('PREIS      5309  598')
     A            PE            14A         COLHDG('PE         5310  612')
     A            NETTO         14A         COLHDG('NETTO      5311  626')
     A            BRUTTO        14A         COLHDG('BRUTTO     5312  640')
     A            GE            14A         COLHDG('GE         5313  654')
     A            GESBRUTTO     14A         COLHDG('GESBRUTTO  5314  668')
     A            URSPR         14A         COLHDG('URSPR      5315  682')
     A            PRAEFURSPR     3A         COLHDG('PRAEFURSPR 5316  696')
     A            REGION         3A         COLHDG('REGION     5317  699')
     A            RABATT         2A         COLHDG('RABATT     5318  702')
     A            MENGE         14A         COLHDG('MENGE      5319  704')
     A            VERFAHREN      5A         COLHDG('VERFAHREN  5320  718')
     A            GESCHART       2A         COLHDG('GESCHART   5321  723')
     A            BESME         14A         COLHDG('BESME      5322  725')
     A            KOSTENLOS      1A         COLHDG('KOSTENLOS  5323  739')
     A            AUSFLIST      10A         COLHDG('AUSFLIST   5324  740')
     A            UZ            10A         COLHDG('UZ         5325  750')
     A            GGF           50A         COLHDG('GGF        5326  760')
     A            AUFTNR        50A         COLHDG('AUFTNR     5327  810')
     A            AUFTPOS        4A         COLHDG('AUFTPOS    5328  860')
     A            AUFTDATUM      8A         COLHDG('AUFTDATUM  5329  864')
     A            BESTNR        50A         COLHDG('BESTNR     5330  872')
     A            BESTDATUM      8A         COLHDG('BESTDATUM  5331  922')
     A            LSNR          50A         COLHDG('LSNR       5332  930')
     A            LSDATUM        8A         COLHDG('LSDATUM    5333  980')
     A            FRACHT        14A         COLHDG('FRACHT     5334  988')
     A            SWERT          6A         COLHDG('SWERT      5335 1002')
     A            DOKNR         50A         COLHDG('DOKNR      5336 1008')
     A            ZUSAM         20A         COLHDG('ZUSAM      5337 1058')
     A            DUAL           1A         COLHDG('DUAL       5338 1078')
     A            HEDDANR        6A         COLHDG('HEDDANR    5339 1079')
     A            ERSTATT        1A         COLHDG('ERSTATT    5340 1085')
     A            BEWILL        50A         COLHDG('BEWILL     5341 1086')
     A            VBSTEUER       1A         COLHDG('VBSTEUER   5342 1136')
     A            VERPACKKZ      1A         COLHDG('VERPACKKZ  5343 1137')
     A            LIEFERKZ       1A         COLHDG('LIEFERKZ   5344 1138')
     A            LE            50A         COLHDG('LE         5345 1139')
     A            LEDATUM        8A         COLHDG('LEDATUM    5346 1189')
     A            RABATTCODE     1A         COLHDG('RABATTCODE 5347 1197')
     A            SWERTABS      14A         COLHDG('SWERTABS   5348 1198')
     A            PRODGR        50A         COLHDG('PRODGR     5349 1212')
     A            MOWANR4        4A         COLHDG('MOWANR4    5350 1262')
     A            ZLNR          20A         COLHDG('ZLNR       5351 1266')
     A            ZLORT         20A         COLHDG('ZLORT      5352 1286')
     A            ZLZGREFNO     21A         COLHDG('ZLZGREFNO  5353 1306')
     A            ZLCHARGENO    50A         COLHDG('ZLCHARGENO 5354 1327')
     A            IDENTNO       50A         COLHDG('IDENTNO    5355 1377')
     A            DGGRDFACTO    10A         COLHDG('DGGRDFACTO 5356 1427')
     A            PRODLAND       2A         COLHDG('PRODLAND   5357 1437')
     A            UPOS           1A         COLHDG('UPOS       5358 1439')
     A            EIGENSCHAF    50A         COLHDG('EIGENSCHAF 5359 1440')
     A*           DUMMY           A         COLHDG('EXWPREIS   5360 1490')
     A*           EMS-CODE        A         COLHDG('5398                ')
     A*           EMS-ALKOHOLGEH  A         COLHDG('5399                ')
     A            EXWPREIS      14A         COLHDG('5360                ')
     A*****************************************************************
     A*
     A*****************************************************************
     A            H1              L         TEXT('DATE OF TRANSMISSING')
     A            H2              Z         TEXT('TIMESTAMP')
     A            MANDANT        3A         COLHDG('MANDANT  ')
     A            KJAHR          4S 0       COLHDG('JAHR     ')
     A            KRL            1A         COLHDG('R=RECHNUNG, L=LIEF.')
     A            KRECHLIEF     10A         COLHDG('RECHNUNG ODER LIEF.')
     A            VERABKZ        1A         COLHDG('VERARBEITUNGSKZ')
     A*****************************************************************
