     A*
     A*CRTSRCPF FILE(TVRELWAECO/IVEAS_I) RCDLEN(2400)
     A*TEXT('DATA STREAM FOR IVEAS 2400 BYTES')
     A*
     A*CPYFRMSTMF FROMSTMF('/IVEAS/478451.BAK')
     A*TOMBR('/QSYS.LIB/TVRELWAECO.LIB/IVEAS_I.FILE/IVEASI.MBR')
     A*MBROPT(*REPLACE)
     A*
     A*SELECT SUBSTR( SRCDTA , 1, 1810) FROM TVRELWAECO/IVEAS_I WHERE
     A*SUBSTR( SRCDTA , 1, 1) = '1'
     A*DATEI IVEAS_I1 IN TVRELWAECO WURDE ERSTELLT.
     A*
     A*CPYF FROMFILE(IVEAS_I1) TOFILE(IVEAS_SA1) MBROPT(*REPLACE) FMTOPT(*NOCHK)
     A*
     A*
     A*
     A          R IVEAS_IT1                 TEXT('IVEAS')
     A********************************************************************
     A            SATZART1       1A         COLHDG('SATZART1   5100    1')
     A            MANDT         12A         COLHDG('MANDT      5101    2')
     A            ITEM          50A         COLHDG('ITEM       5102   12')
     A            BESCHREIB1    50A         COLHDG('BESCHREIB1 5103   13')
     A            BESCHREIB2   255A         COLHDG('BESCHREIB2 5104   63')
     A            ZOLLDBESCH   255A         COLHDG('ZOLLDBESCH 5104   63')
     A            EIGENSCH      50A         COLHDG('EIGENSCH   5105   71')
     A            ZOLLTARIF#    20A         COLHDG('ZOLLTARIF# 5105   71')
     A            ZUSATZZT#1     4A         COLHDG('ZUSATZZT#1 5106   74')
     A            ZUSATZZT#2     4A         COLHDG('ZUSATZZT#2 5106   74')
     A            MASSEINH      10A         COLHDG('MASSEINH   5106   74')
     A            UMR_ME        14A         COLHDG('UMR_ME     5106   74')
     A            MASSEINHZ1    10A         COLHDG('MASSEINHZ1 5106   74')
     A            FZMASSME1     14A         COLHDG('FZMASSME1  5107  124')
     A            MASSEINHZ2    10A         COLHDG('MASSEINHZ2 5106   74')
     A            FZMASSME2     14A         COLHDG('FZMASSME2  5107  124')
     A            VERPACKART    50A         COLHDG('VERPACKART 5107  124')
     A            LIEFERERKL    50A         COLHDG('LIEFERERKL 5107  124')
     A            DAT_LLEEND     8A         COLHDG('DAT_LLEEND 5107  124')
     A            SAKZ          50A         COLHDG('SAKZ       5107  124')
     A            PRODGRP       50A         COLHDG('PRODGRP    5107  124')
     A            MATERGRP      20A         COLHDG('MATERGRP   5107  124')
     A            MATERKLAS      1A         COLHDG('MATERKLAS  5107  124')
     A            MWSTZOLL       1A         COLHDG('MWSTZOLL   5107  124')
     A            WAEHRUNG       3A         COLHDG('WAEHRUNG   5107  124')
     A            PREIS         14A         COLHDG('PREIS      5107  124')
     A            PREISEH       14A         COLHDG('PREISEH    5107  124')
     A            EXWPREIS      14A         COLHDG('EXWPREIS   5107  124')
     A            NETTOGEW      14A         COLHDG('NETTOGEW   5107  124')
     A            BRUTTOGEW     14A         COLHDG('BRUTTOGEW  5107  124')
     A            EINHEITGEW    14A         COLHDG('EINHEITGEW 5107  124')
     A            VZTA_ORD#     50A         COLHDG('VZTA-ORD#  5107  124')
     A            VZTA_OFD#     50A         COLHDG('VZTA-OFD#  5107  124')
     A            VZTA_BEMER    50A         COLHDG('VZTA-BEMER 5107  124')
     A            VZTA_ANTRA     8A         COLHDG('VZTA_ANTRA 5107  124')
     A            VZTA_ABLAU     8A         COLHDG('VZTA_ABLAU 5107  124')
     A            VZTA_ERTEI     8A         COLHDG('VZTA_ERTEI 5107  124')
     A            URSPLAND       2A         COLHDG('URSPLAND   5107  124')
     A            URSPREGION     2A         COLHDG('URSPREGION 5107  124')
     A            PRAEFERENZ     1A         COLHDG('PRAEFERENZ 5107  124')
     A            PRAEFULAND     2A         COLHDG('PRAEFULAND 5107  124')
     A            INHCODE1       2A         COLHDG('INHCODE1   5107  124')
     A            INHPGRAD1     14A         COLHDG('INHPGRAD1  5107  124')
     A            INHCODE2       2A         COLHDG('INHCODE2   5107  124')
     A            INHPGRAD2     14A         COLHDG('INHPGRAD2  5107  124')
     A            INHCODE3       2A         COLHDG('INHCODE3   5107  124')
     A            INHPGRAD3     14A         COLHDG('INHPGRAD3  5107  124')
     A            INHCODE4       2A         COLHDG('INHCODE4   5107  124')
     A            INHPGRAD4     14A         COLHDG('INHPGRAD4  5107  124')
     A            IVERBCODE1     4A         COLHDG('VERBCODE1  5107  124')
     A            IVERBMASS1     3A         COLHDG('VERBMASS1  5107  124')
     A            IVERBUMR1     14A         COLHDG('VERBUMR1   5107  124')
     A            IVERBGRAD1    14A         COLHDG('VERBGRAD1  5107  124')
     A            IVERBWERT1    14A         COLHDG('VERBWERT1  5107  124')
     A            IVERBCODE2     4A         COLHDG('VERBCODE2  5107  124')
     A            IVERBMASS2     3A         COLHDG('VERBMASS2  5107  124')
     A            IVERBUMR2     14A         COLHDG('VERBUMR2   5107  124')
     A            IVERBGRAD2    14A         COLHDG('VERBGRAD2  5107  124')
     A            IVERBWERT2    14A         COLHDG('VERBWERT2  5107  124')
     A            IVERBCODE3     4A         COLHDG('VERBCODE3  5107  124')
     A            IVERBMASS3     3A         COLHDG('VERBMASS3  5107  124')
     A            IVERBUMR3     14A         COLHDG('VERBUMR3   5107  124')
     A            IVERBGRAD3    14A         COLHDG('VERBGRAD3  5107  124')
     A            IVERBWERT3    14A         COLHDG('VERBWERT3  5107  124')
     A            TABAKST        5A         COLHDG('TABAKST             ')
     A*****************************************************************
     A*
     A*****************************************************************
     A            H1              L         TEXT('Date of transmissing')
     A            H2              Z         TEXT('TIMESTAMP')
     A            MANDANT        3A         COLHDG('MANDANT  ')
     A            KJAHR          4S 0       COLHDG('JAHR     ')
     A            KRL            1A         COLHDG('R=RECHNUNG, L=LIEF.')
     A            KRECHLIEF     10A         COLHDG('RECHNUNG ODER LIEF.')
     A            VERABKZ        1A         COLHDG('VERARBEITUNGSKZ')
     A*****************************************************************
