     A*
     A*CRTSRCPF FILE(TVRELWAECO/IVEAS_I) RCDLEN(2400)
     A*TEXT('DATA STREAM FOR IVEAS 2400 BYTES')
     A*
     A*CPYFRMSTMF FROMSTMF('/IVEAS/478451.BAK')
     A*TOMBR('/QSYS.LIB/TVRELWAECO.LIB/IVEAS_I.FILE/IVEASI.MBR')
     A*MBROPT(*REPLACE)
     A*
     A*SELECT SUBSTR( SRCDTA , 1, 1810) FROM TVRELWAECO/IVEAS_I WHERE
     A*SUBSTR( SRCDTA , 1, 1) = '1'
     A*DATEI IVEAS_I1 IN TVRELWAECO WURDE ERSTELLT.
     A*
     A*CPYF FROMFILE(IVEAS_I1) TOFILE(IVEAS_SA1) MBROPT(*REPLACE) FMTOPT(*NOCHK)
     A*
     A*
     A*
     A          R IVEAS_TCT                 TEXT('IVEAS')
     A********************************************************************
     A            ITEM          50A         COLHDG('ITEM       5102   12')
     A            DESCR1       255A         COLHDG('BESCHREIB1 5103   13')
     A*****************************************************************
     A*
     A*****************************************************************
