     A*
     A*CRTSRCPF FILE(TVRELWAECO/IVEAS_I) RCDLEN(2400)
     A*TEXT('DATA STREAM FOR IVEAS 2400 BYTES')
     A*
     A*CPYFRMSTMF FROMSTMF('/IVEAS/478451.BAK')
     A*TOMBR('/QSYS.LIB/TVRELWAECO.LIB/IVEAS_I.FILE/IVEASI.MBR')
     A*MBROPT(*REPLACE)
     A*
     A*SELECT SUBSTR( SRCDTA , 1, 1810) FROM TVRELWAECO/IVEAS_I WHERE
     A*SUBSTR( SRCDTA , 1, 1) = '1'
     A*DATEI IVEAS_I1 IN TVRELWAECO WURDE ERSTELLT.
     A*
     A*CPYF FROMFILE(IVEAS_I1) TOFILE(IVEAS_SA1) MBROPT(*REPLACE) FMTOPT(*NOCHK)
     A*
     A*
     A*
     A          R IVEAS_SA1                 TEXT('IVEAS')
     A********************************************************************
     A            SATZART1       1A         COLHDG('SATZART1   5100    1')
     A            MANDT         10A         COLHDG('MANDT      5101    2')
     A            BEREICH        1A         COLHDG('BEREICH    5102   12')
     A            RENR          50A         COLHDG('RENR       5103   13')
     A            DATUM          8A         COLHDG('DATUM      5104   63')
     A            INCOT          3A         COLHDG('INCOT      5105   71')
     A            INCOTXT       50A         COLHDG('INCOTXT    5106   74')
     A            VART          10A         COLHDG('VART       5107  124')
     A            VERFAHREN      5A         COLHDG('VERFAHREN  5108  134')
     A            GESCHART       2A         COLHDG('GESCHART   5109  139')
     A            WHG            3A         COLHDG('WHG        5110  141')
     A            KURS          14A         COLHDG('KURS       5111  144')
     A            RABCODE        1A         COLHDG('RABCODE    5112  158')
     A            RABATT        14A         COLHDG('RABATT     5113  159')
     A            FRACHTNR      50A         COLHDG('FRACHTNR   5114  173')
     A            GUEW           6A         COLHDG('GUEW       5115  223')
     A            KDNR          50A         COLHDG('KDNR       5116  229')
     A            KDNAME1       50A         COLHDG('KDNAME1    5117  279')
     A            KDNAME2       50A         COLHDG('KDNAME2    5118  329')
     A            KDSTR1        50A         COLHDG('KDSTR1     5119  379')
     A            KDSTR2        50A         COLHDG('KDSTR2     5120  429')
     A            KDPLZ         10A         COLHDG('KDPLZ      5121  479')
     A            KDORT1        50A         COLHDG('KDORT1     5122  489')
     A            KDORT2        50A         COLHDG('KDORT2     5123  539')
     A            KDLND          3A         COLHDG('KDLND      5124  589')
     A            STEUER        50A         COLHDG('STEUER     5125  592')
     A            EMPFNR        50A         COLHDG('EMPFNR     5126  642')
     A            EMPFNAME1     50A         COLHDG('EMPFNAME1  5127  692')
     A            EMPFNAME2     50A         COLHDG('EMPFNAME2  5128  742')
     A            EMPFSTR1      50A         COLHDG('EMPFSTR1   5129  792')
     A            EMPFSTR2      50A         COLHDG('EMPFSTR2   5130  842')
     A            EMPFPLZ       10A         COLHDG('EMPFPLZ    5131  892')
     A            EMPFORT1      50A         COLHDG('EMPFORT1   5132  902')
     A            EMPFORT2      50A         COLHDG('EMPFORT2   5133  952')
     A            EMPFLND        3A         COLHDG('EMPFLND    5134 1002')
     A            FRACHT        14A         COLHDG('FRACHT     5135 1005')
     A            GESBRUTTO     14A         COLHDG('GESBRUTTO  5136 1019')
     A            GUEWCODE       1A         COLHDG('GUEWCODE   5137 1033')
     A            SPRACHE        2A         COLHDG('SPRACHE    5138 1034')
     A            ZAHLUNG       50A         COLHDG('ZAHLUNG    5139 1036')
     A            UNVOLLST       1A         COLHDG('UNVOLLST   5140 1086')
     A            NEUTRAL        1A         COLHDG('NEUTRAL    5141 1087')
     A            BEZUG         50A         COLHDG('BEZUG      5142 1088')
     A            MONAT          2A         COLHDG('MONAT      5143 1138')
     A            JAHR           4A         COLHDG('JAHR       5144 1140')
     A            VBSTEUER      50A         COLHDG('VBSTEUER   5145 1144')
     A            SCHIFF        50A         COLHDG('SCHIFF     5146 1194')
     A            CONTR         50A         COLHDG('CONTR      5147 1244')
     A            BENUTZER      50A         COLHDG('BENUTZER   5148 1294')
     A            KDREGION       2A         COLHDG('KDREGION   5149 1344')
     A            EMPFREGION     2A         COLHDG('EMPFREGION 5150 1346')
     A            EMPFTEL       50A         COLHDG('EMPFTEL    5151 1348')
     A            GESNETTO      14A         COLHDG('GESNETTO   5152 1398')
     A            INVTYPE        1A         COLHDG('INVTYPE    5153 1412')
     A            SPEDNR        12A         COLHDG('SPEDNR     5154 1413')
     A            EMPFTIN       17A         COLHDG('EMPFTIN    5155 1425')
     A            VKNATGRZ       2A         COLHDG('VKNATGRZ   5156 1442')
     A            ZOLLSTELLE     8A         COLHDG('ZOLLSTELLE 5157 1444')
     A            KDKONTAKT     50A         COLHDG('KDKONTAKT  5158 1452')
     A            KDTEL         50A         COLHDG('KDTEL      5159 1502')
     A            KDFAX         50A         COLHDG('KDFAX      5160 1552')
     A            KDEMAIL       50A         COLHDG('KDEMAIL    5161 1602')
     A            EMPFKONTAK    50A         COLHDG('EMPFKONTAK 5162 1652')
     A            EMPFFAX       50A         COLHDG('EMPFFAX    5163 1702')
     A            EMPFEMAIL     50A         COLHDG('EMPFEMAIL  5164 1752')
     A            CALCPACKCO     1A         COLHDG('CALCPACKCO 5165 1802')
     A            LIEFERDATU     8A         COLHDG('LIEFERDATU 5166 1803')
     A****        PLATZHALTER    0A         COLHDG('5199                ')
     A*****************************************************************
     A*
     A*****************************************************************
     A            H1              L         TEXT('Date of transmissing')
     A            H2              Z         TEXT('TIMESTAMP')
     A            MANDANT        3A         COLHDG('MANDANT  ')
     A            KJAHR          4S 0       COLHDG('JAHR     ')
     A            KRL            1A         COLHDG('R=RECHNUNG, L=LIEF.')
     A            KRECHLIEF     10A         COLHDG('RECHNUNG ODER LIEF.')
     A            VERABKZ        1A         COLHDG('VERARBEITUNGSKZ')
     A*****************************************************************
