     A*
     A*         DATUM IMMER TT.MM.JJJJ
     A*         ZEIT  IMMER HH:MM
     A*           ORDANLORT     = EMSDETTEN
     A          R SKUTRANSFR                TEXT('SKU#')
     A*****************************************************************
     A            ITEM          15A         COLHDG('ITEM#')
     A            KATALOG       10A         COLHDG('KATALOG')
     A            SKU           15A         COLHDG('SKU#')
     A*****************************************************************
     A            H1            10A         TEXT('status')
     A            H2              L         TEXT('Date of transmissing')
     A            H3              Z         TEXT('TIMESTAMP')
     A            H4           256A         TEXT('statusII')
     A            H5              L         TEXT('Date of UPLOAD      ')
     A            H6              Z         TEXT('TIMESTAMP OF UPLOAD')
     A
