     A*
     A*         DATUM IMMER TT.MM.JJJJ
     A*         ZEIT  IMMER HH:MM
     A          R KHT_PBMR                  TEXT('____')
     A*****************************************************************
     A            ITEM          15A         COLHDG('ITEM    ')
     A            LM             3A         COLHDG('UNITVPE ')
     A            MENGELM       12S 4       COLHDG('QUANTLM ')
     A            LENGTH        12S 4       COLHDG('LENGTH  ')
     A            WIDTH         12S 4       COLHDG('WIDTH   ')
     A            HEIGHT        12S 4       COLHDG('HEIGHT  ')
     A            MENGEST       12S 4       COLHDG('QUANTST ')
     A*****************************************************************
     A            H1            10A         TEXT('status')
     A            H2              L         TEXT('Date of transmissing')
     A            H3              Z         TEXT('TIMESTAMP')
     A            H4           256A         TEXT('statusII')
     A            H5              L         TEXT('Date of UPLOAD      ')
     A            H6              Z         TEXT('TIMESTAMP OF UPLOAD')
     A
