     A*
     A*         DATUM IMMER TT.MM.JJJJ
     A*         ZEIT  IMMER HH:MM
     A          R KHT_PBMR                  TEXT('____')
     A*****************************************************************
     A            ITEM          15A         COLHDG('ITEM    ')
     A            UNITVPE       15A         COLHDG('UNITVPE ')
     A            QUANTVPE      12S 4       COLHDG('QUANTVPE')
     A            LENGTH        12S 4       COLHDG('LENGTH  ')
     A            WIDTH         12S 4       COLHDG('WIDTH   ')
     A            HEIGHT        12S 4       COLHDG('HEIGHT  ')
     A            VOLUME        12S 4       COLHDG('VOLUME  ')
     A            CROSS_W       12S 4       COLHDG('CROSS_W ')
     A            NETT_W        12S 4       COLHDG('NETT_W  ')
     A            EAN           20A         COLHDG('EAN     ')
     A*****************************************************************
     A            H1            10A         TEXT('status')
     A            H2              L         TEXT('Date of transmissing')
     A            H3              Z         TEXT('TIMESTAMP')
     A            H4           256A         TEXT('statusII')
     A            H5              L         TEXT('Date of UPLOAD      ')
     A            H6              Z         TEXT('TIMESTAMP OF UPLOAD')
     A
