     A          R LFS_SEGM
      * :STOCK
     A            LKKONZ         3A         COLHDG('KONZERN')
     A            LKFIRM         3A         COLHDG('FIRMA')
     A            LKORT          3A         COLHDG('LAGER- ORT')
     A            LKBER          2A         COLHDG('LAGER- BER.')
     A            LKGNGE         4S 0       COLHDG('GANG-NR EINLAG.')
     A            LKGANG         4S 0       COLHDG('GANG- NR')
     A            LKREG          4S 0       COLHDG('REGAL')
     A            LKHOR          3S 0       COLHDG('HORIZ.')
     A            LKVER          2S 0       COLHDG('VERT.')
     A            LKANZV         2S 0       COLHDG('ANZAHL VERTIKALE')
     A            LKFACH         2S 0       COLHDG('FACH- GROESSE')
     A            LKRGKY         4S 0       COLHDG('REGAL/GANG KEY')
     A            LKABC          1A         COLHDG('ABC- FACH')
     A            LKLZON         2A         COLHDG('LAGER- ZONE')
     A*
     A            LKSPKZ         1A         COLHDG('PLATZ- SPERR-KZ')
     A            LKFSTA         1A         COLHDG('PLATZ- STATUS')
     A            LKBMST        12A         COLHDG('BELEGUNGS MUSTER')
     A            LKMAKO         3A         COLHDG('MANDANT KONZERN')
     A            LKMAFI         3A         COLHDG('MANDANT FIRMA')
     A            LKIDEN        28A         COLHDG('ARTIKELNUMMER')
     A            LKQKZ          2A         COLHDG('QUALITÄTS-KENNZEICH')
     A            LKQCHR        60A         COLHDG('QUALITÄTS MERKMALE')
     A            LKMLM         11S 3       COLHDG('MENGE JE LADEMITTEL')
     A            LKELM          3A         COLHDG('EINGEL.LM L-PLATZ')
     A            LKASEG         4S 0       COLHDG('GES.ANZ. SEGMENTE')
     A            LKFSEG         4S 0       COLHDG('ANZ.FREIE SEGMENTE')
     A            LKSTH          2S 0       COLHDG('STAPEL- HÖHE')
     A            LKLANZ         3S 0       COLHDG('LEER-PAL- ANZAHL')
     A*
     A            LKMNDF         1S 0       COLHDG('MANUAL DEF.')
     A            COUNTART       4P 0       COLHDG('COUNTART')
     A            FREEPLACE      4P 0       COLHDG('FREIE PLÄTZE')
     A            STATUS         1A         COLHDG('STATUS')
     A            TSTAMP          Z         COLHDG('TIMESTAMP')
     A            LOSTRA         1A         COLHDG('STRATEGISCHE LAGER.')
     A            LOORT          3A         COLHDG('LOORT')
     A            LOKBER         2A         COLHDG('LOKBER')
     A            BMBST1        25A         COLHDG('BESTELL-NR')
     A            BMBSTP         6S 0       COLHDG('BESTELL- POS')
     A            BMLIEF        15A         COLHDG('LIEFERANTEN-NUMMER')
     A            BMWENR        10A         COLHDG('WE-NUMMER')
     A            BMWEPO         6S 0       COLHDG('WE-POS')
     A            BMANR1        25A         COLHDG('AUFTRAGS-NR. KUNDE')
     A*
     A            BMANRP         6S 0       COLHDG('AUFTRAGS-NR.KUND.POS')
     A            BMKDNR        10A         COLHDG('KUNDEN-NR')
     A            BMVMEN        11S 3       COLHDG('VERFÜGBARE MENGE')
     A            BMEGEW        11S 3       COLHDG('EINZEL-GEW IN KG')
     A            BMSGEW        11S 3       COLHDG('SUMME-GEW IN KG')
     A            BMTARA        11S 3       COLHDG('TARA-GEW IN KG')
     A            BMME           3A         COLHDG('MENGEN- EINHEIT')
     A            BMVPE         11S 3       COLHDG('MENGE IN VP-EINHEIT')
     A            BMME1          3A         COLHDG('ME DER VPE')
     A            BMVPE2        11S 3       COLHDG('MENGE IN/UMVERP-EINH')
     A            BMME2          3A         COLHDG('ME DER UVPE')
     A            BMDTZU         8S 0       COLHDG('DATE ZUGANG')
     A            BMTLM          3A         COLHDG('TRÄGER- LADEMITTEL')
     A            BMLM           3A         COLHDG('LADE- MITTEL')
     A*
     A            BMMLM         11S 3       COLHDG('MENGE LADE- MITTEL')
     A*
     A            LIEFAKT        8A         COLHDG('LIEFERANT AKTUELL')
     A            LMAKT          3A         COLHDG('LADEMITTEL AKTUELL')
     A*
