     A          R ORDERH#PF
     A
      * :HeaderInfos
     A            H030           6S 0
     A            ARTIKEL       50A
     A            MENGE         10S 2
     A
