      * Physische Datei: ORDERH
      * ANLEGEDATUM: OKTOBER 2010
      *SORT:        SALESCOMPANY (88505), ORDER IN AXAPTA, PRIORITY
      *SELECT:      STATUS (PRESELECTED)
      * ÄNDERUNGEN:
      * AUSSCHLUSS:  ...
     A
     A*                                     UNIQUE
     A          R ORDERHPF                  PFILE(ORDERH)
     A
     A                                      TEXT('KOPFSÄTZE')
     A          K H030
     A          K H050
