      * Physische Datei: ORDERH
      * ANLEGEDATUM: OKTOBER 2010
      *SORT:        SALESCOMPANY (88505), ORDER IN AXAPTA, PRIORITY
      *SELECT:      STATUS (PRESELECTED)
      * ÄNDERUNGEN:
      * AUSSCHLUSS:  ...
     A
     A*                                     UNIQUE
     A          R ORDERMSGHF                PFILE(ORDERMSGH)
     A
     A                                      TEXT('MSG ADDON')
     A          K H030
     A          K H050
     A          K H370
