     A          R OUT_CHECK
      * :STOCK
     A            AKDTDF         8S 0       COLHDG('DATUM DFÜ-ÜBERN.   ')
     A            AKTIDF         6S 0       COLHDG('UHRZEIT DFÜ-ÜBERN. ')
     A            AKDTE          8S 0       COLHDG('ERL./RÜCKCH. DATUM ')
     A            AKTIE          6S 0       COLHDG('ERL./RÜCKCH. ZEIT  ')
     A            WORKDAYS       8S 0       COLHDG('                   ')
     A            EDATUM          L         COLHDG('                   ')
     A            EWOCHE         4S 0       COLHDG('                   ')
     A            EJAHR          6S 0       COLHDG('                   ')
     A            EWOCHENT       4S 0       COLHDG('                   ')
     A            APDTB          8S 0       COLHDG('BEREITST. DATUM    ')
     A            APTIB          6S 0       COLHDG('BEREITST. ZEIT     ')
     A            DELIVDAYS      8S 0       COLHDG('                   ')
     A            APAPN1         9S 0       COLHDG('AP-NR 1.K-STUFE    ')
     A            APAPP1         6S 0       COLHDG('AP-POS 1.K-STUFE   ')
      * :.....
     A
     A            APAPN2         9S 0       COLHDG('AP-NR 2.K-STUFE    ')
     A            APGKZ          4A         COLHDG('GRUPPIERUNGS- KZ   ')
     A            APTOUR         6A         COLHDG('TOUR               ')
     A            APVART         4A         COLHDG('VERSAND- ART       ')
     A            APSSC          4A         COLHDG('VERSAND- SERVICE-CO')
     A            APLFDN         9S 0       COLHDG('LFD NUMMER         ')
     A            APBSTM        11S 3       COLHDG('BESTELL- MENGE     ')
     A            APAPN          9S 0       COLHDG('ARBEITS- PAKET-NR  ')
     A            APANFM        11S 3       COLHDG('ANFORDERUNGS- MENGE')
     A            APAPPO         6S 0       COLHDG('ARBEITS- PAKET-POS ')
     A            APRESM        11S 3       COLHDG('RESERVIERTE MENGE  ')
     A            APALM         11S 3       COLHDG('BEREITS AUSGEL MENG')
     A            APPM1         11S 3       COLHDG('VERPACKTE MENGE    ')
     A            APKDNR        10A         COLHDG('KUNDEN-NR          ')
      * :.....
     A            APLSNR        16A         COLHDG('LIEFERSCHEIN- NUMM ')
     A            APLSNP         5S 0       COLHDG('LIEFERSCHEIN- POSI ')
     A            APANR1        25A         COLHDG('AUFTRAGS-NR. KUNDE ')
     A            APANRP         6S 0       COLHDG('AUFTRAGS-NR. KUNDE ')
     A            APIDEN        28A         COLHDG('ARTIKELNUMMER      ')
     A            APDTDI         8S 0       COLHDG('DB DATUM WRITE     ')
     A            APTIDI        12S 0       COLHDG('DB ZEIT WRITE      ')
     A            JOINING        5P 0       COLHDG('                   ')
     A            LBAPFIRM       2A         COLHDG('                   ')
     A            LBAPKMJJ       4S 0       COLHDG('                   ')
     A            LBAPKMNR       6A         COLHDG('                   ')
     A            LBAPKMPO       4S 0       COLHDG('                   ')
     A            LBAPAFJJ       4S 0       COLHDG('                   ')
     A            LBAPAFNR       6A         COLHDG('                   ')
      * :.....
     A            LBAPAFPO       4S 0       COLHDG('                   ')
     A            LBAPTENR      15A         COLHDG('                   ')
     A            LBAPBWMG      13P 4       COLHDG('                   ')
     A            LBAPRMMG      13P 4       COLHDG('                   ')
     A            LBAPTMST      26S 0       COLHDG('                   ')
     A            AMKMDA         8S 0       COLHDG('                   ')
     A            AMKDNR        10A         COLHDG('                   ')
     A            AMAFAT         3A         COLHDG('                   ')
     A            AMVSBD         3A         COLHDG('                   ')
     A            AMLFTE         8S 0       COLHDG('                   ')
     A            AMLIBD         3A         COLHDG('                   ')
     A            AMLIAR         1A         COLHDG('                   ')
     A            STATUSLFS      1A         COLHDG('                   ')
     A            STATUSTR       1A         COLHDG('                   ')
      * :.....
     A            AMNAM1        30A         COLHDG('                   ')
     A            AMNAM2        30A         COLHDG('                   ')
     A            AMNAM3        30A         COLHDG('                   ')
     A            AMSTRA        30A         COLHDG('                   ')
     A            AMPOLD         3A         COLHDG('                   ')
     A            AMPOLZ        10A         COLHDG('                   ')
     A            AMWORT        30A         COLHDG('                   ')
     A            AMPOFA        10A         COLHDG('                   ')
     A            AMLAND         3A         COLHDG('                   ')
     A            AMPOLN        10A         COLHDG('                   ')
      * :.....
     A            TSTAMP          Z         COLHDG('                   ')
