     A*
     A          R SCMUPDO                   TEXT('SCMUPDO')
     A*****************************************************************
     A            TEFIRM         2A         COLHDG('MADANT')
     A            TETENR        15A         COLHDG('IDENT-NR')
     A            TETEST         2A         COLHDG('STATUS')
     A            TEBESL         1A         COLHDG('BESCHAFF-CODE')
     A            TESIBE        11S 2       COLHDG('SIBE')
     A            TEABC1         1A         COLHDG('BW-KL. PR. EK')
     A            TESAEK         3A         COLHDG('SACHBEARB. EK')
     A            TEDIEK         3A         COLHDG('DISPONENT EK')
     A            TELVZ1         3S 0       COLHDG('VORLAUF-ZT.EK')
     A            TEZOTN        15A         COLHDG('ZOLLTARIF-NR')
     A            LFVSTA         3S 0       COLHDG('VERSCHIFFTAGE LIEF')
     A            LPMIBM        11S 2       COLHDG('BE-MENGE MIN LPIF')
     A            TEABC4         1A         COLHDG('ABC-KENNUNG')
     A            TEEANR        13A         COLHDG('EAN-NR')
     A            TEPRGR         4A         COLHDG('PRODUKT-GRUPPE')
     A            TEEWPRGR       4A         COLHDG('PRGR-DOMETIC')
     A            TEEWTART       3A         COLHDG('ARTIKEL-ART')
     A            TEABC2         1A         COLHDG('FREQUENCY CODE ITEM')
     A*****************************************************************
     A            H1              L         TEXT('Date of transmissing')
     A            H2              Z         TEXT('TIMESTAMP')
     A*****************************************************************
     A            STATE          1A         COLHDG('1*DONE 0=NOT')
     A            TEFIRM_        2A         COLHDG('MADANT')
     A            TETENR_       15A         COLHDG('IDENT-NR')
     A            TETEST_        2A         COLHDG('STATUS')
     A            TEBESL_        1A         COLHDG('BESCHAFF-CODE')
     A            TESIBE_       11S 2       COLHDG('SIBE')
     A            TEABC1_        1A         COLHDG('BW-KL. PR. EK')
     A            TESAEK_        3A         COLHDG('SACHBEARB. EK')
     A            TEDIEK_        3A         COLHDG('DISPONENT EK')
     A            TELVZ1_        3S 0       COLHDG('VORLAUF-ZT.EK')
     A            TEZOTN_       15A         COLHDG('ZOLLTARIF-NR')
     A            LFVSTA_        3S 0       COLHDG('VERSCHIFFTAGE LIEF')
     A            LPMIBM_       11S 2       COLHDG('BE-MENGE MIN LPIF')
     A            TEMIBM_       11S 2       COLHDG('BE-MENGE MIN TEIL')
     A            TEABC4_        1A         COLHDG('ABC-KENNUNG')
     A            TEEANR_       13A         COLHDG('EAN-NR')
     A            TEPRGR_        4A         COLHDG('PRODUKT-GRUPPE')
     A            TEEWPRGR_      4A         COLHDG('PRGR-DOMETIC')
     A            TEEWTART_      3A         COLHDG('ARTIKEL-ART')
     A            TEABC2_        1A         COLHDG('FREQUENCY CODE ITEM')
