     A*CRTSRCPF FILE(TVRELWAECO/SKUAEREAI) RCDLEN(350) TEXT('IMPORTING SKUAEREA DATA')
     A*CPYFRMSTMF FROMSTMF('/LAGER/SCM/SKUAEREA.CSV')
     A*TOMBR('/QSYS.LIB/TVRELWAECO.LIB/SKUAEREAI.FILE/SKUAEREAI.MBR')
     A*MBROPT(*REPLACE)
     A*
     A*CPYFRMIMPF FROMFILE(TVRELWAECO/SKUAEREAI)
     A*       TOFILE(TVRELWAECO/SKUAEREA) MBROPT(*REPLACE)
     A*              FLDDLM(';') DECPNT(*COMMA)
     A*                     FROMRCD(1) RPLNULLVAL(*FLDDFT)
     A*
     A*UPDATE        SKUAEREA SET TYPE      =
     A*(SELECT TEEWITTY FROM TEEW01 WHERE
     A*       TEEWFIRM ='01' AND ITEM=TEEWTENR)
     A*WHERE EXISTS
     A*(SELECT TEEWITTY FROM TEEW01 WHERE
     A*       TEEWFIRM ='01' AND ITEM=TEEWTENR)
     A*
     A*UPDATE        SKUAEREA SET TREND     =
     A*(SELECT TETEST   FROM TEIL01 WHERE
     A*       TEFIRM ='01' AND ITEM=TETENR)
     A*WHERE EXISTS
     A*(SELECT TETEST   FROM TEIL01 WHERE
     A*       TEFIRM ='01' AND ITEM=TETENR)
     A*
     A*UPDATE        SKUAEREA SET TRENDPGRP =
     A*(SELECT TEEWPRGR FROM TEEW01 WHERE
     A*       TEEWFIRM ='01' AND ITEM=TEEWTENR)
     A*WHERE EXISTS
     A*(SELECT TEEWPRGR FROM TEEW01 WHERE
     A*       TEEWFIRM ='01' AND ITEM=TEEWTENR)
     A*
     A*LEVEL 1 GLEICHHEIT PGROUP UND IDCO-FINANCIAL
     A*SELECT DISTINCT SKUAEREA.ITEM, SKUAEREA.PGROUP, SKUAEREA.FINANCIAL,
     A*SKUAEREA."TYPE", SKUAEREA.IDCO, SKUAEREA.IDCOCURENT, SKUAEREA.TREND
     A*, SKUAEREA.TRENDPGRP , SKUIDCO.IDCO FROM SKUAEREA , SKUIDCO WHERE
     A*SKUAEREA.PAREA= SKUIDCO.PGROUP AND SKUAEREA.FINANCIAL =
     A*SUBSTR(SKUIDCO.IDCO, 3, 3) ORDER BY IDCOCURENT
     A* ==> DATEI SIEVOUPD IN TVRELWAECO WURDE ERSTELLT.
     A*
     A*LEVEL 2 GLEICHHEIT IDCO-FINANCIAL
     A*INSERT INTO TVRELWAECO/SIEVOUPD
     A*SELECT DISTINCT A.ITEM, A.PGROUP,A.FINANCIAL, A."TYPE", A.IDCO,
     A*A.IDCOCURENT, A.TREND , A.TRENDPGRP , SKUIDCO.IDCO FROM SKUAEREA A,
     A*SKUIDCO WHERE A.FINANCIAL = SUBSTR(SKUIDCO.IDCO, 3, 3) AND A.ITEM
     A*NOT IN (SELECT C.ITEM FROM SIEVOUPD C) ORDER BY IDCOCURENT
     A*==> 5448 ZEILEN IN SIEVOUPD IN TVRELWAECO EINGEFÜGT.
     A*
     A*LEVEL 3 GLEICHHEIT TRENPRODUKTGRUPPE UND SKUIDCO, 3, 3
     A*INSERT INTO TVRELWAECO/SIEVOUPD
     A*SELECT DISTINCT A.ITEM, A.PGROUP,A.FINANCIAL, A."TYPE", A.IDCO,
     A*A.IDCOCURENT, A.TREND , A.TRENDPGRP , SKUIDCO.IDCO FROM SKUAEREA A,
     A*SKUIDCO WHERE A.ITEM NOT IN (SELECT C.ITEM FROM SIEVOUPD C) AND
     A*A.TRENDPGRP = SUBSTR(SKUIDCO.IDCO, 3, 3)
     A*36372 ZEILEN IN SIEVOUPD IN TVRELWAECO EINGEFÜGT.
     A*
     A*LEVEL ? FEHLEN IN DATEI SIEVOUPD DA KEINE DECKUNG (SÄTZE KOMMEN AUS INRIVER)
     A*UPDATE SIEVOUPD SET IDCO =
     A*(SELECT TEEWIDCO FROM TEEW01 WHERE ITEM=TEEWTENR
     A*                     AND TEEWFIRM='01' AND TEEWIDCO <> ' ')
     A*WHERE EXISTS
     A*(SELECT TEEWIDCO FROM TEEW01 WHERE ITEM=TEEWTENR
     A*                     AND TEEWFIRM='01' AND TEEWIDCO <> ' ')
     A*3851 ZEILEN IN SIEVOUPD IN TVRELWAECO AKTUALISIERT.
     A*UPDATE TEEW01  SET TEEWIDCO=
     A*(SELECT IDCO01   FROM SIEVOUPD WHERE ITEM=TEEWTENR
     A*                     AND TEEWFIRM='01' AND TEEWIDCO =  ' '
     A*                     AND IDCO01   <> ' ')
     A*WHERE EXISTS
     A*(SELECT IDCO01   FROM SIEVOUPD WHERE ITEM=TEEWTENR
     A*                     AND TEEWFIRM='01' AND TEEWIDCO =  ' '
     A*                     AND IDCO01   <> ' ')
     A*50046 ZEILEN IN TEEW01 IN MODWAO AKTUALISIERT.
     A*
     A*FÜR PROZESS UNINTERESSANT
     A*IDCOCURENT AUS SIEVO_VL2(GEMELDETE SIEVODATEI)
     A*UPDATE   SIEVOUPD SET IDCO =IDCO01
     A*       WHERE IDCOCURENT = ' ' AND ITEM IN (SELECT
     A*INUMBE FROM SIEVO_VL2 WHERE IDCO_ = ' ')
     A*UPDATE   SIEVOUPD SET IDCO =IDCO01
     A*       WHERE IDCO = ' ' AND ITEM IN (SELECT
     A*INUMBE FROM SIEVO_VL2 WHERE IDCO_ = ' ')
     A* ???????????????????
     A*UPDATE   SKUAEREA SET IDCO =IDCOCURENT
     A*       WHERE IDCO = ' ' AND IDCOCURENT <> ' '
     A*                        AND ITEM IN (SELECT
     A*INUMBE FROM SIEVO_VL2 WHERE IDCO_ = ' ')
     A*2 ZEILEN IN SKUAEREA IN TVRELWAECO AKTUALISIERT.
     A*
     A*
     A*
     A*UPDATE  SIEVO_VL2      SET  IDCO_    =
     A*(SELECT  IDCO FROM SIEVOUPD WHERE
     A*     ARTNR  = ITEM  AND IDCO_ = ' ' AND IDCO <>' ')
     A*WHERE EXISTS
     A*(SELECT  IDCO FROM SIEVOUPD WHERE
     A*     ARTNR  = ITEM  AND IDCO_ = ' ' AND IDCO <>' ')
     A*UPDATE  SIEVO_VL2      SET  IDCO_    =
     A*(SELECT  IDCO FROM SIEVOUPD WHERE
     A*     INUMBE = ITEM  AND IDCO_ = ' ' AND IDCO <>' ')
     A*WHERE EXISTS
     A*(SELECT  IDCO FROM SIEVOUPD WHERE
     A*     INUMBE = ITEM  AND IDCO_ = ' ' AND IDCO <>' ')
     A*
     A*UPDATE TVRELWAECO/SIEVO_VL2 A SET A.IDCO_ =
     A* (SELECT TEEWIDCO      FROM TEEW01
     A*     WHERE ARTNR = TEEWTENR  AND A.IDCO_ = ' ' AND
     A*           TEEWFIRM IN ('01'))
     A*            WHERE EXISTS
     A* (SELECT TEEWIDCO      FROM TEEW01
     A*     WHERE ARTNR = TEEWTENR  AND A.IDCO_ = ' ' AND
     A*           TEEWFIRM IN ('01'))
     A*
     A*UPDATE TVRELWAECO/SIEVO_VL2 A SET A.IDCO_ =
     A* (SELECT MAX(TEOSMM01) FROM TEOS
     A*  WHERE ARTNR = TEOSTENR  AND TEOSKLCD = 'IDCO' AND
     A*    TEOSFIRM IN ('01') AND A.IDCO_ = ' ' GROUP BY TEOSTENR )
     A*        WHERE EXISTS
     A* (SELECT MAX(TEOSMM01) FROM TEOS
     A*  WHERE ARTNR = TEOSTENR  AND TEOSKLCD = 'IDCO' AND
     A*    TEOSFIRM IN ('01') AND A.IDCO_ = ' ' GROUP BY TEOSTENR )
     A*140 ZEILEN IN SIEVO_VL2 IN TVRELWAECO AKTUALISIERT.
     A*
     A*
     A*
     A*
     A*SELECT SIEVO_VL2.INUMBE FROM SIEVO_VL2, TEIL01 WHERE
     A*SIEVO_VL2.INUMBE = TEIL01.TETENR AND TEFIRM='01' AND IDCO_=' '
     A*
     A*
     A*SELECT * FROM SKUAEREA WHERE ITEM ='9600026438'
     A*SELECT * FROM SKUAEREA WHERE ITEM ='9600026438'
     A*
     A*
     A          R SKUAEREAR                 TEXT('SKUAEREA')
     A*****************************************************************
     A            ITEM          15A
     A            PAREA         50A         TEXT('SKUPRODUCTAREA')
     A            PGROUP        50A         TEXT('SKUPRODUCTGROUP')
     A            FAMILY        50A         TEXT('SKMODELFAMILY')
     A            MODEL         50A         TEXT('SKUMODEL')
     A            FINANCIAL     05A         TEXT('FINANCIALPG')
     A            TYPE          04A         TEXT('TYPE')
     A            IDCO          05A         TEXT('IDCO')
     A            IDCOCURENT    05A         TEXT('IDCO CURRENT')
     A            TREND         02A         TEXT('REFERENZTREND STATUS')
     A            TRENDPGRP     04A         TEXT('REFERENZTREND TEPRGR')
     A*****************************************************************
     A            H1              L         TEXT('DATE      ')
     A            H2              Z         TEXT('TIMESTAMP')
