     A          R UMWELTT
     A            ARTIKEL       20A         TEXT('CONTENTS')
     A            PAPPE_GR      15S 6       TEXT('4000, 4030')
     A            KUNST_GR      15S 6       TEXT('4000, 4030')
     A            HOLZ_GR       15S 6       TEXT('4030')
     A            ELEKTRO_GR    15S 6       TEXT('4010')
     A            BATTERIE      10A         TEXT('4020')
     A            BATT_ANZ      15S 6       TEXT('4010')
     A            BATT_GR       15S 6       TEXT('4010')
     A            ARTIKEL#      15A         TEXT('CONTENTS')
     A            PROTOKOLL     15A         TEXT('CONTENTS')
     A            PROTOKOLLA     1A         TEXT('CONTENTS')
     A            PROTOKOLLB     1A         TEXT('CONTENTS')
     A            PROTOKOLLC     1A         TEXT('CONTENTS')
     A            PROTOKOLLD     1A         TEXT('CONTENTS')
     A            PROTOKOLLE     1A         TEXT('CONTENTS')
     A            PROTOKOLLF     1A         TEXT('CONTENTS')
     A            TIME_INPUT      Z         TEXT('TIMESTAMP')
     A            DATE_INPUT      L         TEXT('dispatch date')
     A            TIME_RELEA      Z         TEXT('TIMESTAMP')
     A            DATE_RELEA      L         TEXT('dispatch date')
