     A*
     A          R WATCHSPACE                TEXT('        ')
     A*****************************************************************
     A            WATCHSPACE   200A
     A*****************************************************************
     A            H1              L         TEXT('DATE      ')
     A            H2              Z         TEXT('TIMESTAMP')
