     A*
     A*         DATUM IMMER TT.MM.JJJJ
     A*         ZEIT  IMMER HH:MM
     A          R WUPOUTPUT                 TEXT('WUPOUTPUT')
     A*****************************************************************
     A            LBLBTENR      15A         COLHDG('LBLBTENR  ')
     A            LBLBBDAT       8S 0       COLHDG('LBLBBDAT  ')
     A            WUPWE         10A         COLHDG('WUPWE     ')
     A            AELFNR        10A         COLHDG('AELFNR    ')
     A            TCT            1A         COLHDG('TCT       ')
     A            TSTAMP          Z         TEXT('TIMESTAMP')
     A            VBKZ           1A         COLHDG('VBKZ     ')
     A            STATUS         1S 0       COLHDG('STATUS    ')
     A            RT             1S 0       COLHDG('RT        ')
     A            LNLDNR         3A         COLHDG('LANDNR    ')
     A            LNLDGR         4A         COLHDG('LANDGRUPPE')
