     A**************************************************************************
     A*  Copyright 2025 by    trend SWM EDV-Beratung GmbH & Co. KG             *
     A*                       Jechtinger Straße 9                              *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------- *
     A*  Kommunikationsparameter B2B Kunden (Status < '90') EXPORT             *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: PH 15.05.2025 Projekt Dometic Germany - B2B (Case #03777387)*
     A*  Änderung: XX XX.XX.XXXX                                               *
     A**************************************************************************
     A                                      REF(SWMREF)
     A          R EXB2B0031
     A*-------------------------------------------------------------------------
     A* Programmstatus
     A*-------------------------------------------------------------------------
     A            EXB003PGSTR               REFFLD(##PGST)
     A            EXB003PROGR               REFFLD(##PROG)
     A            EXB003SORTR               REFFLD(##SORT)
     A*-------------------------------------------------------------------------
     A* Übergabewerte
     A*-------------------------------------------------------------------------
     A            EXB003TSTPR               REFFLD(##TSTP)
     A            EXB003KDNRR               REFFLD(##KDNR)
     A            EXB003FREIR  964          REFFLD(##FREI)
