     A**************************************************************************
     A*  Copyright 2010 by    trend SWM                                        *
     A*                       Verwaltungs GmbH                                 *
     A*                       Ziegelhofstraße 210a                             *
     A*                       DE 79110 Freiburg                                *
     A*  --------------------------------------------------------------------- *
     A*  Kommunikationsbereich MOKUND                                          *
     A*  --------------------------------------------------------------------  *
     A**************************************************************************
     A                                      REF(SWMREF)
     A          R EXSFKUND1
     A            EXSFKDFR04R 1024          REFFLD(KUND1/KDFREX *LIBL/KUND)
