     A**************************************************************************
     A*  Copyright 2013 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------- *
     A*  Kommunikationsparameter für Schnittstelle TNT                         *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: PH 19.02.2013 Projekt 8997                                  *
     A*  Änderung: XX XX.XX.XXXX                                               *
     A**************************************************************************
     A                                      REF(SWMREF)
     A          R EXSPI01
     A*-------------------------------------------------------------------------
     A* Programmstatus
     A*-------------------------------------------------------------------------
     A            EXSPI0PGSTR               REFFLD(##PGST)
     A            EXSPI0PROGR               REFFLD(##PROG)
     A            EXSPI0FLDNR               REFFLD(##FLDN)
     A*-------------------------------------------------------------------------
     A* ON/OFF KZ für Prüfungen
     A*-------------------------------------------------------------------------
     A            EXSPI0IFKZR               REFFLD(##IFKZ)
     A            EXSPI002KZR               REFFLD(##A001)
     A                                      TEXT('ON/OFF-Feld für Prüfung 2')
     A            EXSPI0FR01R               REFFLD(##FREI)
     A*-------------------------------------------------------------------------
     A* Key-Felder
     A*-------------------------------------------------------------------------
     A            EXSPI0T020R               REFFLD(SPEDI01/TNT020 *LIBL/SPEDI0)
     A            EXSPI0FR02R  256          REFFLD(##FREI)
     A*-------------------------------------------------------------------------
     A* Kopier-Begriff NACH
     A*-------------------------------------------------------------------------
     A            EXSPI0NB02R               REFFLD(SPEDI01/TNT020 *LIBL/SPEDI0)
     A            EXSPI0FR03R  256          REFFLD(##FREI)
     A*-------------------------------------------------------------------------
     A* evt. weitere Felder für Update oder Prüfungen
     A*-------------------------------------------------------------------------
     A            EXSPI0FR04R  434          REFFLD(##FREI)
