     A**************************************************************************
     A*  Copyright 2001 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------- *
     A*  Kommunikationsparameter für Schenker Schnittstelle                    *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 25.05.2012 Projekt 8390                                  *
     A*                                                                        *
     A**************************************************************************
     A                                      REF(SWMREF)
     A          R EXSPG01
     A*-------------------------------------------------------------------------
     A* Programmstatus
     A*-------------------------------------------------------------------------
     A            EXSPG0PGSTR               REFFLD(##PGST)
     A            EXSPG0PROGR               REFFLD(##PROG)
     A            EXSPG0FLDNR               REFFLD(##FLDN)
     A*-------------------------------------------------------------------------
     A* ON/OFF KZ für Prüfungen
     A*-------------------------------------------------------------------------
     A            EXSPG0IFKZR               REFFLD(##IFKZ)
     A            EXSPG002KZR               REFFLD(##A001)
     A                                      TEXT('ON/OFF-Feld für Prüfung 2')
     A            EXSPG0FR01R               REFFLD(##FREI)
     A*-------------------------------------------------------------------------
     A* Key-Felder
     A*-------------------------------------------------------------------------
     A            EXSPG02020R               REFFLD(SPEDG01/SC2020 *LIBL/SPEDG0)
     A            EXSPG0FR02R  256          REFFLD(##FREI)
     A*-------------------------------------------------------------------------
     A* Kopier-Begriff NACH
     A*-------------------------------------------------------------------------
     A            EXSPG0N202R               REFFLD(SPEDG01/SC2020 *LIBL/SPEDG0)
     A            EXSPG0FR03R  256          REFFLD(##FREI)
     A*-------------------------------------------------------------------------
     A* evt. weitere Felder für Update oder Prüfungen
     A*-------------------------------------------------------------------------
     A            EXSPG0FR04R  434          REFFLD(##FREI)
