     A**************************************************************************
     A*  Copyright 2001 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------- *
     A*  Kommunikationsparameter für Schenker-Schnittstelle                    *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: VU 01.06.11                                                 *
     A*                                                                        *
     A**************************************************************************
     A                                      REF(SWMREF)
     A          R EXSPD01
     A*-------------------------------------------------------------------------
     A* Programmstatus
     A*-------------------------------------------------------------------------
     A            EXSPD0PGSTR               REFFLD(##PGST)
     A            EXSPD0PROGR               REFFLD(##PROG)
     A            EXSPD0FLDNR               REFFLD(##FLDN)
     A*-------------------------------------------------------------------------
     A* ON/OFF KZ für Prüfungen
     A*-------------------------------------------------------------------------
     A            EXSPD0IFKZR               REFFLD(##IFKZ)
     A            EXSPD0YYKZR               REFFLD(##A001)
     A                                      TEXT('ON/OFF-Feld für Prüfung 2')
     A            EXSPD0FR01R               REFFLD(##FREI)
     A*-------------------------------------------------------------------------
     A* Key-Felder
     A*-------------------------------------------------------------------------
     A            EXSPD0H020R               REFFLD(SPEDD01/SCH020 *LIBL/SPEDD0)
     A            EXSPD0FR02R  256          REFFLD(##FREI)
     A*-------------------------------------------------------------------------
     A* Kopier-Begriff NACH
     A*-------------------------------------------------------------------------
     A            EXSPD0N020R               REFFLD(SPEDD01/SCH020 *LIBL/SPEDD0)
     A            EXSPD0FR03R  256          REFFLD(##FREI)
     A*-------------------------------------------------------------------------
     A* evt. weitere Felder für Update oder Prüfungen
     A*-------------------------------------------------------------------------
     A            EXSPD0FR04R  434          REFFLD(##FREI)
