     A**************************************************************************
     A*  Copyright 2013 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------- *
     A*  Kommunikationsparameter für Schnittstelle Loxx                        *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 24.04.2013 Projekt 9228                                  *
     A*  Änderung:                                                             *
     A**************************************************************************
     A                                      REF(SWMREF)
     A          R EXSPK01
     A*-------------------------------------------------------------------------
     A* Programmstatus
     A*-------------------------------------------------------------------------
     A            EXSPK0PGSTR               REFFLD(##PGST)
     A            EXSPK0PROGR               REFFLD(##PROG)
     A            EXSPK0FLDNR               REFFLD(##FLDN)
     A*-------------------------------------------------------------------------
     A* ON/OFF KZ für Prüfungen
     A*-------------------------------------------------------------------------
     A            EXSPK0IFKZR               REFFLD(##IFKZ)
     A            EXSPK002KZR               REFFLD(##A001)
     A                                      TEXT('ON/OFF-Feld für Prüfung 2')
     A            EXSPK0FR01R               REFFLD(##FREI)
     A*-------------------------------------------------------------------------
     A* Key-Felder
     A*-------------------------------------------------------------------------
     A            EXSPK0X020R               REFFLD(SPEDK01/LOX020 *LIBL/SPEDK0)
     A            EXSPK0FR02R  256          REFFLD(##FREI)
     A*-------------------------------------------------------------------------
     A* Kopier-Begriff NACH
     A*-------------------------------------------------------------------------
     A            EXSPK0NX02R               REFFLD(SPEDK01/LOX020 *LIBL/SPEDK0)
     A            EXSPK0FR03R  256          REFFLD(##FREI)
     A*-------------------------------------------------------------------------
     A* evt. weitere Felder für Update oder Prüfungen
     A*-------------------------------------------------------------------------
     A            EXSPK0FR04R  434          REFFLD(##FREI)
