     A**************************************************************************
     A*  Copyright 2001 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------- *
     A*  Kommunikationsparameter für Schnittstelle Boll/Unitrans               *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 27.07.2011                                               *
     A*                                                                        *
     A**************************************************************************
     A                                      REF(SWMREF)
     A          R EXSP601
     A*-------------------------------------------------------------------------
     A* Programmstatus
     A*-------------------------------------------------------------------------
     A            EXSP60PGSTR               REFFLD(##PGST)
     A            EXSP60PROGR               REFFLD(##PROG)
     A            EXSP60FLDNR               REFFLD(##FLDN)
     A*-------------------------------------------------------------------------
     A* ON/OFF KZ für Prüfungen
     A*-------------------------------------------------------------------------
     A            EXSP60IFKZR               REFFLD(##IFKZ)
     A            EXSP60YYKZR               REFFLD(##A001)
     A                                      TEXT('ON/OFF-Feld für Prüfung 2')
     A            EXSP60FR01R               REFFLD(##FREI)
     A*-------------------------------------------------------------------------
     A* Key-Felder
     A*-------------------------------------------------------------------------
     A            EXSP60L020R               REFFLD(HEL60R1/HEL020 *LIBL/SPED60)
     A            EXSP60FR02R  256          REFFLD(##FREI)
     A*-------------------------------------------------------------------------
     A* Kopier-Begriff NACH
     A*-------------------------------------------------------------------------
     A            EXSP60N020R               REFFLD(HEL60R1/HEL020 *LIBL/SPED60)
     A            EXSP60FR03R  256          REFFLD(##FREI)
     A*-------------------------------------------------------------------------
     A* evt. weitere Felder für Update oder Prüfungen
     A*-------------------------------------------------------------------------
     A            EXSP60FR04R  434          REFFLD(##FREI)
