     A**************************************************************************
     A*  Copyright 2001 by    trend SWM                                        *
     A*                       Verwaltungs GmbH                                 *
     A*                       Ziegelhofstraße 210a                             *
     A*                       DE 79110 Freiburg                                *
     A*  --------------------------------------------------------------------- *
     A*  Kommunikationsbereich Kunden-Auftrags-Art Parameter                   *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: RE 13.09.2016                                               *
     A*                                                                        *
     A**************************************************************************
     A                                      REF(SWMREF)
     A          R EXWA131
     A*-------------------------------------------------------------------------
     A* Programmstatus
     A*-------------------------------------------------------------------------
     A            EXWA13PGSTR               REFFLD(##PGST)
     A            EXWA13PROGR               REFFLD(##PROG)
     A*-------------------------------------------------------------------------
     A* ON/OFF KZ für Prüfungen
     A*-------------------------------------------------------------------------
     A            EXWA13QQKZR               REFFLD(##A001)
     A                                      TEXT('ON/OFF-Feld für Prüfung 1')
     A            EXWA13YYKZR               REFFLD(##A001)
     A                                      TEXT('ON/OFF-Feld für Prüfung 2')
     A            EXWA13FR01R               REFFLD(##FREI)
     A*-------------------------------------------------------------------------
     A* Key-Felder
     A*-------------------------------------------------------------------------
     A            EXWA13AFATR               REFFLD(WA131/WA13AFAT *LIBL/WA13)
     A            EXWA13FR02R  256          REFFLD(##FREI)
     A*-------------------------------------------------------------------------
     A* Kopier-Begriff NACH
     A*-------------------------------------------------------------------------
     A            EXWA13NAFAR               REFFLD(WA131/WA13AFAT *LIBL/WA13)
     A            EXWA13FR03R  256          REFFLD(##FREI)
     A*-------------------------------------------------------------------------
     A* evt. weitere Felder für Update oder Prüfungen
     A*-------------------------------------------------------------------------
     A            EXWA13TLKZR               REFFLD(WA131/WA13TLKZ *LIBL/WA13)
     A            EXWA13FR04R  467          REFFLD(##FREI)
