     A**************************************************************************
     A*  Copyright 2011 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------- *
     A*  Schnittstelle Spedition Files aus DIR                                 *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: VU 05.08.2011 Projekt 7195                                  *
     A*                                                                        *
     A**************************************************************************
     A          R IFLV1                     PFILE(IFLV)
     A*-------------------------------------------------------------------------
     A          K IFLVFIRM
     A          K IFLVSTAT
     A          K IFLVNAME
