     A**************************************************************************
     A*  Copyright 2013 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------- *
     A*  Kundenstammänderungen                                                 *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 05.07.2013                                               *
     A*                                                                        *
     A**************************************************************************
     A                                      REF(SWMREF)
     A          R KUND1
     A*-------------------------------------------------------------------------
     A            KUNDFIRM  R               REFFLD(##FIRM)
     A            KUNDKDNR  R               REFFLD(##KDNR)
