     A**************************************************************************
     A*  Copyright 2022 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Jechtinger Straße 9                              *
     A*                       DE 79111 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Zuordnung Auftragswerk <- Artikel-Werk                                *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: PH 08.12.2022 Projekt 220567-02                             *
     A*  Änderung: XX XX.XX.XXXX                                               *
     A**************************************************************************
     A                                      REF(WA11)
     A          R KYWA111
     A*-------------------------------------------------------------------------
     A            KYWA11FIRMR               REFFLD(WA11FIRM)
     A            KYWA11WKNRR               REFFLD(WA11WKNR)
     A            KYWA11TEWKR               REFFLD(WA11TEWK)
     A            KYWA11TSTPR               REFFLD(WA11TSTP)
     A            K$WA11FREI    30
     A            K#WA11LOCKR               REFFLD(WA11LOCK)
     A            K#WA11FIRMR               REFFLD(WA11FIRM)
     A            K#WA11WKNRR               REFFLD(WA11WKNR)
     A            K#WA11TEWKR               REFFLD(WA11TEWK)
