     A**************************************************************************
     A*  Copyright 2007 by    trend SWM                                        *
     A*                       Verwaltungs GmbH                                 *
     A*                       Ziegelhofstraße 210a                             *
     A*                       DE 79110 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Serien-Nr                                                             *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: MG 06.02.2007 Projekt-Nr 4200                               *
     A*            Vergabe von Serien-Nr in der Bestell-Abwicklung             *
     A*                                                                        *
     A**************************************************************************
     A                                      REF(WAO2)
     A          R KYWAO21
     A*-------------------------------------------------------------------------
     A            KYWAO2FIRMR               REFFLD(WAO2FIRM)
     A            KYWAO2BEJJR               REFFLD(WAO2BEJJ)
     A            KYWAO2BENRR               REFFLD(WAO2BENR)
     A            KYWAO2BEPOR               REFFLD(WAO2BEPO)
     A            KYWAO2TSTPR               REFFLD(WAO2TSTP)
     A            KWAO2$FREI    30
     A            K#WAO2LOCKR               REFFLD(WAO2LOCK)
     A            K#WAO2FIRMR               REFFLD(WAO2FIRM)
     A            K#WAO2BEJJR               REFFLD(WAO2BEJJ)
     A            K#WAO2BENRR               REFFLD(WAO2BENR)
     A            K#WAO2BEPOR               REFFLD(WAO2BEPO)
