     A**************************************************************************
     A*  Copyright 2021 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Jechtinger Straße 9                              *
     A*                       DE 79111 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Zuordnung Land <- Artikel (Ein-/Ausschluss)                           *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: PH 01.03.2021 Projekt 16393-01                              *
     A*  Änderung: XX XX.XX.XXXX                                               *
     A**************************************************************************
     A                                      REF(WAOY)
     A          R KYWAOY1
     A*-------------------------------------------------------------------------
     A            KYWAOYFIRMR               REFFLD(WAOYFIRM)
     A            KYWAOYLANDR               REFFLD(WAOYLAND)
     A            KYWAOYTENRR               REFFLD(WAOYTENR)
     A            KYWAOYTSTPR               REFFLD(WAOYTSTP)
     A            K$WAOYFREI    30
     A            K#WAOYLOCKR               REFFLD(WAOYLOCK)
     A            K#WAOYFIRMR               REFFLD(WAOYFIRM)
     A            K#WAOYLANDR               REFFLD(WAOYLAND)
     A            K#WAOYTENRR               REFFLD(WAOYTENR)
