     A**************************************************************************
     A*  Copyright 2024 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Jechtinger Straße 9                              *
     A*                       DE 79111 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Zolltarif/Ident-Datei                                                 *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: ZG 14.01.2026 Case #05780597                                *
     A*  Änderung: XX XX.XX.XXXX                                               *
     A**************************************************************************
     A                                      REF(ZOTE)
     A          R KYZOTE1
     A*-------------------------------------------------------------------------
     A            KYZOTEFIRMR               REFFLD(ZOTEFIRM)
     A            KYZOTETENRR               REFFLD(ZOTETENR)
     A            KYZOTEIMEXR               REFFLD(ZOTEIMEX)
     A            KYZOTEGADAR               REFFLD(ZOTEGADA)
     A            KYZOTEZOTNR               REFFLD(ZOTEZOTN)
     A            KYZOTETSTPR               REFFLD(ZOTETSTP)
     A            K$ZOTEFREI    30
     A            K#ZOTELOCKR               REFFLD(ZOTELOCK)
     A            K#ZOTEFIRMR               REFFLD(ZOTEFIRM)
     A            K#ZOTETENRR               REFFLD(ZOTETENR)
     A            K#ZOTEIMEXR               REFFLD(ZOTEIMEX)
     A            K#ZOTEGADAR               REFFLD(ZOTEGADA)
