     A*****************************************************************
     A*  Copyright 1997 by    trend SWM                               *
     A*                       Verwaltungs-GmbH                        *
     A*                       Bötzinger Strasse 36                    *
     A*                       D-79111 Freiburg                        *
     A*  -----------------------------------------------------------  *
     A*  Schnittstellendatei für Lagerleitrechner                     *
     A*  -----------------------------------------------------------  *
     A*                                                               *
     A*  Schlüsselbeschreibung                                        *
     A*  ---------------------                                        *
     A*  Firmennummer                  KYPCLBFIRM   PCLBFIRM  K       *
     A*  Status                        KYPCLBSTAT   PCLBSTAT  K       *
     A*  Dateiname                     KYPCLBAFDN   PCLBAFDN  K       *
     A*  Auftrags-Jahr                 KYPCLBAFJJ   PCLBAFJJ  K       *
     A*  Auftrags-Nummer               KYPCLBAFNR   PCLBAFNR  K       *
     A*  Auftrags-Position             KYPCLBAFPO   PCLBAFPO  K       *
     A*  Auftrags-Unterposition        KYPCLBAFUP   PCLBAFUP  K       *
     A*  Sendedatum                    KYPCLBSEDA   PCLBSEDA  K       *
     A*  Sendezzeit                    KYPCLBSEZT   PCLBSEZT  K       *
     A*  lfd. Index                    KYPCLBLFIX   PCLBLFIX  K       *
     A*  -----------------------------------------------------------  *
     A*                                                               *
     A*****************************************************************
     A*
     A          R PCLB1                     PFILE(PCLB)
     A*
     A          K PCLBFIRM
     A          K PCLBSTAT
     A          K PCLBAFDN
     A          K PCLBAFJJ
     A          K PCLBAFNR
     A          K PCLBAFPO
     A          K PCLBAFUP
     A          K PCLBSEDA
     A          K PCLBSEZT
     A          K PCLBLFIX
