     A**************************************************************************
     A*  Copyright 2001 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------- *
     A*  Rückgabebereich Scnhittstelle-Schenker                                *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: VU 06.06.2011                                               *
     A*                                                                        *
     A**************************************************************************
     A                                      REF(SWMREF)
     A          R RTSPD01
     A*-------------------------------------------------------------------------
     A* allgemeine Rückgabe
     A*-------------------------------------------------------------------------
     A            RTSPD0PROGR               REFFLD(##PROG)
     A            RTSPD0DANAR               REFFLD(##DANA)
     A            RTSPD0RTCDR               REFFLD(##RTCD)
     A            RTSPD0FFLDR               REFFLD(##FFLD)
     A            RTSPD0FENRR               REFFLD(##FENR)
     A            RTSPD0PA03R               REFFLD(##A010)
     A                                      TEXT('Parameter 3 bei Fehler')
     A            RTSPD0PA04R               REFFLD(##A010)
     A                                      TEXT('Parameter 4 bei Fehler')
     A            RTSPD0PA05R               REFFLD(##A010)
     A                                      TEXT('Parameter 5 bei Fehler')
     A            RTSPD0PA06R               REFFLD(##A010)
     A                                      TEXT('Parameter 6 bei Fehler')
     A            RTSPD0PA07R               REFFLD(##A010)
     A                                      TEXT('Parameter 7 bei Fehler')
     A*-------------------------------------------------------------------------
     A* ON/OFF Rückgabe KZ für Prüfungen
     A*-------------------------------------------------------------------------
     A            RTSPD0QQKZR               REFFLD(##A001)
     A                                      TEXT('ON/OFF-Feld für Prüfung 1')
     A            RTSPD0YYKZR               REFFLD(##A001)
     A                                      TEXT('ON/OFF-Feld für Prüfung 2')
     A            RTSPD0FR01R               REFFLD(##FREI)
     A*-------------------------------------------------------------------------
     A* Key-Felder
     A*-------------------------------------------------------------------------
     A            RTSPD0H020R               REFFLD(SPEDD01/SCH020 *LIBL/SPEDD0)
     A            RTSPD0FR02R  256          REFFLD(##FREI)
     A*-------------------------------------------------------------------------
     A* evt. weitere Felder nach Ermittlung
     A*-------------------------------------------------------------------------
     A            RTSABEFR03R  646          REFFLD(##FREI)
