     A**************************************************************************
     A*  Copyright 2001 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------- *
     A*  Rückgabebereich Scnhittstelle Boll/Unitrans                           *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 27.07.2011                                               *
     A*                                                                        *
     A**************************************************************************
     A                                      REF(SWMREF)
     A          R RTSP601
     A*-------------------------------------------------------------------------
     A* allgemeine Rückgabe
     A*-------------------------------------------------------------------------
     A            RTSP60PROGR               REFFLD(##PROG)
     A            RTSP60DANAR               REFFLD(##DANA)
     A            RTSP60RTCDR               REFFLD(##RTCD)
     A            RTSP60FFLDR               REFFLD(##FFLD)
     A            RTSP60FENRR               REFFLD(##FENR)
     A            RTSP60PA03R               REFFLD(##A010)
     A                                      TEXT('Parameter 3 bei Fehler')
     A            RTSP60PA04R               REFFLD(##A010)
     A                                      TEXT('Parameter 4 bei Fehler')
     A            RTSP60PA05R               REFFLD(##A010)
     A                                      TEXT('Parameter 5 bei Fehler')
     A            RTSP60PA06R               REFFLD(##A010)
     A                                      TEXT('Parameter 6 bei Fehler')
     A            RTSP60PA07R               REFFLD(##A010)
     A                                      TEXT('Parameter 7 bei Fehler')
     A*-------------------------------------------------------------------------
     A* ON/OFF Rückgabe KZ für Prüfungen
     A*-------------------------------------------------------------------------
     A            RTSP60QQKZR               REFFLD(##A001)
     A                                      TEXT('ON/OFF-Feld für Prüfung 1')
     A            RTSP60YYKZR               REFFLD(##A001)
     A                                      TEXT('ON/OFF-Feld für Prüfung 2')
     A            RTSP60FR01R               REFFLD(##FREI)
     A*-------------------------------------------------------------------------
     A* Key-Felder
     A*-------------------------------------------------------------------------
     A            RTSP60L020R               REFFLD(HEL60R1/HEL020 *LIBL/SPED60)
     A            RTSP60FR02R  256          REFFLD(##FREI)
     A*-------------------------------------------------------------------------
     A* evt. weitere Felder nach Ermittlung
     A*-------------------------------------------------------------------------
     A            RTSP60FR03R  646          REFFLD(##FREI)
