     A**************************************************************************
     A*  Copyright 2001 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------- *
     A*  Rückgabebereich Schnittstelle Schenker                                *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 25.05.2012 Projekt 8390                                  *
     A*                                                                        *
     A**************************************************************************
     A                                      REF(SWMREF)
     A          R RTSPG01
     A*-------------------------------------------------------------------------
     A* allgemeine Rückgabe
     A*-------------------------------------------------------------------------
     A            RTSPG0PROGR               REFFLD(##PROG)
     A            RTSPG0DANAR               REFFLD(##DANA)
     A            RTSPG0RTCDR               REFFLD(##RTCD)
     A            RTSPG0FFLDR               REFFLD(##FFLD)
     A            RTSPG0FENRR               REFFLD(##FENR)
     A            RTSPG0PA03R               REFFLD(##A010)
     A                                      TEXT('Parameter 3 bei Fehler')
     A            RTSPG0PA04R               REFFLD(##A010)
     A                                      TEXT('Parameter 4 bei Fehler')
     A            RTSPG0PA05R               REFFLD(##A010)
     A                                      TEXT('Parameter 5 bei Fehler')
     A            RTSPG0PA06R               REFFLD(##A010)
     A                                      TEXT('Parameter 6 bei Fehler')
     A            RTSPG0PA07R               REFFLD(##A010)
     A                                      TEXT('Parameter 7 bei Fehler')
     A*-------------------------------------------------------------------------
     A* ON/OFF Rückgabe KZ für Prüfungen
     A*-------------------------------------------------------------------------
     A            RTSPG001KZR               REFFLD(##A001)
     A                                      TEXT('ON/OFF-Feld für Prüfung 1')
     A            RTSPG002KZR               REFFLD(##A001)
     A                                      TEXT('ON/OFF-Feld für Prüfung 2')
     A            RTSPG0FR01R               REFFLD(##FREI)
     A*-------------------------------------------------------------------------
     A* Key-Felder
     A*-------------------------------------------------------------------------
     A            RTSPG02020R               REFFLD(SPEDG01/SC2020 *LIBL/SPEDG0)
     A            RTSPG0FR02R  256          REFFLD(##FREI)
     A*-------------------------------------------------------------------------
     A* evt. weitere Felder nach Ermittlung
     A*-------------------------------------------------------------------------
     A            RTSPG0FR03R  646          REFFLD(##FREI)
