     A**************************************************************************
     A*  Copyright 2021 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Jechtinger Straße 9                              *
     A*                       DE 79111 Freiburg                                *
     A*  --------------------------------------------------------------------- *
     A*  Rückgabebereich Zuordnung Land <- Artikel (Ein-/Ausschluss)           *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: PH 01.03.2021 Projekt 16393-01                              *
     A*  Änderung: XX XX.XX.XXXX                                               *
     A**************************************************************************
     A                                      REF(SWMREF)
     A          R RTWAOY1
     A*-------------------------------------------------------------------------
     A* allgemeine Rückgabe
     A*-------------------------------------------------------------------------
     A            RTWAOYPROGR               REFFLD(##PROG)
     A            RTWAOYDANAR               REFFLD(##DANA)
     A            RTWAOYRTCDR               REFFLD(##RTCD)
     A            RTWAOYFFLDR               REFFLD(##FFLD)
     A            RTWAOYFENRR               REFFLD(##FENR)
     A            RTWAOYPA03R               REFFLD(##A010)
     A                                      TEXT('Parameter 3 bei Fehler')
     A            RTWAOYPA04R               REFFLD(##A010)
     A                                      TEXT('Parameter 4 bei Fehler')
     A            RTWAOYPA05R               REFFLD(##A010)
     A                                      TEXT('Parameter 5 bei Fehler')
     A            RTWAOYPA06R               REFFLD(##A010)
     A                                      TEXT('Parameter 6 bei Fehler')
     A            RTWAOYPA07R               REFFLD(##A010)
     A                                      TEXT('Parameter 7 bei Fehler')
     A*-------------------------------------------------------------------------
     A* ON/OFF Rückgabe KZ für Prüfungen
     A*-------------------------------------------------------------------------
     A            RTWAOYFR01R               REFFLD(##FREI)
     A*-------------------------------------------------------------------------
     A* Key-Felder
     A*-------------------------------------------------------------------------
     A            RTWAOYLANDR               REFFLD(WAOY1/WAOYLAND *LIBL/WAOY)
     A            RTWAOYTENRR               REFFLD(WAOY1/WAOYTENR *LIBL/WAOY)
     A            RTWAOYFR02R  256          REFFLD(##FREI)
     A*-------------------------------------------------------------------------
     A* evt. weitere Felder nach Ermittlung
     A*-------------------------------------------------------------------------
     A            RTWAOYEASCR               REFFLD(WAOY1/WAOYEASC *LIBL/WAOY)
     A            RTWAOYTSTPR               REFFLD(WAOY1/WAOYTSTP *LIBL/WAOY)
     A            RTWAOYERUSR               REFFLD(WAOY1/WAOYERUS *LIBL/WAOY)
     A            RTWAOYFR03R  608          REFFLD(##FREI)
