     A**************************************************************************
     A*  Copyright 2014 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------- *
     A*  Rückgabebereich SDB pro Land, Artikel                                 *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: MG 14.01.2014 Projekt 9787                                  *
     A*                                                                        *
     A**************************************************************************
     A                                      REF(SWMREF)
     A          R RTWAOU1
     A*-------------------------------------------------------------------------
     A* allgemeine Rückgabe
     A*-------------------------------------------------------------------------
     A            RTWAOUPROGR               REFFLD(##PROG)
     A            RTWAOUDANAR               REFFLD(##DANA)
     A            RTWAOURTCDR               REFFLD(##RTCD)
     A            RTWAOUFFLDR               REFFLD(##FFLD)
     A            RTWAOUFENRR               REFFLD(##FENR)
     A            RTWAOUPA03R               REFFLD(##A010)
     A                                      TEXT('Parameter 3 bei Fehler')
     A            RTWAOUPA04R               REFFLD(##A010)
     A                                      TEXT('Parameter 4 bei Fehler')
     A            RTWAOUPA05R               REFFLD(##A010)
     A                                      TEXT('Parameter 5 bei Fehler')
     A            RTWAOUPA06R               REFFLD(##A010)
     A                                      TEXT('Parameter 6 bei Fehler')
     A            RTWAOUPA07R               REFFLD(##A010)
     A                                      TEXT('Parameter 7 bei Fehler')
     A*-------------------------------------------------------------------------
     A* ON/OFF Rückgabe KZ für Prüfungen
     A*-------------------------------------------------------------------------
     A            RTWAOUFR01R               REFFLD(##FREI)
     A*-------------------------------------------------------------------------
     A* Key-Felder
     A*-------------------------------------------------------------------------
     A            RTWAOUTENRR               REFFLD(WAOU1/WAOUTENR *LIBL/WAOU)
     A            RTWAOULANDR               REFFLD(WAOU1/WAOULAND *LIBL/WAOU)
     A            RTWAOUFR02R  256          REFFLD(##FREI)
     A*-------------------------------------------------------------------------
     A* evt. weitere Felder nach Ermittlung
     A*-------------------------------------------------------------------------
     A            RTWAOUWEBSR               REFFLD(WAOU1/WAOUWEBS *LIBL/WAOU)
     A            RTWAOUTSTPR               REFFLD(WAOU1/WAOUTSTP *LIBL/WAOU)
     A            RTWAOUERUSR               REFFLD(WAOU1/WAOUERUS *LIBL/WAOU)
     A            RTWAOUFR03R  544          REFFLD(##FREI)
