     A**************************************************************************
     A*  Copyright 1995 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Schilling-Buchhaltung Übergabeparameter Kundenstamm                   *
     A*  Erstellt aus Copy-Strecke SFBS/X03FKDBRCV                             *
     A*  Verwendet in Programm TRKUSC                                          *
     A*  Die Kommentare stehen immer vor dem zugehörigen Feld                  *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 22.09.1995                                               *
     A*  Änderung: SZ 24.01.2002 Anpassung Release 2.03                        *
     A*  Änderung: SZ 08.03.2013 Projekt 9110,                                 *
     A*            Basis ist jetzt SFBS/X04FPKTRCV                             *
     A*                                                                        *
     A**************************************************************************
     A          R SKDY1
     A*-------------------------------------------------------------------------
     A            SKKTBZ        32A         COLHDG('Kontobezeichnung')
     A            SKDIKZ         1A         COLHDG('diverses Kto. KZ')
     A            SKWHRG         3A         COLHDG('Währung')
     A            SKKTOK        25A         COLHDG('Kto. beim Kunden')
     A            SKVBKZ         1A         COLHDG('verb. Unternehmen KZ')
     A            SKVBNR         9A         COLHDG('Verbandsnummer')
     A            SKVBMG        10A         COLHDG('Verbandsmitgliednr.')
     A            SKZABD         2A         COLHDG('Zahlungsbedingung')
     A            SKVATG         3S 0       COLHDG('Valutatage')
     A            SKBONI         1A         COLHDG('Bonität')
     A            SKLIGP         9A         COLHDG('Limitkontrollgruppe')
     A            SKLI01        11S 0       COLHDG('Limit 1')
     A            SKLID1         8A         COLHDG('Limitdatum 1')
     A            SKLI02        11S 0       COLHDG('Limit 2')
     A            SKLID2         8A         COLHDG('Limitdatum 2')
     A            SKLIA2         2S 0       COLHDG('Limitart 2')
     A            SKLIR2        10A         COLHDG('Limitreferenz 2')
     A            SKRVDA         8A         COLHDG('Rückvers.datum')
     A            SKLI2G         8A         COLHDG('Limit 2 gültig ab')
     A            SKSKD1         8A         COLHDG('Statistikkdnr. 1')
     A            SKSKD2         8A         COLHDG('Statistikkdnr. 2')
     A            SKSKD3         8A         COLHDG('Statistikkdnr. 3')
     A            SKSLF1         8A         COLHDG('Statistiklief. 1')
     A            SKSLF2         8A         COLHDG('Statistiklief. 2')
     A            SKSLF3         8A         COLHDG('Statistiklief. 3')
     A            SKBBNR         8S 0       COLHDG('Bundes-Betriebsnr.')
     A            SKBBSN         6S 0       COLHDG('Betriebsstättennr.')
     A            SKUSTL         2A         COLHDG('USt Landeskennz.')
     A            SKUSTI        13A         COLHDG('USt Identnummer')
     A            SKUIPR         1A         COLHDG('USt Id geprüft')
     A            SKUIDA         8A         COLHDG('USt Id geprüft am')
     A            SKZAEP         9A         COLHDG('Zahlungsempfänger')
     A            SKMAEP         9A         COLHDG('Mahnempfänger')
     A            SKVTNR         3A         COLHDG('Vertreter')
     A            SKEEPF         9A         COLHDG('Einzugempfänger')
     A            SKZIEL         2S 0       COLHDG('KVZiel')
     A            SKILND        13A         COLHDG('ILN')
     A            SKIBAN        34A         COLHDG('IBAN')
     A            SKEURO         8A         COLHDG('EuroDatum')
     A*-------------------------------------------------------------------------
     A            FKFKSL         2A         COLHDG('Forderungssammelkto')
     A            FKSKSL         2A         COLHDG('Sammelkontoschlüssel')
     A            FKBKLD         3A         COLHDG('Bankland')
     A            FKBLZL        20A         COLHDG('Bankleitzahl')
     A            FKBKTO        35A         COLHDG('Bankkonto')
     A            FKBKNR         3A         COLHDG('Banknr')
     A            FKAZSL         3A         COLHDG('AZVVORBSL')
     A            FKEZGA         1A         COLHDG('Einzugart')
     A            FKZVKS         5A         COLHDG('ZVK SaBe')
     A            FKBESB         5A         COLHDG('Bankeinz. SaBe')
     A            FKSKTG         3S 0       COLHDG('Skontotoleranztage')
     A            FKRFKT         9A         COLHDG('Referenzkto')
     A            FKVRKZ         1A         COLHDG('Verrechnungskennz.')
     A            FKZART         1A         COLHDG('Zahlart')
     A            FKZAKZ         1A         COLHDG('Zahlkennzeichen')
     A            FKMAKZ         1A         COLHDG('Mahnkennzeichen')
     A            FKMASB         5A         COLHDG('Mahnsachbearbeiter')
     A            FKMAGP        10A         COLHDG('Mahngruppe')
     A            FKVBKZ         1A         COLHDG('MahnVBDKennzeichen')
     A            FKBDKZ         1A         COLHDG('BEVBDKennzeichen')
     A            FKZIKZ         1A         COLHDG('Zinsrechnungkennz.')
     A            FKZITG         3S 0       COLHDG('zinsfreie Tage')
     A            FKSABE         5A         COLHDG('Sachbearbeiter')
     A            FKNEBU         1A         COLHDG('Nettobuchkz')
     A            FKMGKZ         1A         COLHDG('Meldg.bei Buchung Kz')
     A            FKMGTX         2A         COLHDG('Meldungtextschlüssel')
     A            FKMIBP         6A         COLHDG('bebuchen ab Periode')
     A            FKMABP         6A         COLHDG('bebuchen bis Periode')
     A            FKSLBE         3A         COLHDG('VWZSLBE')
     A            FKSLZV         3A         COLHDG('VWZSLZV')
     A            FKDKPZ         5S 2       COLHDG('Delkred.Prozent')
     A            FKDCKZ         1A         COLHDG('DelkredBRTKennz.')
     A            FKRLKZ         1A         COLHDG('REListDRKennzeichen')
     A            FKEZKZ         1A         COLHDG('Einzugserlaubnis Kz')
     A            FKRFFI         5S 0       COLHDG('Referenz Fa')
     A            FKBEKZ         1A         COLHDG('BEBGLSCHRKZ')
     A            FKZVKZ         1A         COLHDG('ZVBGLSCHRKZ')
     A            FKVBRG         9A         COLHDG('VBDREGNR')
     A            FKSTNR        20A         COLHDG('STDRNR')
     A            FKKOND         5A         COLHDG('Kond.Schema')
     A            FKBICN        11A         COLHDG('BIC')
     A            FKFIL1        89A         COLHDG('Leerfeld 1')
     A            FKFIL2       128A         COLHDG('Leerfeld 2')
     A*-------------------------------------------------------------------------
     A            FKBOKZ         1A         COLHDG('BOKZ')
     A            FKLCRK         1A         COLHDG('LCRKZ')
     A            FKSCHK         1A         COLHDG('SCHECKKZ')
     A            FKUBWK         1A         COLHDG('UBWKZ')
     A            FKESRR         1A         COLHDG('ESRREFFMT')
     A            FKTLNN         9S 0       COLHDG('TEILNNR')
     A            FKIDNR         6S 0       COLHDG('KDIDNR')
     A            FKPSKT         9S 0       COLHDG('POSCHKTO')
     A            FKPBLZ         9S 0       COLHDG('POSCHKTOBK')
     A            FKLAND         3S 0       COLHDG('SADLAND')
     A            FKPSKA        16A         COLHDG('POSCHKTOAUSL')
     A            FKEMPF         5A         COLHDG('EMPFKENNUNG')
     A            FKFIL5        66A         COLHDG('Leerfeld 5')
     A*-------------------------------------------------------------------------
     A*                              _ = NICHT BENUTZT
     A*                              V = DATEN ÜBERGEBEN (VORSCHLAG)
     A*                              J = DATEN ÜBERG + FELD SPERREN
     A*                              B = FELD SPERREN OHNE ÜBERGABE
     A            SKKZKB         1A         COLHDG('KZ Kontobezeichnung')
     A            SKKZDI         1A         COLHDG('KZ div. Konto')
     A            SKKZWG         1A         COLHDG('KZ Währung')
     A            SKKZKK         1A         COLHDG('KZ Kto. beim Kunden')
     A            SKKZVB         1A         COLHDG('KZ verb. Unternehmen')
     A            SKKZVN         1A         COLHDG('KZ Verbandsnummer')
     A            SKKZVM         1A         COLHDG('KZ Verbandsmitgliedn')
     A            SKKZZB         1A         COLHDG('KZ Zahlungsbedingung')
     A            SKKZVA         1A         COLHDG('KZ Valutatage')
     A            SKKZBO         1A         COLHDG('KZ Bonität')
     A            SKKZLG         1A         COLHDG('KZ Limitkontrollgrp.')
     A            SKKZL1         1A         COLHDG('KZ Limit 1')
     A            SKKZD1         1A         COLHDG('KZ Limitdatum 1')
     A            SKKZL2         1A         COLHDG('KZ Limit 2')
     A            SKKZD2         1A         COLHDG('KZ Limitdatum 2')
     A            SKKZLA         1A         COLHDG('KZ Limitart 2')
     A            SKKZLR         1A         COLHDG('KZ Limitreferenz 2')
     A            SKKZRV         1A         COLHDG('KZ Rückversich.Datum')
     A            SKKZLD         1A         COLHDG('KZ Limit 2 gültig ab')
     A            SKKZS1         1A         COLHDG('KZ Statistikkdnr. 1')
     A            SKKZS2         1A         COLHDG('KZ Statistikkdnr. 2')
     A            SKKZS3         1A         COLHDG('KZ Statistikkdnr. 3')
     A            SKKZI1         1A         COLHDG('KZ Statistiklief. 1')
     A            SKKZI2         1A         COLHDG('KZ Statistiklief. 2')
     A            SKKZI3         1A         COLHDG('KZ Statistiklief. 3')
     A            SKKZBB         1A         COLHDG('KZ Bundes-Betriebsn.')
     A            SKKZBS         1A         COLHDG('KZ Betriebsstättenn.')
     A            SKKZUL         1A         COLHDG('KZ USt Landeskennz.')
     A            SKKZUI         1A         COLHDG('KZ USt Identnummer')
     A            SKKZIP         1A         COLHDG('KZ USt Id geprüft')
     A            SKKZID         1A         COLHDG('KZ USt Id geprüft am')
     A            SKKZZE         1A         COLHDG('KZ Zahlungsempfänger')
     A            SKKZME         1A         COLHDG('KZ Mahnempfänger')
     A            SKKZVT         1A         COLHDG('KZ Vertreter')
     A            SKKZEP         1A         COLHDG('KZ Einzugempfänger')
     A            SKKZKV         1A         COLHDG('KZ KVZiel')
     A            SKKZIL         1A         COLHDG('KZ ILN')
     A            SKKZIB         1A         COLHDG('KZ IBAN')
     A            SKKZEU         1A         COLHDG('KZ Euro Datum')
     A*-------------------------------------------------------------------------
     A            FKKZFS         1A         COLHDG('KZ Ford.sammelkto.')
     A            FKKZSK         1A         COLHDG('KZ Sammelkontoschl.')
     A            FKKZBL         1A         COLHDG('KZ Bankland')
     A            FKKZBZ         1A         COLHDG('KZ Bankleitzahl')
     A            FKKZKT         1A         COLHDG('KZ Bankkonto')
     A            FKKZBN         1A         COLHDG('KZ Banknr.')
     A            FKKZAZ         1A         COLHDG('KZ AZVVORBSL-PR')
     A            FKKZEZ         1A         COLHDG('KZ Einzugsart')
     A            FKKZZB         1A         COLHDG('KZ ZVK SaBe')
     A            FKKZBS         1A         COLHDG('KZ Bankeinz. SaBe')
     A            FKKZST         1A         COLHDG('KZ Skontoleranztage')
     A            FKKZRK         1A         COLHDG('KZ RefKto')
     A            FKKZVR         1A         COLHDG('KZ Verrechnungskz.')
     A            FKKZZA         1A         COLHDG('KZ Zahlart')
     A            FKKZZK         1A         COLHDG('KZ Zahlkennzeichen')
     A            FKKZMA         1A         COLHDG('KZ Mahnkennzeichen')
     A            FKKZMS         1A         COLHDG('KZ Mahnsachbearbeit.')
     A            FKKZMG         1A         COLHDG('KZ Mahngruppe')
     A            FKKZMV         1A         COLHDG('KZ MAHNVBDKZ-PR')
     A            FKKZBV         1A         COLHDG('KZ BEVBDKZ-PR')
     A            FKKZZI         1A         COLHDG('KZ Zinsrechnungkz.')
     A            FKKZZT         1A         COLHDG('KZ zinsfreie Tage')
     A            FKKZSB         1A         COLHDG('KZ Sachbearbeiter')
     A            FKKZNB         1A         COLHDG('KZ Nettobuchkz')
     A            FKKZBK         1A         COLHDG('KZ Meldg.bei Bchg.Kz')
     A            FKKZTX         1A         COLHDG('KZ Meldungtextschl.')
     A            FKKZAP         1A         COLHDG('KZ bebuchen ab Peri.')
     A            FKKZBP         1A         COLHDG('KZ bebuchen bis Peri')
     A            FKKZBE         1A         COLHDG('KZ VWZSLBE-PR')
     A            FKKZZV         1A         COLHDG('KZ VWZSLZV-PR')
     A            FKKZDK         1A         COLHDG('KZ DELCREDPROZ-PR')
     A            FKKZDB         1A         COLHDG('KZ DELCREDBRT')
     A            FKKZRL         1A         COLHDG('KZ REListDR')
     A            FKKZEL         1A         COLHDG('KZ EINZUGERLKZ-PR')
     A            FKKZRF         1A         COLHDG('KZ REFFIRMA-PR')
     A            FKKZBG         1A         COLHDG('KZ BEBGLSCHRKZ-PR')
     A            FKKZZS         1A         COLHDG('KZ ZVBGLSCHRKZ-PR')
     A            FKKZVB         1A         COLHDG('KZ VBDREGNR-PR')
     A            FKKZSR         1A         COLHDG('KZ STDRNR-PR')
     A            FKKZKN         1A         COLHDG('KZ KONDSCHEMA-PR')
     A            FKKZBC         1A         COLHDG('KZ BIC-PR')
     A            FKFIL6        48A         COLHDG('Leerfeld 6')
     A            FKFIL7        64A         COLHDG('Leerfeld 7')
     A            FKKZBO         1A         COLHDG('KZ BOKZ-PR')
     A            FKKZLC         1A         COLHDG('KZ LCRKZ-PR')
     A            FKKZSC         1A         COLHDG('KZ SCHECKKZ-PR')
     A            FKKZUW         1A         COLHDG('KZ UBWKZ-PR')
     A            FKKZES         1A         COLHDG('KZ ESRREFFMT-PR')
     A            FKKZTN         1A         COLHDG('KZ TEILNNR-PR')
     A            FKKZID         1A         COLHDG('KZ KDIDNR-PR')
     A            FKKZPK         1A         COLHDG('KZ POSCHKTO-PR')
     A            FKKZPB         1A         COLHDG('KZ POSCHKTOBK-PR')
     A            FKKZSL         1A         COLHDG('KZ SADLAND-PR PIC')
     A            FKKZPA         1A         COLHDG('KZ POSCHKTOAUSL-PR')
     A            FKKZEM         1A         COLHDG('KZ EMPFKENNUNG-PR')
     A            FKFIL4        52A         COLHDG('Leerfeld 4')
