     A**************************************************************************
     A*  Copyright 2001 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Schnittstelle Boll/Unitrans                                           *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 27.07.2011                                               *
     A*                                                                        *
     A**************************************************************************
     A          R HEL60R1                   PFILE(SPED60)
     A*-------------------------------------------------------------------------
     A          K HEL020
