     A**************************************************************************
     A*  Copyright 2001 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------- *
     A*  Schnittstellendatei Hamacher                                          *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 31.07.2014                                               *
     A*                                                                        *
     A**************************************************************************
     A          R SPED201
     A*-------------------------------------------------------------------------
     A            S20010         1A         TEXT('SATZART')
     A                                      COLHDG('SA')
     A            S20020        15A         TEXT('AUFTRAGSBEZEICHNUNG')
     A                                      COLHDG('AUFTRAG')
     A            S20030        25A         TEXT('ABSENDER NAME 1')
     A                                      COLHDG('A-NAME 1')
     A            S20040        25A         TEXT('ABSENDER NAME 2')
     A                                      COLHDG('A-NAME 2')
     A            S20050        25A         TEXT('ABSENDER STRASSE')
     A                                      COLHDG('A-STRASSE')
     A            S20060         3A         TEXT('ABSENDER LKZ')
     A                                      COLHDG('A-LKZ')
     A            S20070         6A         TEXT('ABSENDER PLZ')
     A                                      COLHDG('A-PLZ')
     A            S20080        25A         TEXT('ABSENDER ORT')
     A                                      COLHDG('A-ORT')
     A            S20090         6A         TEXT('KUNDENNUMMER')
     A                                      COLHDG('KUNDE')
     A            S20100        10A         TEXT('FILLER')
     A                                      COLHDG('FILLER')
     A            S20110         1A         TEXT('STATUS')
     A                                      COLHDG('STATUS')
     A            S20120        25A         TEXT('EMPFÄNGER-NAME-1')
     A                                      COLHDG('E-NAME 1')
     A            S20130        25A         TEXT('EMPFÄNGER-NAME-2')
     A                                      COLHDG('E-NAME 2')
     A            S20140        25A         TEXT('EMPFÄNGER STRASSE')
     A                                      COLHDG('E-STRASSE')
     A            S20150         3A         TEXT('EMPFÄNGER LKZ')
     A                                      COLHDG('E-LKZ')
     A            S20160         6A         TEXT('EMPFÄNGER-PLZ')
     A                                      COLHDG('E-PLZ')
     A            S20170        25A         TEXT('EMPFÄNGER ORT')
     A                                      COLHDG('E-ORT')
     A            S20180         8A         TEXT('EMPFÄNGER EIGEN')
     A                                      COLHDG('EMPFÄNGER')
     A            S20190        25A         TEXT('FRACHTZAHLER-NAME-1')
     A                                      COLHDG('F-NAME 1')
     A            S20200        25A         TEXT('FRACHTZAHLER-NAME-2')
     A                                      COLHDG('F-NAME 2')
     A            S20210        25A         TEXT('FRACHTZAHLER-STRASSE')
     A                                      COLHDG('F-STRASSE')
     A            S20220         3A         TEXT('FRACHTZAHLER-LKZ')
     A                                      COLHDG('F-LKZ')
     A            S20230         5S 0       TEXT('FRACHTZAHLER-PLZ')
     A                                      COLHDG('F-PLZ')
     A            S20240        25A         TEXT('FRACHTZAHLER-ORT')
     A                                      COLHDG('F-ORT')
     A            S20250         8S 2       TEXT('WARENWERT/VERSICHERUNGSSUMME')
     A                                      COLHDG('WERT')
     A            S20260         8S 2       TEXT('NACHNAHMEBETRAG')
     A                                      COLHDG('NACHNAHME')
     A            S20270        36A         TEXT('BORDEROTEXT ZUS.INFO SPED.')
     A                                      COLHDG('BORDEROTEXT')
     A            S20280         3S 0       TEXT('TEXTNUMMER 205,301,303,501')
     A                                      COLHDG('TEXTNUMMER')
     A            S20290        20A         TEXT('TEXTZUSATZ DATUM/TELEFON')
     A                                      COLHDG('TEXTZUSATZ')
     A            S20300        32A         TEXT('RECHNUNGSTEXT')
     A                                      COLHDG('RECHNUNGSTEXT')
     A            S20310         5A         TEXT('TOURNUMMER IMMER 099')
     A                                      COLHDG('TOURNUMMER')
     A            S20320         5S 0       TEXT('GEWICHT')
     A                                      COLHDG('GEWICHT')
     A            S20330         6S 0       TEXT('RAUMINHALT N.BEI CBM SPERRE')
     A                                      COLHDG('RAUMINHALT')
     A            S20340         2S 0       TEXT('FRANKATURKENNZEICHEN')
     A                                      COLHDG('FRANKATUR')
     A            S20350        15A         TEXT('ARTNR. 1')
     A                                      COLHDG('ARTNR. 1')
     A            S20360         4S 0       TEXT('ANZ. VP1')
     A                                      COLHDG('ANZ. VP1')
     A            S20370         2A         TEXT('VERP.-SCHL.1')
     A                                      COLHDG('VPS 1')
     A            S20380        12S 3       TEXT('GEWICHT 1')
     A                                      COLHDG('GEW. 1')
     A            S20390        15A         TEXT('ARTNR. 2')
     A                                      COLHDG('ARTNR. 2')
     A            S20400         4S 0       TEXT('ANZ. VP2')
     A                                      COLHDG('ANZ. VP2')
     A            S20410         2A         TEXT('VERP.-SCHL 2')
     A                                      COLHDG('VPS 2')
     A            S20420        12S 3       TEXT('GEWICHT 2')
     A                                      COLHDG('GEW 2')
     A            S20430        15A         TEXT('ARTNR. 3')
     A                                      COLHDG('ARTNR. 3')
     A            S20440         4S 0       TEXT('ANZ. VP3')
     A                                      COLHDG('ANZ. VP3')
     A            S20450         2A         TEXT('VERP.-SCHL 3')
     A                                      COLHDG('VPS 3')
     A            S20460        12S 3       TEXT('GEWICHT 3')
     A                                      COLHDG('GEW 3')
     A            S20470         1A         TEXT('VERSENDEN')
     A                                      COLHDG('J/N')
     A            S20480        20A         TEXT('TELEFONMUMMER AVIS')
     A                                      COLHDG('TEL. AVIS')
     A            S20490        65A         TEXT('VERSANDINFO/ANWEISUNG')
     A                                      COLHDG('VERSANINFO/ANEISUNG')
     A            S20500        65A         TEXT('TEXT 2')
     A                                      COLHDG('TEXT 2')
     A            S20510        65A         TEXT('TEXT 3')
     A                                      COLHDG('TEXT 3')
     A            S20520        65A         TEXT('TEXT 4')
     A                                      COLHDG('TEXT 4')
     A            S20530        65A         TEXT('TEXT 5')
     A                                      COLHDG('TEXT 5')
     A            S20540         8A         TEXT('LIEFERTERMIN JJJJMMTT')
     A                                      COLHDG('LF. TERIMIN')
     A            S20550          Z         TEXT('ZEITSTEMPEL')
