     A**************************************************************************
     A*  Copyright 2013 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Loxx Schnittstelle Sendungsinformationen                              *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 24.04.2013 Projekt 9228                                  *
     A*                                                                        *
     A**************************************************************************
     A          R SPEDK21
     A*-------------------------------------------------------------------------
     A            SPEDK2FELD  1024A
