     A**************************************************************************
     A*  Copyright 2010 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  trans-o-flex Empfangsdatei                                            *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 05.03.2011 Projekt Vertrieb                              *
     A*                                                                        *
     A**************************************************************************
     A          R SPED32R
     A*-------------------------------------------------------------------------
     A            SPED32FELD  1024A
