     A          R SPEDD01
     A            SCH010         1A         TEXT('SATZART')
     A                                      COLHDG('SA')
     A            SCH020        15A         TEXT('REFERENZ')
     A                                      COLHDG('REFERENZ')
     A            SCH030        25A         TEXT('ABSENDER NAME 1')
     A                                      COLHDG('A-NAME 1')
     A            SCH040        25A         TEXT('ABSENDER NAME 2')
     A                                      COLHDG('A-NAME 2')
     A            SCH050        25A         TEXT('ABSENDER STRASSE')
     A                                      COLHDG('A-STRASSE')
     A            SCH060         3A         TEXT('ABSENDER LKZ')
     A                                      COLHDG('A-LKZ')
     A            SCH070         5S 0       TEXT('ABSENDER PLZ')
     A                                      COLHDG('A-PLZ')
     A            SCH080        25A         TEXT('ABSENDER ORT')
     A                                      COLHDG('A-ORT')
     A            SCH090         6A         TEXT('KUNDENNUMMER')
     A                                      COLHDG('KUNDE')
     A            SCH100        10A         TEXT('FILLER')
     A                                      COLHDG('FILLER')
     A            SCH110         1A         TEXT('STATUS')
     A                                      COLHDG('STATUS')
     A            SCH120        25A         TEXT('EMPFÄNGER-NAME-1')
     A                                      COLHDG('E-NAME 1')
     A            SCH130        25A         TEXT('EMPFÄNGER-NAME-2')
     A                                      COLHDG('E-NAME 2')
     A            SCH140        25A         TEXT('EMPFÄNGER STRASSE')
     A                                      COLHDG('E-STRASSE')
     A            SCH150         3A         TEXT('EMPFÄNGER LKZ')
     A                                      COLHDG('E-LKZ')
     A            SCH160         5S 0       TEXT('EMPFÄNGER-PLZ')
     A                                      COLHDG('E-PLZ')
     A            SCH170        25A         TEXT('EMPFÄNGER ORT')
     A                                      COLHDG('E-ORT')
     A            SCH180         8A         TEXT('EMPFÄNGER EIGEN')
     A                                      COLHDG('EMPFÄNGER')
     A            SCH190        25A         TEXT('FRACHTZAHLER-NAME-1')
     A                                      COLHDG('F-NAME 1')
     A            SCH200        25A         TEXT('FRACHTZAHLER-NAME-2')
     A                                      COLHDG('F-NAME 2')
     A            SCH210        25A         TEXT('FRACHTZAHLER-STRASSE')
     A                                      COLHDG('F-STRASSE')
     A            SCH220         3A         TEXT('FRACHTZAHLER-LKZ')
     A                                      COLHDG('F-LKZ')
     A            SCH230         5S 0       TEXT('FRACHTZAHLER-PLZ')
     A                                      COLHDG('F-PLZ')
     A            SCH240        25A         TEXT('FRACHTZAHLER-ORT')
     A                                      COLHDG('F-ORT')
     A            SCH250         8S 2       TEXT('WARENWERT/VERSICHERUNGSSUMME')
     A                                      COLHDG('WERT')
     A            SCH260         8S 2       TEXT('NACHNAHMEBETRAG')
     A                                      COLHDG('NACHNAHME')
     A            SCH270        36A         TEXT('BORDEROTEXT ZUS.INFO SPED.')
     A                                      COLHDG('BORDEROTEXT')
     A            SCH280         3S 0       TEXT('TEXTNUMMER 205,301,303,501')
     A                                      COLHDG('TEXTNUMMER')
     A            SCH290        20A         TEXT('TEXTZUSATZ DATUM/TELEFON')
     A                                      COLHDG('TEXTZUSATZ')
     A            SCH300        32A         TEXT('RECHNUNGSTEXT')
     A                                      COLHDG('RECHNUNGSTEXT')
     A            SCH310         5A         TEXT('TOURNUMMER IMMER 099')
     A                                      COLHDG('TOURNUMMER')
     A            SCH320         5S 0       TEXT('GEWICHT')
     A                                      COLHDG('GEWICHT')
     A            SCH330         6S 0       TEXT('RAUMINHALT N.BEI CBM SPERRE')
     A                                      COLHDG('RAUMINHALT')
     A            SCH340         2S 0       TEXT('FRANKATURKENNZEICHEN')
     A                                      COLHDG('FRANKATUR')
     A            SCH350        15A         TEXT('ZEICHEN 1')
     A                                      COLHDG('ZEICHEN 1')
     A            SCH360         4S 0       TEXT('ANZAHL ETI.')
     A                                      COLHDG('ANZAHL ETI.')
     A            SCH370         2A         TEXT('VERPACKUNGSSCHLÜSSEL 1')
     A                                      COLHDG('VERPACKUNG 1')
     A            SCH380        12A         TEXT('INHALT 1')
     A                                      COLHDG('INHALT 1')
     A            SCH390        15A         TEXT('ZEICHEN 2')
     A                                      COLHDG('ZEICHEN 2')
     A            SCH400         4S 0       TEXT('ANZAHL 2')
     A                                      COLHDG('ANZAHL 2')
     A            SCH410         2A         TEXT('VERPACKUNGSSCHLÜSSEL 2')
     A                                      COLHDG('VERPACKUNG 2')
     A            SCH420        12A         TEXT('INHALT 2')
     A                                      COLHDG('INHALT 2')
     A            SCH430        15A         TEXT('ZEICHEN 3')
     A                                      COLHDG('ZEICHEN 3')
     A            SCH440         4S 0       TEXT('ANZAHL 3')
     A                                      COLHDG('ANZAHL 3')
     A            SCH450         2A         TEXT('VERPACKUNGSSCHLÜSSEL 3')
     A                                      COLHDG('VERPACKUNG 3')
     A            SCH460        12A         TEXT('INHALT 3')
     A                                      COLHDG('INHALT 3')
     A            SCH470         7S 0       TEXT('ILN WAECO')
     A                                      COLHDG('ILN WAECO')
     A            SCH475        25A         TEXT('ILN EMPF.')
     A                                      COLHDG('ILN EMPF.')
     A            SCH480        20A         TEXT('NVE')
     A                                      COLHDG('NVE')
     A            SCH490         4A         TEXT('SHUTTLE')
     A                                      COLHDG('SHUTTLE')
     A            SCH500         8A         TEXT('LEITGEBIET')
     A                                      COLHDG('LEITGEBIET')
     A            SCH510         4A         TEXT('ABSTELLFACH')
     A                                      COLHDG('ABSTELLFACH')
     A            SCH520         1A         TEXT('DRUCKEN J/N')
     A                                      COLHDG('DR. J/N')
     A            SCH530          Z         TEXT('ZEITSTEMPEL')
