     A**************************************************************************
     A*  Copyright 2010 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Schenker Empfangsdatei                                                *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 25.05.2012 Projekt 8390                                  *
     A*  Änderung: SZ 04.07.2012 Projekt 8732 Masse Packstück                  *
     A*                                                                        *
     A**************************************************************************
     A          R SPEDG11
     A*-------------------------------------------------------------------------
     A            SC2010         1A         TEXT('SATZART')
     A                                      COLHDG('SA')
     A            SC2020        15A         TEXT('REFERENZ')
     A                                      COLHDG('REFERENZ')
     A            SC2030        25A         TEXT('ABSENDER NAME 1')
     A                                      COLHDG('A-NAME 1')
     A            SC2040        25A         TEXT('ABSENDER NAME 2')
     A                                      COLHDG('A-NAME 2')
     A            SC2050        25A         TEXT('ABSENDER STRASSE')
     A                                      COLHDG('A-STRASSE')
     A            SC2060         3A         TEXT('ABSENDER LKZ')
     A                                      COLHDG('A-LKZ')
     A            SC2070        10A         TEXT('ABSENDER PLZ')
     A                                      COLHDG('A-PLZ')
     A            SC2080        25A         TEXT('ABSENDER ORT')
     A                                      COLHDG('A-ORT')
     A            SC2090         6A         TEXT('KUNDENNUMMER')
     A                                      COLHDG('KUNDE')
     A            SC2100        10A         TEXT('FILLER')
     A                                      COLHDG('FILLER')
     A            SC2110         1A         TEXT('STATUS')
     A                                      COLHDG('STATUS')
     A            SC2120        25A         TEXT('EMPFÄNGER-NAME-1')
     A                                      COLHDG('E-NAME 1')
     A            SC2130        25A         TEXT('EMPFÄNGER-NAME-2')
     A                                      COLHDG('E-NAME 2')
     A            SC2140        25A         TEXT('EMPFÄNGER STRASSE')
     A                                      COLHDG('E-STRASSE')
     A            SC2150         3A         TEXT('EMPFÄNGER LKZ')
     A                                      COLHDG('E-LKZ')
     A            SC2160        10A         TEXT('EMPFÄNGER-PLZ')
     A                                      COLHDG('E-PLZ')
     A            SC2170        25A         TEXT('EMPFÄNGER ORT')
     A                                      COLHDG('E-ORT')
     A            SC2180         8A         TEXT('EMPFÄNGER EIGEN')
     A                                      COLHDG('EMPFÄNGER')
     A            SC2190        25A         TEXT('FRACHTZAHLER-NAME-1')
     A                                      COLHDG('F-NAME 1')
     A            SC2200        25A         TEXT('FRACHTZAHLER-NAME-2')
     A                                      COLHDG('F-NAME 2')
     A            SC2210        25A         TEXT('FRACHTZAHLER-STRASSE')
     A                                      COLHDG('F-STRASSE')
     A            SC2220         3A         TEXT('FRACHTZAHLER-LKZ')
     A                                      COLHDG('F-LKZ')
     A            SC2230        10A         TEXT('FRACHTZAHLER-PLZ')
     A                                      COLHDG('F-PLZ')
     A            SC2240        25A         TEXT('FRACHTZAHLER-ORT')
     A                                      COLHDG('F-ORT')
     A            SC2250         8S 2       TEXT('WARENWERT/VERSICHERUNGSSUMME')
     A                                      COLHDG('WERT')
     A            SC2260         8S 2       TEXT('NACHNAHMEBETRAG')
     A                                      COLHDG('NACHNAHME')
     A            SC2270        36A         TEXT('BORDEROTEXT ZUS.INFO SPED.')
     A                                      COLHDG('BORDEROTEXT')
     A            SC2280         3S 0       TEXT('TEXTNUMMER 205,301,303,501')
     A                                      COLHDG('TEXTNUMMER')
     A            SC2290        20A         TEXT('TEXTZUSATZ DATUM/TELEFON')
     A                                      COLHDG('TEXTZUSATZ')
     A            SC2300        32A         TEXT('RECHNUNGSTEXT')
     A                                      COLHDG('RECHNUNGSTEXT')
     A            SC2310         5A         TEXT('TOURNUMMER IMMER 099')
     A                                      COLHDG('TOURNUMMER')
     A            SC2320         5S 0       TEXT('GEWICHT')
     A                                      COLHDG('GEWICHT')
     A            SC2330         6S 0       TEXT('RAUMINHALT N.BEI CBM SPERRE')
     A                                      COLHDG('RAUMINHALT')
     A            SC2340         2A         TEXT('FRANKATURKENNZEICHEN')
     A                                      COLHDG('FRANKATUR')
     A            SC2350        15A         TEXT('ZEICHEN 1')
     A                                      COLHDG('ZEICHEN 1')
     A            SC2360         4S 0       TEXT('ANZAHL ETI.')
     A                                      COLHDG('ANZAHL ETI.')
     A            SC2370         2A         TEXT('VERPACKUNGSSCHLÜSSEL 1')
     A                                      COLHDG('VERPACKUNG 1')
     A            SC2380        12A         TEXT('INHALT 1')
     A                                      COLHDG('INHALT 1')
     A            SC2390        15A         TEXT('ZEICHEN 2')
     A                                      COLHDG('ZEICHEN 2')
     A            SC2400         4S 0       TEXT('ANZAHL 2')
     A                                      COLHDG('ANZAHL 2')
     A            SC2410         2A         TEXT('VERPACKUNGSSCHLÜSSEL 2')
     A                                      COLHDG('VERPACKUNG 2')
     A            SC2420        12A         TEXT('INHALT 2')
     A                                      COLHDG('INHALT 2')
     A            SC2430        15A         TEXT('ZEICHEN 3')
     A                                      COLHDG('ZEICHEN 3')
     A            SC2440         4S 0       TEXT('ANZAHL 3')
     A                                      COLHDG('ANZAHL 3')
     A            SC2450         2A         TEXT('VERPACKUNGSSCHLÜSSEL 3')
     A                                      COLHDG('VERPACKUNG 3')
     A            SC2460        12A         TEXT('INHALT 3')
     A                                      COLHDG('INHALT 3')
     A            SC2470         7S 0       TEXT('ILN WAECO')
     A                                      COLHDG('ILN WAECO')
     A            SC2475        25A         TEXT('ILN EMPF.')
     A                                      COLHDG('ILN EMPF.')
     A            SC2480        20A         TEXT('NVE')
     A                                      COLHDG('NVE')
     A            SC2490         4A         TEXT('SHUTTLE')
     A                                      COLHDG('SHUTTLE')
     A            SC2500         8A         TEXT('LEITGEBIET')
     A                                      COLHDG('LEITGEBIET')
     A            SC2510         4A         TEXT('ABSTELLFACH')
     A                                      COLHDG('ABSTELLFACH')
     A            SC2520         1A         TEXT('DRUCKEN J/N')
     A                                      COLHDG('DR. J/N')
     A            SC2530         8S 0       TEXT('FIXTERMIN')
     A                                      COLHDG('FIXTERMIN')
     A            SC2540         5A         TEXT('LÄNGE-1')
     A                                      COLHDG('LÄNGE-1')
     A            SC2550         5A         TEXT('BREITE-1')
     A                                      COLHDG('BREITE-1')
     A            SC2560         5A         TEXT('HÖHE-1')
     A                                      COLHDG('HÖHE-1')
     A            SC2570         5A         TEXT('LÄNGE-2')
     A                                      COLHDG('LÄNGE-2')
     A            SC2580         5A         TEXT('BREITE-2')
     A                                      COLHDG('BREITE-2')
     A            SC2590         5A         TEXT('HÖHE-2')
     A                                      COLHDG('HÖHE-2')
     A            SC2600         5A         TEXT('LÄNGE-3')
     A                                      COLHDG('LÄNGE-3')
     A            SC2610         5A         TEXT('BREITE-3')
     A                                      COLHDG('BREITE-3')
     A            SC2620         5A         TEXT('HÖHE-3')
     A                                      COLHDG('HÖHE-3')
     A            SC2630         3A         TEXT('WÄHRUNG')
     A                                      COLHDG('WACD')
