     A**************************************************************************
     A*  Copyright 2010 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Adlatus Empfangsdatei                                                 *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 05.03.2011 Projekt 7190                                  *
     A*                                                                        *
     A**************************************************************************
     A          R SPED72R
     A*-------------------------------------------------------------------------
     A            SPED72FELD  1024A
