     A          R NSE_F0
     A            NSESATZART     1A         TEXT('Satzart')
     A            NSEPRODUKT     3A         TEXT('Produkt-ID')
     A            NSENIEDERL     3A         TEXT('Niederlassung')
     A            NSESTATUS      1A         TEXT('Status')
     A            NSEVDATUM     10A         TEXT('Versanddatum')
     A            NSEKDNR        7A         TEXT('Kundennummer')
     A            NSEREFNR      15A         TEXT('Ihre Referenznummer')
     A            NSEVNAME1     35A         TEXT('Versender-Name-1')
     A            NSEVNAME2     35A         TEXT('Versender-Name-2')
     A            NSEVSTR       35A         TEXT('Versender-Strasse')
     A            NSEVLAND       3A         TEXT('Versender-Land')
     A            NSEVPLZ        9A         TEXT('Versender-Plz')
     A            NSEVORT       35A         TEXT('Versender-Ort')
     A            NSEEKDNR      35A         TEXT('Empfänger-KdNr')
     A            NSEENAME1     35A         TEXT('Empfänger-Name-1')
     A            NSEENAME2     35A         TEXT('Empfänger-Name-2')
     A            NSEESTR       35A         TEXT('Empfänger-Strasse')
     A            NSEELAND       3A         TEXT('Empfänger-Land')
     A            NSEEPLZ        9A         TEXT('Empfänger-Plz')
     A            NSEEORT       35A         TEXT('Empfänger-Ort')
     A            NSEEAP        35A         TEXT('Empfänger-Ansprechpartner')
     A            NSEFNAME1     35A         TEXT('Frachtzahler-Name-1')
     A            NSEFNAME2     35A         TEXT('Frachtzahler-Name-2')
     A            NSEFSTR       35A         TEXT('Frachtzahler-Strasse')
     A            NSEFLAND       3A         TEXT('Frachtzahler-Land')
     A            NSEFPLZ        9A         TEXT('Frachtzahler-Plz')
     A            NSEFORT       35A         TEXT('Frachtzahler-Ort')
     A            NSEFRANKA      2A         TEXT('Frankatur')
     A            NSEANZ1        2A         TEXT('Anzahl-1')
     A            NSEVERP1       2A         TEXT('Verpackung-1')
     A            NSEGEW1        5A         TEXT('Gewicht-1')
     A            NSEWARENI1    20A         TEXT('Wareninhalt-1')
     A            NSEANZ2        2A         TEXT('Anzahl-2')
     A            NSEVERP2       2A         TEXT('Verpackung-2')
     A            NSEGEW2        5A         TEXT('Gewicht-2')
     A            NSEWARENI2    20A         TEXT('Wareninhalt-2')
     A            NSEANZ3        2A         TEXT('Anzahl-3')
     A            NSEVERP3       2A         TEXT('Verpackung-3')
     A            NSEGEW3        5A         TEXT('Gewicht-3')
     A            NSEWARENI3    20A         TEXT('Wareninhalt-3')
     A            NSETEXTNR1     3A         TEXT('Textnummer-1')
     A            NSETEXTZU1    70A         TEXT('Textzusatz-1')
     A            NSETEXTNR2     3A         TEXT('Textnummer-2')
     A            NSETEXTZU2    70A         TEXT('Textzusatz-2')
     A            NSETEXTNR3     3A         TEXT('Textnummer-3')
     A            NSETEXTZU3    70A         TEXT('Textzusatz-3')
     A            NSEWWERT       8A         TEXT('Warenwert')
     A            NSEWAE         3A         TEXT('Währung Warenwert')
     A            NSEVOL         5A         TEXT('Volumen')
     A            NSELADEMTR     3A         TEXT('Lademeter')
     A            NSENNBETR      8A         TEXT('Nachnahmebetrag')
     A            NSEWAENN       3A         TEXT('Währung Nachnahme')
     A            NSEARTNN       1A         TEXT('Art der Nachnahme')
     A            NSEANZLHM      2A         TEXT('Anzahl Ladehilfsmittel')
     A            NSEARTLHM      2A         TEXT('Art der Ladehilfsmittel')
     A            NSEANZBERE     2A         TEXT('Anzahl Berechnungseinheiten')
     A            NSEARTBERE     2A         TEXT('Art der Berechungseinheit')
     A            NSEE_ANR      15A         TEXT('Empf. Auftragsnummer')
     A            NSEE_ADAT     10A         TEXT('Empf. Auftragsdatum')
     A            NSESLID        3A         TEXT('Serviceleistungs-ID')
     A            NSELAE1        5A         TEXT('Länge-1')
     A            NSEBRE1        5A         TEXT('Breite-1')
     A            NSEHOE1        5A         TEXT('Höhe-1')
     A            NSELAE2        5A         TEXT('Länge-2')
     A            NSEBRE2        5A         TEXT('Breite-2')
     A            NSEHOE2        5A         TEXT('Höhe-2')
     A            NSELAE3        5A         TEXT('Länge-3')
     A            NSEBRE3        5A         TEXT('Breite-3')
     A            NSEHOE3        5A         TEXT('Höhe-3')
