     A**************************************************************************
     A*  Copyright 2012 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  BRT Sendungsinformationen                                             *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 30.11.2012 Projekt 9128                                  *
     A*                                                                        *
     A**************************************************************************
     A          R SPEDH21
     A*-------------------------------------------------------------------------
     A            SPEDH2FELD  1024A
