     A          R HCI_F0
     A            HCISATZART     1A         TEXT('Satzart')
     A            HCIPRODUKT     3A         TEXT('Produkt-ID')
     A            HCINIEDERL     3A         TEXT('Niederlassung')
     A            HCISTATUS      1A         TEXT('Status')
     A            HCIVDATUM     10A         TEXT('Versanddatum')
     A            HCIKDNR        7A         TEXT('Kundennummer')
     A            HCIREFNR      15A         TEXT('Ihre Referenznummer')
     A            HCIVNAME1     35A         TEXT('Versender-Name-1')
     A            HCIVNAME2     35A         TEXT('Versender-Name-2')
     A            HCIVSTR       35A         TEXT('Versender-Strasse')
     A            HCIVLAND       3A         TEXT('Versender-Land')
     A            HCIVPLZ        9A         TEXT('Versender-Plz')
     A            HCIVORT       35A         TEXT('Versender-Ort')
     A            HCIEKDNR      35A         TEXT('Empfänger-KdNr')
     A            HCIENAME1     35A         TEXT('Empfänger-Name-1')
     A            HCIENAME2     35A         TEXT('Empfänger-Name-2')
     A            HCIESTR       35A         TEXT('Empfänger-Strasse')
     A            HCIELAND       3A         TEXT('Empfänger-Land')
     A            HCIEPLZ        9A         TEXT('Empfänger-Plz')
     A            HCIEORT       35A         TEXT('Empfänger-Ort')
     A            HCIEAP        35A         TEXT('Empfänger-Ansprechpartner')
     A            HCIFNAME1     35A         TEXT('Frachtzahler-Name-1')
     A            HCIFNAME2     35A         TEXT('Frachtzahler-Name-2')
     A            HCIFSTR       35A         TEXT('Frachtzahler-Strasse')
     A            HCIFLAND       3A         TEXT('Frachtzahler-Land')
     A            HCIFPLZ        9A         TEXT('Frachtzahler-Plz')
     A            HCIFORT       35A         TEXT('Frachtzahler-Ort')
     A            HCIFRANKA      2A         TEXT('Frankatur')
     A            HCIANZ1        2A         TEXT('Anzahl-1')
     A            HCIVERP1       2A         TEXT('Verpackung-1')
     A            HCIGEW1        5A         TEXT('Gewicht-1')
     A            HCIWARENI1    20A         TEXT('Wareninhalt-1')
     A            HCIANZ2        2A         TEXT('Anzahl-2')
     A            HCIVERP2       2A         TEXT('Verpackung-2')
     A            HCIGEW2        5A         TEXT('Gewicht-2')
     A            HCIWARENI2    20A         TEXT('Wareninhalt-2')
     A            HCIANZ3        2A         TEXT('Anzahl-3')
     A            HCIVERP3       2A         TEXT('Verpackung-3')
     A            HCIGEW3        5A         TEXT('Gewicht-3')
     A            HCIWARENI3    20A         TEXT('Wareninhalt-3')
     A            HCITEXTNR1     3A         TEXT('Textnummer-1')
     A            HCITEXTZU1    70A         TEXT('Textzusatz-1')
     A            HCITEXTNR2     3A         TEXT('Textnummer-2')
     A            HCITEXTZU2    70A         TEXT('Textzusatz-2')
     A            HCITEXTNR3     3A         TEXT('Textnummer-3')
     A            HCITEXTZU3    70A         TEXT('Textzusatz-3')
     A            HCIWWERT       8A         TEXT('Warenwert')
     A            HCIWAE         3A         TEXT('Währung Warenwert')
     A            HCIVOL         5A         TEXT('Volumen')
     A            HCILADEMTR     3A         TEXT('Lademeter')
     A            HCINNBETR      8A         TEXT('Nachnahmebetrag')
     A            HCIWAENN       3A         TEXT('Währung Nachnahme')
     A            HCIARTNN       1A         TEXT('Art der Nachnahme')
     A            HCIANZLHM      2A         TEXT('Anzahl Ladehilfsmittel')
     A            HCIARTLHM      2A         TEXT('Art der Ladehilfsmittel')
     A            HCIANZBERE     2A         TEXT('Anzahl Berechnungseinheiten')
     A            HCIARTBERE     2A         TEXT('Art der Berechungseinheit')
     A            HCIE_ANR      15A         TEXT('Empf. Auftragsnummer')
     A            HCIE_ADAT     10A         TEXT('Empf. Auftragsdatum')
     A            HCISLID        3A         TEXT('Serviceleistungs-ID')
     A            HCILAE1        5A         TEXT('Länge-1')
     A            HCIBRE1        5A         TEXT('Breite-1')
     A            HCIHOE1        5A         TEXT('Höhe-1')
     A            HCILAE2        5A         TEXT('Länge-2')
     A            HCIBRE2        5A         TEXT('Breite-2')
     A            HCIHOE2        5A         TEXT('Höhe-2')
     A            HCILAE3        5A         TEXT('Länge-3')
     A            HCIBRE3        5A         TEXT('Breite-3')
     A            HCIHOE3        5A         TEXT('Höhe-3')
     A            HCITSTP         Z         TEXT('Zeitstempel')
