     A**************************************************************************
     A*  Copyright 2010 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Boll/Unitrans Empfangsdatei                                           *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 05.03.2011 Projekt 7190                                  *
     A*                                                                        *
     A**************************************************************************
     A          R SPED62R
     A*-------------------------------------------------------------------------
     A            SPED62FELD  1024A
