     A**************************************************************************
     A*  Copyright 2012 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  BRT Italien Sammeldatei Sendungen Sicherung                           *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 31.07.2014                                               *
     A*                                                                        *
     A**************************************************************************
     A          R SPEDH01
     A*-------------------------------------------------------------------------
     A            BRT010         1A         TEXT('SATZART')
     A                                      COLHDG('SA')
     A            BRT020        15A         TEXT('REFERENZ')
     A                                      COLHDG('REFERENZ')
     A            BRT030        30A         TEXT('ABSENDER NAME 1')
     A                                      COLHDG('A-NAME 1')
     A            BRT040        30A         TEXT('ABSENDER NAME 2')
     A                                      COLHDG('A-NAME 2')
     A            BRT050        30A         TEXT('ABSENDER STRASSE')
     A                                      COLHDG('A-STRASSE')
     A            BRT060         3A         TEXT('ABSENDER LKZ')
     A                                      COLHDG('A-LKZ')
     A            BRT070        10A         TEXT('ABSENDER PLZ')
     A                                      COLHDG('A-PLZ')
     A            BRT080        30A         TEXT('ABSENDER ORT')
     A                                      COLHDG('A-ORT')
     A            BRT090        10A         TEXT('KUNDENNUMMER')
     A                                      COLHDG('KUNDE')
     A            BRT110         1A         TEXT('STATUS')
     A                                      COLHDG('STATUS')
     A            BRT120        30A         TEXT('EMPFÄNGER-NAME-1')
     A                                      COLHDG('E-NAME 1')
     A            BRT130        30A         TEXT('EMPFÄNGER-NAME-2')
     A                                      COLHDG('E-NAME 2')
     A            BRT140        30A         TEXT('EMPFÄNGER STRASSE')
     A                                      COLHDG('E-STRASSE')
     A            BRT150         3A         TEXT('EMPFÄNGER LKZ')
     A                                      COLHDG('E-LKZ')
     A            BRT160        10A         TEXT('EMPFÄNGER-PLZ')
     A                                      COLHDG('E-PLZ')
     A            BRT170        30A         TEXT('EMPFÄNGER ORT')
     A                                      COLHDG('E-ORT')
     A            BRT180        10A         TEXT('EMPFÄNGER EIGEN')
     A                                      COLHDG('EMPFÄNGER')
     A            BRT190        30A         TEXT('FRACHTZAHLER-NAME-1')
     A                                      COLHDG('F-NAME 1')
     A            BRT200        30A         TEXT('FRACHTZAHLER-NAME-2')
     A                                      COLHDG('F-NAME 2')
     A            BRT210        30A         TEXT('FRACHTZAHLER-STRASSE')
     A                                      COLHDG('F-STRASSE')
     A            BRT220         3A         TEXT('FRACHTZAHLER-LKZ')
     A                                      COLHDG('F-LKZ')
     A            BRT230        10A         TEXT('FRACHTZAHLER-PLZ')
     A                                      COLHDG('F-PLZ')
     A            BRT240        30A         TEXT('FRACHTZAHLER-ORT')
     A                                      COLHDG('F-ORT')
     A            BRT250         8S 2       TEXT('WARENWERT/VERSICHERUNGSSUMME')
     A                                      COLHDG('WERT')
     A            BRT260         8S 2       TEXT('NACHNAHMEBETRAG')
     A                                      COLHDG('NACHNAHME')
     A            BRT270        36A         TEXT('BORDEROTEXT ZUS.INFO SPED.')
     A                                      COLHDG('BORDEROTEXT')
     A            BRT280         3S 0       TEXT('FREIFELD')
     A                                      COLHDG('FREIFELD')
     A            BRT290        20A         TEXT('FREIFELD')
     A                                      COLHDG('FREIFELD')
     A            BRT300        32A         TEXT('RECHNUNGSTEXT')
     A                                      COLHDG('RECHNUNGSTEXT')
     A            BRT310         5A         TEXT('TOURNUMMER')
     A                                      COLHDG('TOUR')
     A            BRT320         5S 0       TEXT('GEWICHT')
     A                                      COLHDG('GEWICHT')
     A            BRT330         6S 0       TEXT('RAUMINHALT N.BEI CBM SPERRE')
     A                                      COLHDG('RAUMINHALT')
     A            BRT340         2A         TEXT('FRANKATURKENNZEICHEN')
     A                                      COLHDG('FRANKATUR')
     A            BRT350        15A         TEXT('ZEICHEN 1')
     A                                      COLHDG('ZEICHEN 1')
     A            BRT360         4S 0       TEXT('ANZAHL ETI.')
     A                                      COLHDG('ANZAHL ETI.')
     A            BRT370         2A         TEXT('VERPACKUNGSSCHLÜSSEL 1')
     A                                      COLHDG('VERPACKUNG 1')
     A            BRT380        12A         TEXT('INHALT 1')
     A                                      COLHDG('INHALT 1')
     A            BRT390        15A         TEXT('ZEICHEN 2')
     A                                      COLHDG('ZEICHEN 2')
     A            BRT400         4S 0       TEXT('ANZAHL 2')
     A                                      COLHDG('ANZAHL 2')
     A            BRT410         2A         TEXT('VERPACKUNGSSCHLÜSSEL 2')
     A                                      COLHDG('VERPACKUNG 2')
     A            BRT420        12A         TEXT('INHALT 2')
     A                                      COLHDG('INHALT 2')
     A            BRT430        15A         TEXT('ZEICHEN 3')
     A                                      COLHDG('ZEICHEN 3')
     A            BRT440         4S 0       TEXT('ANZAHL 3')
     A                                      COLHDG('ANZAHL 3')
     A            BRT450         2A         TEXT('VERPACKUNGSSCHLÜSSEL 3')
     A                                      COLHDG('VERPACKUNG 3')
     A            BRT460        12A         TEXT('INHALT 3')
     A                                      COLHDG('INHALT 3')
     A            BRT470         7S 0       TEXT('ILN WAECO')
     A                                      COLHDG('ILN WAECO')
     A            BRT475        25A         TEXT('ILN EMPF.')
     A                                      COLHDG('ILN EMPF.')
     A            BRT480        20A         TEXT('NVE')
     A                                      COLHDG('NVE')
     A            BRT490         4A         TEXT('SHUTTLE')
     A                                      COLHDG('SHUTTLE')
     A            BRT500         8A         TEXT('LEITGEBIET')
     A                                      COLHDG('LEITGEBIET')
     A            BRT510         4A         TEXT('ABSTELLFACH')
     A                                      COLHDG('ABSTELLFACH')
     A            BRT520         1A         TEXT('DRUCKEN J/N')
     A                                      COLHDG('DR. J/N')
     A            BRT530         8S 0       TEXT('FIXTERMIN')
     A                                      COLHDG('FIXTERMIN')
     A            BRT540         5A         TEXT('LÄNGE-1')
     A                                      COLHDG('LÄNGE-1')
     A            BRT550         5A         TEXT('BREITE-1')
     A                                      COLHDG('BREITE-1')
     A            BRT560         5A         TEXT('HÖHE-1')
     A                                      COLHDG('HÖHE-1')
     A            BRT570         5A         TEXT('LÄNGE-2')
     A                                      COLHDG('LÄNGE-2')
     A            BRT580         5A         TEXT('BREITE-2')
     A                                      COLHDG('BREITE-2')
     A            BRT590         5A         TEXT('HÖHE-2')
     A                                      COLHDG('HÖHE-2')
     A            BRT600         5A         TEXT('LÄNGE-3')
     A                                      COLHDG('LÄNGE-3')
     A            BRT610         5A         TEXT('BREITE-3')
     A                                      COLHDG('BREITE-3')
     A            BRT620         5A         TEXT('HÖHE-3')
     A                                      COLHDG('HÖHE-3')
     A            BRT630         3A         TEXT('WÄHRUNG')
     A                                      COLHDG('WACD')
     A            BRT640         3A         TEXT('TEXTNUMMER 100,300,301,...')
     A                                      COLHDG('TEXTNR.1')
     A            BRT650        70A         TEXT('TEXTZUSATZ 1')
     A                                      COLHDG('TEXTZUSATZ 1')
     A            BRT660         3A         TEXT('TEXTNUMMER 100,300,301,...')
     A                                      COLHDG('TEXTNR.2')
     A            BRT670        70A         TEXT('TEXTZUSATZ 2')
     A                                      COLHDG('TEXTZUSATZ 2')
     A            BRT680         3A         TEXT('TEXTNUMMER 100,300,301,...')
     A                                      COLHDG('TEXTNR.3')
     A            BRT690        70A         TEXT('TEXTZUSATZ 3')
     A                                      COLHDG('TEXTZUSATZ 3')
     A            BRT700          Z         TEXT('ZEITSTEMPEL')
     A*-------------------------------------------------------------------------
