     A**************************************************************************
     A*  --------------------------------------------------------------------  *
     A*  DPD Schnittstelle                                                     *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 31.07.2014                                               *
     A*                                                                        *
     A**************************************************************************
     A          R DPD00R1
     A*-------------------------------------------------------------------------
     A            DPD010        15A         TEXT('KD.-NR.')
     A            DPD015        35A         TEXT('NAME 1')
     A            DPD020        35A         TEXT('NAME 2')
     A            DPD025        35A         TEXT('NAME 3')
     A            DPD030        35A         TEXT('STRASSE')
     A            DPD035         4A         TEXT('LAND')
     A            DPD040         5S 0       TEXT('PLZ')
     A            DPD045        40A         TEXT('ORT')
     A            DPD050         2S 0       TEXT('PAKETE')
     A            DPD055         8S 0       TEXT('GEWICHT')
     A            DPD060        10A         TEXT('DATUM')
     A            DPD065        15A         TEXT('LIEFERSCHEIN')
     A            DPD070        15A         TEXT('RECHNUNG')
     A            DPD075         6S 0       TEXT('PACKSTÜCK')
     A            DPD080        10S 0       TEXT('NACHNAHME BETRAG')
     A            DPD085         8A         TEXT('WÄHRUNG')
     A            DPD090        15A         TEXT('ZAHLUNGSART')
     A            DPD095        30A         TEXT('VERW.ZWECK')
     A            DPD100        30A         TEXT('TELEFON')
     A            DPD105        30A         TEXT('TELEFAX')
     A            DPD110         1S 0       TEXT('PAKETSCHEINART')
     A            DPD115         8S 0       TEXT('GEWICHT 2')
     A            DPD120         8S 0       TEXT('GEWICHT 3')
     A            DPD125         8S 0       TEXT('GEWICHT 4')
     A            DPD130         8S 0       TEXT('GEWICHT 5')
     A            DPD135         8S 0       TEXT('GEWICHT 6')
     A            DPD140         8S 0       TEXT('GEWICHT 7')
     A            DPD145         8S 0       TEXT('GEWICHT 8')
     A            DPD150         8S 0       TEXT('GEWICHT 9')
     A            DPD155         8S 0       TEXT('GEWICHT 10')
     A            DPD160         8S 0       TEXT('GEWICHT 11')
     A            DPD165         8S 0       TEXT('GEWICHT 12')
     A            DPD170         8S 0       TEXT('GEWICHT 13')
     A            DPD175         8S 0       TEXT('GEWICHT 14')
     A            DPD180         8S 0       TEXT('GEWICHT 15')
     A            DPD185         8S 0       TEXT('GEWICHT 16')
     A            DPD190         8S 0       TEXT('GEWICHT 17')
     A            DPD195         8S 0       TEXT('GEWICHT 18')
     A            DPD200         8S 0       TEXT('GEWICHT 19')
     A            DPD205         8S 0       TEXT('GEWICHT 20')
     A            DPD210        10S 0       TEXT('NACHN.BETRAG 2')
     A            DPD215        10S 0       TEXT('NACHN.BETRAG 3')
     A            DPD220        10S 0       TEXT('NACHN.BETRAG 4')
     A            DPD225        10S 0       TEXT('NACHN.BETRAG 5')
     A            DPD230        10S 0       TEXT('NACHN.BETRAG 6')
     A            DPD235        10S 0       TEXT('NACHN.BETRAG 7')
     A            DPD240        10S 0       TEXT('NACHN.BETRAG 8')
     A            DPD245        10S 0       TEXT('NACHN.BETRAG 9')
     A            DPD250        10S 0       TEXT('NACHN.BETRAG 10')
     A            DPD255        10S 0       TEXT('NACHN.BETRAG 11')
     A            DPD260        10S 0       TEXT('NACHN.BETRAG 12')
     A            DPD265        10S 0       TEXT('NACHN.BETRAG 13')
     A            DPD270        10S 0       TEXT('NACHN.BETRAG 14')
     A            DPD275        10S 0       TEXT('NACHN.BETRAG 15')
     A            DPD280        10S 0       TEXT('NACHN.BETRAG 16')
     A            DPD285        10S 0       TEXT('NACHN.BETRAG 17')
     A            DPD290        10S 0       TEXT('NACHN.BETRAG 18')
     A            DPD295        10S 0       TEXT('NACHN.BETRAG 19')
     A            DPD300        10S 0       TEXT('NACHN.BETRAG 20')
     A            DPD305         2S 0       TEXT('ZUSTELLUNGSZEIT')
     A            DPD310         3A         TEXT('DRINGLK.STUFE')
     A            DPD315        10A         TEXT('KOSTENSTELLE')
     A            DPD320        35A         TEXT('FREIFELD 1')
     A            DPD325        35A         TEXT('FREIFELD 2')
     A            DPD330        35A         TEXT('FREIFELD 3')
     A            DPD335       200A         TEXT('INHALT')
     A            DPD340         4A         TEXT('UN NR GGS1')
     A            DPD345         5A         TEXT('KLASSE GGS1')
     A            DPD350         5A         TEXT('CODE GGS1')
     A            DPD355         5A         TEXT('VP GRP GGS1')
     A            DPD360         2A         TEXT('VP ART GGS1')
     A            DPD365         8S 0       TEXT('GEWICHT GGS1')
     A            DPD370         8S 0       TEXT('NEM GEW GGS1')
     A            DPD375        60A         TEXT('STOFFNAME GGS1')
     A            DPD380        25A         TEXT('ZUSATZ GGS1')
     A            DPD385         4S 0       TEXT('FAKTOR GGS1')
     A            DPD390         4A         TEXT('UN NR GGS2')
     A            DPD395         5A         TEXT('KLASSE GGS2')
     A            DPD400         5A         TEXT('CODE GGS2')
     A            DPD405         5A         TEXT('VP GRP GGS2')
     A            DPD410         2A         TEXT('VP ART GGS2')
     A            DPD415         8S 0       TEXT('GEWICHT GGS2')
     A            DPD420         8S 0       TEXT('NEM GEW GGS2')
     A            DPD425        60A         TEXT('STOFFNAME GGS2')
     A            DPD430        25A         TEXT('ZUSATZ GGS2')
     A            DPD435         4S 0       TEXT('FAKTOR GGS2')
     A            DPD440         4A         TEXT('UN NR GGS3')
     A            DPD445         5A         TEXT('KLASSE GGS3')
     A            DPD450         5A         TEXT('CODE GGS3')
     A            DPD455         5A         TEXT('VP GRP GGS3')
     A            DPD460         2A         TEXT('VP ART GGS3')
     A            DPD465         8S 0       TEXT('GEWICHT GGS3')
     A            DPD470         8S 0       TEXT('NEM GEW GGS3')
     A            DPD475        60A         TEXT('STOFFNAME GGS3')
     A            DPD480        25A         TEXT('ZUSATZ GGS3')
     A            DPD485         4S 0       TEXT('FAKTOR GGS3')
     A            DPD490        15A         TEXT('NEUTRAL KDNR')
     A            DPD495        35A         TEXT('NEUTRAL NAME 1')
     A            DPD500        35A         TEXT('NEUTRAL NAME 2' )
     A            DPD505        35A         TEXT('NEUTRAL NAME 3' )
     A            DPD510        35A         TEXT('NEUTRAL STRASSE' )
     A            DPD515         4A         TEXT('NEUTRAL LAND' )
     A            DPD520         5S 0       TEXT('NEUTRAL PLZ' )
     A            DPD525        40A         TEXT('NEUTRAL ORT' )
     A            DPD530        20A         TEXT('NEUTRAL TELEFON' )
     A            DPD535        20A         TEXT('NEUTRAL TELEFAX' )
     A            DPD540        20A         TEXT('EXPRESS PAKET' )
     A            DPD545         2S 0       TEXT('EXPRESS DOKUM' )
     A            DPD550         2S 0       TEXT('EXPRESS WARENSENDG')
     A            DPD555        50A         TEXT('EXPRESS WARENBESCHR')
     A            DPD560        10S 0       TEXT('EXPRESS ZOLLWERT')
     A            DPD565         5A         TEXT('EXPRESS WÄHRUNG')
     A            DPD570         3S 0       TEXT('EXPRESS LÄNGE')
     A            DPD575         3S 0       TEXT('EXPRESS BREITE')
     A            DPD580         3S 0       TEXT('EXPRESS HÖHE')
     A            DPD585        35A         TEXT('EXPRESS Z.HD.')
     A            DPD590          Z         TEXT('ZEITSTEMPEL')
