     A**************************************************************************
     A*  Copyright 2010 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  NightStar Empfangsdatei                                               *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 10.08.2011                                               *
     A*                                                                        *
     A**************************************************************************
     A          R SPEDC2R
     A*-------------------------------------------------------------------------
     A            SPEDC2KDBL    10A         ALWNULL
     A            SPEDC2FR01    10A         ALWNULL
     A            SPEDC2FRAN     2A         ALWNULL
     A            SPEDC2DPDN    20A         ALWNULL
     A            SPEDC2DATE    10A         ALWNULL
     A            SPEDC2GW01    10A         ALWNULL
     A            SPEDC2FR02    10A         ALWNULL
     A            SPEDC2FR03    10A         ALWNULL
     A            SPEDC2FR04    10A         ALWNULL
     A            SPEDC2ANZA     2A         ALWNULL
     A            SPEDC2VPCD     2A         ALWNULL
     A            SPEDC2GW02     8A         ALWNULL
     A            SPEDC2PAKN    20A         ALWNULL
     A            SPEDC2FR05    10A         ALWNULL
