     A**************************************************************************
     A*  Copyright 2010 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  DPD Empfangsdatei                                                     *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 05.03.2011 Projekt 7190                                  *
     A*                                                                        *
     A**************************************************************************
     A                                      REF(SWMREF)
     A          R SPED52R
     A*-------------------------------------------------------------------------
     A            SPED52KDNRR               REFFLD(##KDNR)
     A            SPED52NAM1R               REFFLD(##NAM1)
     A            SPED52NAM2R               REFFLD(##NAM2)
     A            SPED52NAM3R               REFFLD(##NAM3)
     A            SPED52STRAR               REFFLD(##STRA)
     A            SPED52POLDR               REFFLD(##POLD)
     A            SPED52POLZR               REFFLD(##POLZ)
     A            SPED52WORTR               REFFLD(##WORT)
     A            SPED52ANZA     2S 0       COLHDG('Pakete')
     A            SPED52GEWIR       2       REFFLD(##GEWI)
     A            SPED52DATER   10A         REFFLD(##DATE)
     A            SPED52REFN    15A         COLHDG('Referenz')
     A            SPED52RGNRR               REFFLD(##RGNR)
     A            SPED52PKST     2S 0       COLHDG('Packstk.')
     A            SPED52NABT    10A         COLHDG('Nachn.Btrg.')
     A            SPED52WACDR               REFFLD(##WACD)
     A            SPED52ZART    10A         COLHDG('Zahlart')
     A            SPED52VERW    10A         COLHDG('Verwendg.')
     A            SPED52TLNRR               REFFLD(##TLNR)
     A            SPED52TFNRR               REFFLD(##TFNR)
     A            SPED52PKSA    10A         COLHDG('PktSArt.')
     A            SPED52PKTA    10A         COLHDG('Pkt.Art')
     A            SPED52PKN1    20A         COLHDG('Pkt.Nr.1')
     A            SPED52GW02R   10A         REFFLD(##GEWI)
     A            SPED52GW03R   10A         REFFLD(##GEWI)
     A            SPED52GW04R   10A         REFFLD(##GEWI)
     A            SPED52GW05R   10A         REFFLD(##GEWI)
     A            SPED52GW06R   10A         REFFLD(##GEWI)
     A            SPED52GW07R   10A         REFFLD(##GEWI)
     A            SPED52GW08R   10A         REFFLD(##GEWI)
     A            SPED52GW09R   10A         REFFLD(##GEWI)
     A            SPED52GW10R   10A         REFFLD(##GEWI)
     A            SPED52GW11R   10A         REFFLD(##GEWI)
     A            SPED52GW12R   10A         REFFLD(##GEWI)
     A            SPED52GW13R   10A         REFFLD(##GEWI)
     A            SPED52GW14R   10A         REFFLD(##GEWI)
     A            SPED52GW15R   10A         REFFLD(##GEWI)
     A            SPED52GW16R   10A         REFFLD(##GEWI)
     A            SPED52GW17R   10A         REFFLD(##GEWI)
     A            SPED52GW18R   10A         REFFLD(##GEWI)
     A            SPED52GW19R   10A         REFFLD(##GEWI)
     A            SPED52GW20R   10A         REFFLD(##GEWI)
     A            SPED52NB02    10A         COLHDG('Nachn.Btrg.2')
     A            SPED52NB03    10A         COLHDG('Nachn.Btrg.3')
     A            SPED52NB04    10A         COLHDG('Nachn.Btrg.4')
     A            SPED52NB05    10A         COLHDG('Nachn.Btrg.5')
     A            SPED52NB06    10A         COLHDG('Nachn.Btrg.6')
     A            SPED52NB07    10A         COLHDG('Nachn.Btrg.7')
     A            SPED52NB08    10A         COLHDG('Nachn.Btrg.8')
     A            SPED52NB09    10A         COLHDG('Nachn.Btrg.9')
     A            SPED52NB10    10A         COLHDG('Nachn.Btrg.10')
     A            SPED52NB11    10A         COLHDG('Nachn.Btrg.11')
     A            SPED52NB12    10A         COLHDG('Nachn.Btrg.12')
     A            SPED52NB13    10A         COLHDG('Nachn.Btrg.13')
     A            SPED52NB14    10A         COLHDG('Nachn.Btrg.14')
     A            SPED52NB15    10A         COLHDG('Nachn.Btrg.15')
     A            SPED52NB16    10A         COLHDG('Nachn.Btrg.16')
     A            SPED52NB17    10A         COLHDG('Nachn.Btrg.17')
     A            SPED52NB18    10A         COLHDG('Nachn.Btrg.18')
     A            SPED52NB19    10A         COLHDG('Nachn.Btrg.19')
     A            SPED52NB20    10A         COLHDG('Nachn.Btrg.20')
     A            SPED52ZEIT     8A         COLHDG('Zust.Zeit')
     A            SPED52DRIN    10A         COLHDG('Dringlkeit')
     A            SPED52KSSTR               REFFLD(##KSST)
     A            SPED52FR01    10A         COLHDG('Freifeld01')
     A            SPED52FR02    10A         COLHDG('Freifeld02')
     A            SPED52FR03    10A         COLHDG('Freifeld03')
     A            SPED52FR04    10A         COLHDG('Freifeld04')
     A            SPED52FR05    10A         COLHDG('Freifeld05')
     A            SPED52FR06    10A         COLHDG('Freifeld06')
     A            SPED52FR07    10A         COLHDG('Freifeld07')
     A            SPED52FR08    10A         COLHDG('Freifeld08')
     A            SPED52FR09    10A         COLHDG('Freifeld09')
     A            SPED52FR10    10A         COLHDG('Freifeld10')
     A            SPED52FR11    10A         COLHDG('Freifeld11')
     A            SPED52FR12    10A         COLHDG('Freifeld12')
     A            SPED52FR13    10A         COLHDG('Freifeld13')
     A            SPED52FR14    10A         COLHDG('Freifeld14')
     A            SPED52FR15    10A         COLHDG('Freifeld15')
     A            SPED52FR16    10A         COLHDG('Freifeld16')
     A            SPED52FR17    10A         COLHDG('Freifeld17')
     A            SPED52FR18    10A         COLHDG('Freifeld18')
     A            SPED52FR19    10A         COLHDG('Freifeld19')
     A            SPED52FR20    10A         COLHDG('Freifeld20')
     A            SPED52FR21    10A         COLHDG('Freifeld21')
     A            SPED52FR22    10A         COLHDG('Freifeld22')
     A            SPED52FR23    10A         COLHDG('Freifeld23')
     A            SPED52FR24    10A         COLHDG('Freifeld24')
     A            SPED52FR25    10A         COLHDG('Freifeld25')
     A            SPED52FR26    10A         COLHDG('Freifeld26')
     A            SPED52FR27    10A         COLHDG('Freifeld27')
     A            SPED52FR28    10A         COLHDG('Freifeld28')
     A            SPED52FR29    10A         COLHDG('Freifeld29')
     A            SPED52FR30    10A         COLHDG('Freifeld30')
     A            SPED52FR31    10A         COLHDG('Freifeld31')
     A            SPED52FR32    10A         COLHDG('Freifeld32')
     A            SPED52FR33    10A         COLHDG('Freifeld33')
     A            SPED52FR34    10A         COLHDG('Freifeld34')
     A            SPED52FR35    10A         COLHDG('Freifeld35')
     A            SPED52FR36    10A         COLHDG('Freifeld36')
     A            SPED52FR37    10A         COLHDG('Freifeld37')
     A            SPED52PKN2    20A         COLHDG('Pkt.Nr.2')
     A            SPED52PKN3    20A         COLHDG('Pkt.Nr.3')
     A            SPED52PKN4    20A         COLHDG('Pkt.Nr.4')
     A            SPED52PKN5    20A         COLHDG('Pkt.Nr.5')
     A            SPED52PKN6    20A         COLHDG('Pkt.Nr.6')
     A            SPED52PKN7    20A         COLHDG('Pkt.Nr.7')
     A            SPED52PKN8    20A         COLHDG('Pkt.Nr.8')
     A            SPED52PKN9    20A         COLHDG('Pkt.Nr.9')
     A            SPED52PK10    20A         COLHDG('Pkt.Nr.10')
     A            SPED52PK11    20A         COLHDG('Pkt.Nr.11')
     A            SPED52PK12    20A         COLHDG('Pkt.Nr.12')
     A            SPED52PK13    20A         COLHDG('Pkt.Nr.13')
     A            SPED52PK14    20A         COLHDG('Pkt.Nr.14')
     A            SPED52PK15    20A         COLHDG('Pkt.Nr.15')
     A            SPED52PK16    20A         COLHDG('Pkt.Nr.16')
     A            SPED52PK17    20A         COLHDG('Pkt.Nr.17')
     A            SPED52PK18    20A         COLHDG('Pkt.Nr.18')
     A            SPED52PK19    20A         COLHDG('Pkt.Nr.19')
     A            SPED52PK20    20A         COLHDG('Pkt.Nr.20')
     A            SPED52FR57    10A         COLHDG('Freifeld57')
     A            SPED52FR58    10A         COLHDG('Freifeld58')
     A            SPED52FR59    10A         COLHDG('Freifeld59')
     A            SPED52FR60    10A         COLHDG('Freifeld60')
     A            SPED52FR61    10A         COLHDG('Freifeld61')
     A            SPED52FR62    10A         COLHDG('Freifeld62')
     A            SPED52FR63    10A         COLHDG('Freifeld63')
     A            SPED52FR64    10A         COLHDG('Freifeld64')
     A            SPED52FR65    10A         COLHDG('Freifeld65')
     A            SPED52FR66    10A         COLHDG('Freifeld66')
     A            SPED52FR67    10A         COLHDG('Freifeld67')
     A            SPED52FR68    10A         COLHDG('Freifeld68')
     A            SPED52FR69    10A         COLHDG('Freifeld69')
     A            SPED52FR70    10A         COLHDG('Freifeld70')
     A            SPED52FR71    10A         COLHDG('Freifeld71')
     A            SPED52FR72    10A         COLHDG('Freifeld72')
     A            SPED52FR73    10A         COLHDG('Freifeld73')
     A            SPED52FR74    10A         COLHDG('Freifeld74')
     A            SPED52FR75    10A         COLHDG('Freifeld75')
     A            SPED52FR76    10A         COLHDG('Freifeld76')
     A            SPED52FR77    10A         COLHDG('Freifeld77')
     A            SPED52FR78    10A         COLHDG('Freifeld78')
     A            SPED52FR79    10A         COLHDG('Freifeld79')
     A            SPED52FR80    10A         COLHDG('Freifeld80')
     A            SPED52FR81    10A         COLHDG('Freifeld81')
     A            SPED52FR82    10A         COLHDG('Freifeld82')
     A            SPED52FR83    10A         COLHDG('Freifeld83')
     A            SPED52FR84    10A         COLHDG('Freifeld84')
     A            SPED52FR85    10A         COLHDG('Freifeld85')
     A            SPED52FR86    10A         COLHDG('Freifeld86')
     A            SPED52FR87    10A         COLHDG('Freifeld87')
     A            SPED52FR88    10A         COLHDG('Freifeld88')
     A            SPED52FR89    10A         COLHDG('Freifeld89')
     A            SPED52FR90    10A         COLHDG('Freifeld90')
     A            SPED52FR91    10A         COLHDG('Freifeld91')
     A            SPED52FR92    10A         COLHDG('Freifeld92')
     A            SPED52FR93    10A         COLHDG('Freifeld93')
     A            SPED52FR94    10A         COLHDG('Freifeld94')
     A            SPED52FR95    10A         COLHDG('Freifeld95')
     A            SPED52FR96    10A         COLHDG('Freifeld96')
     A            SPED52FR97    10A         COLHDG('Freifeld97')
     A            SPED52ABS1R               REFFLD(##NAM1)
     A            SPED52ABS2R               REFFLD(##NAM2)
     A            SPED52ABS3R               REFFLD(##NAM3)
     A            SPED52ABS4R               REFFLD(##STRA)
     A            SPED52ABS5R               REFFLD(##POLD)
     A            SPED52ABS6R               REFFLD(##POLZ)
     A            SPED52ABS7R               REFFLD(##WORT)
     A            SPED52ABS8R               REFFLD(##TLNR)
     A            SPED52ABS9R               REFFLD(##TFNR)
     A            SPED52PREI    11S 2       COLHDG('Paketpreis')
