     A**************************************************************************
     A*  Copyright 2012 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Kühne + Nagel Sendungsdaten                                           *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 15.02.2012 Projekt 8260                                  *
     A*  Änderung: SZ 04.07.2012 Projekt 8732 Masse Packstück                  *
     A*                                                                        *
     A**************************************************************************
     A          R SPEDF11
     A*-------------------------------------------------------------------------
     A            KUN010         1A         TEXT('SATZART')
     A                                      COLHDG('SA')
     A            KUN020        15A         TEXT('REFERENZ')
     A                                      COLHDG('REFERENZ')
     A            KUN030        25A         TEXT('ABSENDER NAME 1')
     A                                      COLHDG('A-NAME 1')
     A            KUN040        25A         TEXT('ABSENDER NAME 2')
     A                                      COLHDG('A-NAME 2')
     A            KUN050        25A         TEXT('ABSENDER STRASSE')
     A                                      COLHDG('A-STRASSE')
     A            KUN060         3A         TEXT('ABSENDER LKZ')
     A                                      COLHDG('A-LKZ')
     A            KUN070        10A         TEXT('ABSENDER PLZ')
     A                                      COLHDG('A-PLZ')
     A            KUN080        25A         TEXT('ABSENDER ORT')
     A                                      COLHDG('A-ORT')
     A            KUN090        10A         TEXT('KUNDENNUMMER')
     A                                      COLHDG('KUNDE')
     A            KUN100        10A         TEXT('FILLER')
     A                                      COLHDG('FILLER')
     A            KUN110         1A         TEXT('STATUS')
     A                                      COLHDG('STATUS')
     A            KUN120        25A         TEXT('EMPFÄNGER-NAME-1')
     A                                      COLHDG('E-NAME 1')
     A            KUN130        25A         TEXT('EMPFÄNGER-NAME-2')
     A                                      COLHDG('E-NAME 2')
     A            KUN140        25A         TEXT('EMPFÄNGER STRASSE')
     A                                      COLHDG('E-STRASSE')
     A            KUN150         3A         TEXT('EMPFÄNGER LKZ')
     A                                      COLHDG('E-LKZ')
     A            KUN160        10A         TEXT('EMPFÄNGER-PLZ')
     A                                      COLHDG('E-PLZ')
     A            KUN170        25A         TEXT('EMPFÄNGER ORT')
     A                                      COLHDG('E-ORT')
     A            KUN180         8A         TEXT('EMPFÄNGER EIGEN')
     A                                      COLHDG('EMPFÄNGER')
     A            KUN190        25A         TEXT('FRACHTZAHLER-NAME-1')
     A                                      COLHDG('F-NAME 1')
     A            KUN200        25A         TEXT('FRACHTZAHLER-NAME-2')
     A                                      COLHDG('F-NAME 2')
     A            KUN210        25A         TEXT('FRACHTZAHLER-STRASSE')
     A                                      COLHDG('F-STRASSE')
     A            KUN220         3A         TEXT('FRACHTZAHLER-LKZ')
     A                                      COLHDG('F-LKZ')
     A            KUN230        10A         TEXT('FRACHTZAHLER-PLZ')
     A                                      COLHDG('F-PLZ')
     A            KUN240        25A         TEXT('FRACHTZAHLER-ORT')
     A                                      COLHDG('F-ORT')
     A            KUN250         8S 2       TEXT('WARENWERT/VERSICHERUNGSSUMME')
     A                                      COLHDG('WERT')
     A            KUN260         8S 2       TEXT('NACHNAHMEBETRAG')
     A                                      COLHDG('NACHNAHME')
     A            KUN270        36A         TEXT('BORDEROTEXT ZUS.INFO SPED.')
     A                                      COLHDG('BORDEROTEXT')
     A            KUN280         3S 0       TEXT('TEXTNUMMER 205,301,303,501')
     A                                      COLHDG('TEXTNUMMER')
     A            KUN290        20A         TEXT('TEXTZUSATZ DATUM/TELEFON')
     A                                      COLHDG('TEXTZUSATZ')
     A            KUN300        32A         TEXT('RECHNUNGSTEXT')
     A                                      COLHDG('RECHNUNGSTEXT')
     A            KUN310         5A         TEXT('TOURNUMMER IMMER 099')
     A                                      COLHDG('TOURNUMMER')
     A            KUN320         5S 0       TEXT('GEWICHT')
     A                                      COLHDG('GEWICHT')
     A            KUN330         6S 0       TEXT('RAUMINHALT N.BEI CBM SPERRE')
     A                                      COLHDG('RAUMINHALT')
     A            KUN340         2A         TEXT('FRANKATURKENNZEICHEN')
     A                                      COLHDG('FRANKATUR')
     A            KUN350        15A         TEXT('ZEICHEN 1')
     A                                      COLHDG('ZEICHEN 1')
     A            KUN360         4S 0       TEXT('ANZAHL ETI.')
     A                                      COLHDG('ANZAHL ETI.')
     A            KUN370         2A         TEXT('VERPACKUNGSSCHLÜSSEL 1')
     A                                      COLHDG('VERPACKUNG 1')
     A            KUN380        12A         TEXT('INHALT 1')
     A                                      COLHDG('INHALT 1')
     A            KUN390        15A         TEXT('ZEICHEN 2')
     A                                      COLHDG('ZEICHEN 2')
     A            KUN400         4S 0       TEXT('ANZAHL 2')
     A                                      COLHDG('ANZAHL 2')
     A            KUN410         2A         TEXT('VERPACKUNGSSCHLÜSSEL 2')
     A                                      COLHDG('VERPACKUNG 2')
     A            KUN420        12A         TEXT('INHALT 2')
     A                                      COLHDG('INHALT 2')
     A            KUN430        15A         TEXT('ZEICHEN 3')
     A                                      COLHDG('ZEICHEN 3')
     A            KUN440         4S 0       TEXT('ANZAHL 3')
     A                                      COLHDG('ANZAHL 3')
     A            KUN450         2A         TEXT('VERPACKUNGSSCHLÜSSEL 3')
     A                                      COLHDG('VERPACKUNG 3')
     A            KUN460        12A         TEXT('INHALT 3')
     A                                      COLHDG('INHALT 3')
     A            KUN470         7S 0       TEXT('ILN WAECO')
     A                                      COLHDG('ILN WAECO')
     A            KUN475        25A         TEXT('ILN EMPF.')
     A                                      COLHDG('ILN EMPF.')
     A            KUN480        20A         TEXT('NVE')
     A                                      COLHDG('NVE')
     A            KUN490         4A         TEXT('SHUTTLE')
     A                                      COLHDG('SHUTTLE')
     A            KUN500         8A         TEXT('LEITGEBIET')
     A                                      COLHDG('LEITGEBIET')
     A            KUN510         4A         TEXT('ABSTELLFACH')
     A                                      COLHDG('ABSTELLFACH')
     A            KUN520         1A         TEXT('DRUCKEN J/N')
     A                                      COLHDG('DR. J/N')
     A            KUN530         3A         TEXT('WÄHRUNG')
     A                                      COLHDG('WACD')
     A            KUN540         5A         TEXT('LÄNGE-1')
     A                                      COLHDG('LÄNGE-1')
     A            KUN550         5A         TEXT('BREITE-1')
     A                                      COLHDG('BREITE-1')
     A            KUN560         5A         TEXT('HÖHE-1')
     A                                      COLHDG('HÖHE-1')
     A            KUN570         5A         TEXT('LÄNGE-2')
     A                                      COLHDG('LÄNGE-2')
     A            KUN580         5A         TEXT('BREITE-2')
     A                                      COLHDG('BREITE-2')
     A            KUN590         5A         TEXT('HÖHE-2')
     A                                      COLHDG('HÖHE-2')
     A            KUN600         5A         TEXT('LÄNGE-3')
     A                                      COLHDG('LÄNGE-3')
     A            KUN610         5A         TEXT('BREITE-3')
     A                                      COLHDG('BREITE-3')
     A            KUN620         5A         TEXT('HÖHE-3')
     A                                      COLHDG('HÖHE-3')
