     A**************************************************************************
     A*  Copyright 2013 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------- *
     A*  Schnittstellendatei Parts Express                                     *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 07.02.2013 Projekt 9032                                  *
     A*  Änderung:                                                             *
     A*                                                                        *
     A**************************************************************************
     A          R SPED101
     A*-------------------------------------------------------------------------
     A            S10010         1A         TEXT('SATZART')
     A                                      COLHDG('SA')
     A            S10020        15A         TEXT('AUFTRAGSBEZEICHNUNG')
     A                                      COLHDG('AUFTRAG')
     A            S10030        25A         TEXT('ABSENDER NAME 1')
     A                                      COLHDG('A-NAME 1')
     A            S10040        25A         TEXT('ABSENDER NAME 2')
     A                                      COLHDG('A-NAME 2')
     A            S10050        25A         TEXT('ABSENDER STRASSE')
     A                                      COLHDG('A-STRASSE')
     A            S10060         3A         TEXT('ABSENDER LKZ')
     A                                      COLHDG('A-LKZ')
     A            S10070         6A         TEXT('ABSENDER PLZ')
     A                                      COLHDG('A-PLZ')
     A            S10080        25A         TEXT('ABSENDER ORT')
     A                                      COLHDG('A-ORT')
     A            S10090         6A         TEXT('KUNDENNUMMER')
     A                                      COLHDG('KUNDE')
     A            S10100        10A         TEXT('FILLER')
     A                                      COLHDG('FILLER')
     A            S10110         1A         TEXT('STATUS')
     A                                      COLHDG('STATUS')
     A            S10120        25A         TEXT('EMPFÄNGER-NAME-1')
     A                                      COLHDG('E-NAME 1')
     A            S10130        25A         TEXT('EMPFÄNGER-NAME-2')
     A                                      COLHDG('E-NAME 2')
     A            S10140        25A         TEXT('EMPFÄNGER STRASSE')
     A                                      COLHDG('E-STRASSE')
     A            S10150         3A         TEXT('EMPFÄNGER LKZ')
     A                                      COLHDG('E-LKZ')
     A            S10160         6A         TEXT('EMPFÄNGER-PLZ')
     A                                      COLHDG('E-PLZ')
     A            S10170        25A         TEXT('EMPFÄNGER ORT')
     A                                      COLHDG('E-ORT')
     A            S10180         8A         TEXT('EMPFÄNGER EIGEN')
     A                                      COLHDG('EMPFÄNGER')
     A            S10190        25A         TEXT('FRACHTZAHLER-NAME-1')
     A                                      COLHDG('F-NAME 1')
     A            S10200        25A         TEXT('FRACHTZAHLER-NAME-2')
     A                                      COLHDG('F-NAME 2')
     A            S10210        25A         TEXT('FRACHTZAHLER-STRASSE')
     A                                      COLHDG('F-STRASSE')
     A            S10220         3A         TEXT('FRACHTZAHLER-LKZ')
     A                                      COLHDG('F-LKZ')
     A            S10230         5S 0       TEXT('FRACHTZAHLER-PLZ')
     A                                      COLHDG('F-PLZ')
     A            S10240        25A         TEXT('FRACHTZAHLER-ORT')
     A                                      COLHDG('F-ORT')
     A            S10250         8S 2       TEXT('WARENWERT/VERSICHERUNGSSUMME')
     A                                      COLHDG('WERT')
     A            S10260         8S 2       TEXT('NACHNAHMEBETRAG')
     A                                      COLHDG('NACHNAHME')
     A            S10270        36A         TEXT('BORDEROTEXT ZUS.INFO SPED.')
     A                                      COLHDG('BORDEROTEXT')
     A            S10280         3S 0       TEXT('TEXTNUMMER 205,301,303,501')
     A                                      COLHDG('TEXTNUMMER')
     A            S10290        20A         TEXT('TEXTZUSATZ DATUM/TELEFON')
     A                                      COLHDG('TEXTZUSATZ')
     A            S10300        32A         TEXT('RECHNUNGSTEXT')
     A                                      COLHDG('RECHNUNGSTEXT')
     A            S10310         5A         TEXT('TOURNUMMER IMMER 099')
     A                                      COLHDG('TOURNUMMER')
     A            S10320         5S 0       TEXT('GEWICHT')
     A                                      COLHDG('GEWICHT')
     A            S10330         6S 0       TEXT('RAUMINHALT N.BEI CBM SPERRE')
     A                                      COLHDG('RAUMINHALT')
     A            S10340         2S 0       TEXT('FRANKATURKENNZEICHEN')
     A                                      COLHDG('FRANKATUR')
     A            S10350        15A         TEXT('ARTNR. 1')
     A                                      COLHDG('ARTNR. 1')
     A            S10360         4S 0       TEXT('ANZ. VP1')
     A                                      COLHDG('ANZ. VP1')
     A            S10370         2A         TEXT('VERP.-SCHL.1')
     A                                      COLHDG('VPS 1')
     A            S10380        12S 3       TEXT('GEWICHT 1')
     A                                      COLHDG('GEW. 1')
     A            S10390        15A         TEXT('ARTNR. 2')
     A                                      COLHDG('ARTNR. 2')
     A            S10400         4S 0       TEXT('ANZ. VP2')
     A                                      COLHDG('ANZ. VP2')
     A            S10410         2A         TEXT('VERP.-SCHL 2')
     A                                      COLHDG('VPS 2')
     A            S10420        12S 3       TEXT('GEWICHT 2')
     A                                      COLHDG('GEW 2')
     A            S10430        15A         TEXT('ARTNR. 3')
     A                                      COLHDG('ARTNR. 3')
     A            S10440         4S 0       TEXT('ANZ. VP3')
     A                                      COLHDG('ANZ. VP3')
     A            S10450         2A         TEXT('VERP.-SCHL 3')
     A                                      COLHDG('VPS 3')
     A            S10460        12S 3       TEXT('GEWICHT 3')
     A                                      COLHDG('GEW 3')
     A            S10470         1A         TEXT('VERSENDEN')
     A                                      COLHDG('J/N')
     A            S10480        20A         TEXT('TELEFONMUMMER AVIS')
     A                                      COLHDG('TEL. AVIS')
     A            S10490        65A         TEXT('VERSANDINFO/ANWEISUNG')
     A                                      COLHDG('VERSANINFO/ANEISUNG')
     A            S10500        65A         TEXT('TEXT 2')
     A                                      COLHDG('TEXT 2')
     A            S10510        65A         TEXT('TEXT 3')
     A                                      COLHDG('TEXT 3')
     A            S10520        65A         TEXT('TEXT 4')
     A                                      COLHDG('TEXT 4')
     A            S10530        65A         TEXT('TEXT 5')
     A                                      COLHDG('TEXT 5')
     A            S10540         8A         TEXT('LIEFERTERMIN JJJJMMTT')
     A                                      COLHDG('LF. TERIMIN')
     A*         K S10010
     A          K S10020
