     A**************************************************************************
     A*  Copyright 2013 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Spedition LOXX (Österreich), Sammeldatei Sendungen                    *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 11.03.2013 Projekt 9228                                  *
     A*  Änderung: SZ 22.04.2013 Übernahme Anpassungen TNT (Gewicht)           *
     A*                                                                        *
     A**************************************************************************
     A          R SPEDK01
     A*-------------------------------------------------------------------------
     A            LOX010         1A         TEXT('SATZART')
     A                                      COLHDG('SA')
     A            LOX020        15A         TEXT('REFERENZ')
     A                                      COLHDG('REFERENZ')
     A            LOX030        30A         TEXT('ABSENDER NAME 1')
     A                                      COLHDG('A-NAME 1')
     A            LOX040        30A         TEXT('ABSENDER NAME 2')
     A                                      COLHDG('A-NAME 2')
     A            LOX050        30A         TEXT('ABSENDER STRASSE')
     A                                      COLHDG('A-STRASSE')
     A            LOX060         3A         TEXT('ABSENDER LKZ')
     A                                      COLHDG('A-LKZ')
     A            LOX070        10A         TEXT('ABSENDER PLZ')
     A                                      COLHDG('A-PLZ')
     A            LOX080        30A         TEXT('ABSENDER ORT')
     A                                      COLHDG('A-ORT')
     A            LOX090        10A         TEXT('KUNDENNUMMER')
     A                                      COLHDG('KUNDE')
     A            LOX110         1A         TEXT('STATUS')
     A                                      COLHDG('STATUS')
     A            LOX120        30A         TEXT('EMPFÄNGER-NAME-1')
     A                                      COLHDG('E-NAME 1')
     A            LOX130        30A         TEXT('EMPFÄNGER-NAME-2')
     A                                      COLHDG('E-NAME 2')
     A            LOX140        30A         TEXT('EMPFÄNGER STRASSE')
     A                                      COLHDG('E-STRASSE')
     A            LOX150         3A         TEXT('EMPFÄNGER LKZ')
     A                                      COLHDG('E-LKZ')
     A            LOX160        10A         TEXT('EMPFÄNGER-PLZ')
     A                                      COLHDG('E-PLZ')
     A            LOX170        30A         TEXT('EMPFÄNGER ORT')
     A                                      COLHDG('E-ORT')
     A            LOX180        10A         TEXT('EMPFÄNGER EIGEN')
     A                                      COLHDG('EMPFÄNGER')
     A            LOX190        30A         TEXT('FRACHTZAHLER-NAME-1')
     A                                      COLHDG('F-NAME 1')
     A            LOX200        30A         TEXT('FRACHTZAHLER-NAME-2')
     A                                      COLHDG('F-NAME 2')
     A            LOX210        30A         TEXT('FRACHTZAHLER-STRASSE')
     A                                      COLHDG('F-STRASSE')
     A            LOX220         3A         TEXT('FRACHTZAHLER-LKZ')
     A                                      COLHDG('F-LKZ')
     A            LOX230        10A         TEXT('FRACHTZAHLER-PLZ')
     A                                      COLHDG('F-PLZ')
     A            LOX240        30A         TEXT('FRACHTZAHLER-ORT')
     A                                      COLHDG('F-ORT')
     A            LOX250         8S 2       TEXT('WARENWERT/VERSICHERUNGSSUMME')
     A                                      COLHDG('WERT')
     A            LOX260         8S 2       TEXT('NACHNAHMEBETRAG')
     A                                      COLHDG('NACHNAHME')
     A            LOX270        36A         TEXT('BORDEROTEXT ZUS.INFO SPED.')
     A                                      COLHDG('BORDEROTEXT')
     A            LOX280         3S 0       TEXT('FREIFELD')
     A                                      COLHDG('FREIFELD')
     A            LOX290        20A         TEXT('FREIFELD')
     A                                      COLHDG('FREIFELD')
     A            LOX300        32A         TEXT('RECHNUNGSTEXT')
     A                                      COLHDG('RECHNUNGSTEXT')
     A            LOX310         5A         TEXT('TOURNUMMER')
     A                                      COLHDG('TOUR')
     A            LOX320         8S 3       TEXT('GEWICHT')
     A                                      COLHDG('GEWICHT')
     A            LOX330         6S 0       TEXT('RAUMINHALT N.BEI CBM SPERRE')
     A                                      COLHDG('RAUMINHALT')
     A            LOX340         2A         TEXT('FRANKATURKENNZEICHEN')
     A                                      COLHDG('FRANKATUR')
     A            LOX350        15A         TEXT('ZEICHEN 1')
     A                                      COLHDG('ZEICHEN 1')
     A            LOX360         4S 0       TEXT('ANZAHL ETI.')
     A                                      COLHDG('ANZAHL ETI.')
     A            LOX370         2A         TEXT('VERPACKUNGSSCHLÜSSEL 1')
     A                                      COLHDG('VERPACKUNG 1')
     A            LOX380        12A         TEXT('INHALT 1')
     A                                      COLHDG('INHALT 1')
     A            LOX390        15A         TEXT('ZEICHEN 2')
     A                                      COLHDG('ZEICHEN 2')
     A            LOX400         4S 0       TEXT('ANZAHL 2')
     A                                      COLHDG('ANZAHL 2')
     A            LOX410         2A         TEXT('VERPACKUNGSSCHLÜSSEL 2')
     A                                      COLHDG('VERPACKUNG 2')
     A            LOX420        12A         TEXT('INHALT 2')
     A                                      COLHDG('INHALT 2')
     A            LOX430        15A         TEXT('ZEICHEN 3')
     A                                      COLHDG('ZEICHEN 3')
     A            LOX440         4S 0       TEXT('ANZAHL 3')
     A                                      COLHDG('ANZAHL 3')
     A            LOX450         2A         TEXT('VERPACKUNGSSCHLÜSSEL 3')
     A                                      COLHDG('VERPACKUNG 3')
     A            LOX460        12A         TEXT('INHALT 3')
     A                                      COLHDG('INHALT 3')
     A            LOX470         7S 0       TEXT('ILN WAECO')
     A                                      COLHDG('ILN WAECO')
     A            LOX475        25A         TEXT('ILN EMPF.')
     A                                      COLHDG('ILN EMPF.')
     A            LOX480        20A         TEXT('NVE')
     A                                      COLHDG('NVE')
     A            LOX490         4A         TEXT('SHUTTLE')
     A                                      COLHDG('SHUTTLE')
     A            LOX500         8A         TEXT('LEITGEBIET')
     A                                      COLHDG('LEITGEBIET')
     A            LOX510         4A         TEXT('ABSTELLFACH')
     A                                      COLHDG('ABSTELLFACH')
     A            LOX520         1A         TEXT('DRUCKEN J/N')
     A                                      COLHDG('DR. J/N')
     A            LOX530         8S 0       TEXT('FIXTERMIN')
     A                                      COLHDG('FIXTERMIN')
     A            LOX540         5A         TEXT('LÄNGE-1')
     A                                      COLHDG('LÄNGE-1')
     A            LOX550         5A         TEXT('BREITE-1')
     A                                      COLHDG('BREITE-1')
     A            LOX560         5A         TEXT('HÖHE-1')
     A                                      COLHDG('HÖHE-1')
     A            LOX570         5A         TEXT('LÄNGE-2')
     A                                      COLHDG('LÄNGE-2')
     A            LOX580         5A         TEXT('BREITE-2')
     A                                      COLHDG('BREITE-2')
     A            LOX590         5A         TEXT('HÖHE-2')
     A                                      COLHDG('HÖHE-2')
     A            LOX600         5A         TEXT('LÄNGE-3')
     A                                      COLHDG('LÄNGE-3')
     A            LOX610         5A         TEXT('BREITE-3')
     A                                      COLHDG('BREITE-3')
     A            LOX620         5A         TEXT('HÖHE-3')
     A                                      COLHDG('HÖHE-3')
     A            LOX630         3A         TEXT('WÄHRUNG')
     A                                      COLHDG('WACD')
     A            LOX640         3A         TEXT('TEXTNUMMER 100,300,301,...')
     A                                      COLHDG('TEXTNR.1')
     A            LOX650        70A         TEXT('TEXTZUSATZ 1')
     A                                      COLHDG('TEXTZUSATZ 1')
     A            LOX660         3A         TEXT('TEXTNUMMER 100,300,301,...')
     A                                      COLHDG('TEXTNR.2')
     A            LOX670        70A         TEXT('TEXTZUSATZ 2')
     A                                      COLHDG('TEXTZUSATZ 2')
     A            LOX680         3A         TEXT('TEXTNUMMER 100,300,301,...')
     A                                      COLHDG('TEXTNR.3')
     A            LOX690        70A         TEXT('TEXTZUSATZ 3')
     A                                      COLHDG('TEXTZUSATZ 3')
     A*-------------------------------------------------------------------------
     A          K LOX020
