     A**************************************************************************
     A*  Copyright 2010 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Schenker Empfangsdatei                                                *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 25.05.2012 Projekt 8390                                  *
     A*                                                                        *
     A**************************************************************************
     A          R SPEDG2R
     A*-------------------------------------------------------------------------
     A            SPEDG2FELD  1024A
