     A**************************************************************************
     A*  Copyright 2013 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  TNT Schnittstelle Sammeldatei Sendungen                               *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 17.02.2013 Projekt 8997                                  *
     A*  Änderung: SZ 05.03.2013 Barcodefeld 24 Stellen                        *
     A*  Änderung: SZ 25.03.2013 Gewicht mit Nachkommastellen                  *
     A*                                                                        *
     A**************************************************************************
     A          R SPEDI01
     A*-------------------------------------------------------------------------
     A            TNT010         1A         TEXT('SATZART')
     A                                      COLHDG('SA')
     A            TNT020        15A         TEXT('REFERENZ')
     A                                      COLHDG('REFERENZ')
     A            TNT030        30A         TEXT('ABSENDER NAME 1')
     A                                      COLHDG('A-NAME 1')
     A            TNT040        30A         TEXT('ABSENDER NAME 2')
     A                                      COLHDG('A-NAME 2')
     A            TNT050        30A         TEXT('ABSENDER STRASSE')
     A                                      COLHDG('A-STRASSE')
     A            TNT060         3A         TEXT('ABSENDER LKZ')
     A                                      COLHDG('A-LKZ')
     A            TNT070        10A         TEXT('ABSENDER PLZ')
     A                                      COLHDG('A-PLZ')
     A            TNT080        30A         TEXT('ABSENDER ORT')
     A                                      COLHDG('A-ORT')
     A            TNT090        10A         TEXT('KUNDENNUMMER')
     A                                      COLHDG('KUNDE')
     A            TNT110         1A         TEXT('STATUS')
     A                                      COLHDG('STATUS')
     A            TNT120        30A         TEXT('EMPFÄNGER-NAME-1')
     A                                      COLHDG('E-NAME 1')
     A            TNT130        30A         TEXT('EMPFÄNGER-NAME-2')
     A                                      COLHDG('E-NAME 2')
     A            TNT140        30A         TEXT('EMPFÄNGER STRASSE')
     A                                      COLHDG('E-STRASSE')
     A            TNT150         3A         TEXT('EMPFÄNGER LKZ')
     A                                      COLHDG('E-LKZ')
     A            TNT160        10A         TEXT('EMPFÄNGER-PLZ')
     A                                      COLHDG('E-PLZ')
     A            TNT170        30A         TEXT('EMPFÄNGER ORT')
     A                                      COLHDG('E-ORT')
     A            TNT180        10A         TEXT('EMPFÄNGER EIGEN')
     A                                      COLHDG('EMPFÄNGER')
     A            TNT190        30A         TEXT('FRACHTZAHLER-NAME-1')
     A                                      COLHDG('F-NAME 1')
     A            TNT200        30A         TEXT('FRACHTZAHLER-NAME-2')
     A                                      COLHDG('F-NAME 2')
     A            TNT210        30A         TEXT('FRACHTZAHLER-STRASSE')
     A                                      COLHDG('F-STRASSE')
     A            TNT220         3A         TEXT('FRACHTZAHLER-LKZ')
     A                                      COLHDG('F-LKZ')
     A            TNT230        10A         TEXT('FRACHTZAHLER-PLZ')
     A                                      COLHDG('F-PLZ')
     A            TNT240        30A         TEXT('FRACHTZAHLER-ORT')
     A                                      COLHDG('F-ORT')
     A            TNT250         8S 2       TEXT('WARENWERT/VERSICHERUNGSSUMME')
     A                                      COLHDG('WERT')
     A            TNT260         8S 2       TEXT('NACHNAHMEBETRAG')
     A                                      COLHDG('NACHNAHME')
     A            TNT270        36A         TEXT('BORDEROTEXT ZUS.INFO SPED.')
     A                                      COLHDG('BORDEROTEXT')
     A            TNT280         3S 0       TEXT('FREIFELD')
     A                                      COLHDG('FREIFELD')
     A            TNT290        20A         TEXT('FREIFELD')
     A                                      COLHDG('FREIFELD')
     A            TNT300        32A         TEXT('RECHNUNGSTEXT')
     A                                      COLHDG('RECHNUNGSTEXT')
     A            TNT310         5A         TEXT('TOURNUMMER')
     A                                      COLHDG('TOUR')
     A            TNT320         8S 3       TEXT('GEWICHT')
     A                                      COLHDG('GEWICHT')
     A            TNT330         6S 0       TEXT('RAUMINHALT N.BEI CBM SPERRE')
     A                                      COLHDG('RAUMINHALT')
     A            TNT340         2A         TEXT('FRANKATURKENNZEICHEN')
     A                                      COLHDG('FRANKATUR')
     A            TNT350        15A         TEXT('ZEICHEN 1')
     A                                      COLHDG('ZEICHEN 1')
     A            TNT360         4S 0       TEXT('ANZAHL ETI.')
     A                                      COLHDG('ANZAHL ETI.')
     A            TNT370         2A         TEXT('VERPACKUNGSSCHLÜSSEL 1')
     A                                      COLHDG('VERPACKUNG 1')
     A            TNT380        12A         TEXT('INHALT 1')
     A                                      COLHDG('INHALT 1')
     A            TNT390        15A         TEXT('ZEICHEN 2')
     A                                      COLHDG('ZEICHEN 2')
     A            TNT400         4S 0       TEXT('ANZAHL 2')
     A                                      COLHDG('ANZAHL 2')
     A            TNT410         2A         TEXT('VERPACKUNGSSCHLÜSSEL 2')
     A                                      COLHDG('VERPACKUNG 2')
     A            TNT420        12A         TEXT('INHALT 2')
     A                                      COLHDG('INHALT 2')
     A            TNT430        15A         TEXT('ZEICHEN 3')
     A                                      COLHDG('ZEICHEN 3')
     A            TNT440         4S 0       TEXT('ANZAHL 3')
     A                                      COLHDG('ANZAHL 3')
     A            TNT450         2A         TEXT('VERPACKUNGSSCHLÜSSEL 3')
     A                                      COLHDG('VERPACKUNG 3')
     A            TNT460        12A         TEXT('INHALT 3')
     A                                      COLHDG('INHALT 3')
     A            TNT470         7S 0       TEXT('ILN WAECO')
     A                                      COLHDG('ILN WAECO')
     A            TNT475        25A         TEXT('ILN EMPF.')
     A                                      COLHDG('ILN EMPF.')
     A            TNT480        24A         TEXT('BARCODE')
     A                                      COLHDG('BARCODE')
     A            TNT490         4A         TEXT('SHUTTLE')
     A                                      COLHDG('SHUTTLE')
     A            TNT500         8A         TEXT('LEITGEBIET')
     A                                      COLHDG('LEITGEBIET')
     A            TNT510         4A         TEXT('ABSTELLFACH')
     A                                      COLHDG('ABSTELLFACH')
     A            TNT520         1A         TEXT('DRUCKEN J/N')
     A                                      COLHDG('DR. J/N')
     A            TNT530         8S 0       TEXT('FIXTERMIN')
     A                                      COLHDG('FIXTERMIN')
     A            TNT540         5A         TEXT('LÄNGE-1')
     A                                      COLHDG('LÄNGE-1')
     A            TNT550         5A         TEXT('BREITE-1')
     A                                      COLHDG('BREITE-1')
     A            TNT560         5A         TEXT('HÖHE-1')
     A                                      COLHDG('HÖHE-1')
     A            TNT570         5A         TEXT('LÄNGE-2')
     A                                      COLHDG('LÄNGE-2')
     A            TNT580         5A         TEXT('BREITE-2')
     A                                      COLHDG('BREITE-2')
     A            TNT590         5A         TEXT('HÖHE-2')
     A                                      COLHDG('HÖHE-2')
     A            TNT600         5A         TEXT('LÄNGE-3')
     A                                      COLHDG('LÄNGE-3')
     A            TNT610         5A         TEXT('BREITE-3')
     A                                      COLHDG('BREITE-3')
     A            TNT620         5A         TEXT('HÖHE-3')
     A                                      COLHDG('HÖHE-3')
     A            TNT630         3A         TEXT('WÄHRUNG')
     A                                      COLHDG('WACD')
     A            TNT640         3A         TEXT('TEXTNUMMER 100,300,301,...')
     A                                      COLHDG('TEXTNR.1')
     A            TNT650        70A         TEXT('TEXTZUSATZ 1')
     A                                      COLHDG('TEXTZUSATZ 1')
     A            TNT660         3A         TEXT('TEXTNUMMER 100,300,301,...')
     A                                      COLHDG('TEXTNR.2')
     A            TNT670        70A         TEXT('TEXTZUSATZ 2')
     A                                      COLHDG('TEXTZUSATZ 2')
     A            TNT680         3A         TEXT('TEXTNUMMER 100,300,301,...')
     A                                      COLHDG('TEXTNR.3')
     A            TNT690        70A         TEXT('TEXTZUSATZ 3')
     A                                      COLHDG('TEXTZUSATZ 3')
     A*-------------------------------------------------------------------------
     A          K TNT020
