     A**************************************************************************
     A*  Copyright 2010 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  trans-o-flex Übertragungsdatei                                        *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 06.01.2011 Projekt Vertrieb                              *
     A*                                                                        *
     A**************************************************************************
     A          R SPED31R
     A*-------------------------------------------------------------------------
     A            SPED31FELD   589A
