     A**************************************************************************
     A*  Copyright 2013 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  TNT Schnittstelle Sendungsinformationen                               *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 17.02.2013 Projekt 8997                                  *
     A*                                                                        *
     A**************************************************************************
     A          R SPEDI21
     A*-------------------------------------------------------------------------
     A            SPEDI2FELD  1024A
