     A**************************************************************************
     A*  Copyright 2010 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Schenker Empfangsdatei                                                *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 06.03.2012 Projekt 8260                                  *
     A*                                                                        *
     A**************************************************************************
     A          R SPEDD2R
     A*-------------------------------------------------------------------------
     A            SPEDD2FELD  1024A
