     A**************************************************************************
     A*  Copyright 2010 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Parts Express Übertragungsdatei                                       *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 10.01.2011 Projekt Vertrieb                              *
     A*                                                                        *
     A**************************************************************************
     A          R SPED11R
     A*-------------------------------------------------------------------------
     A            SPED11FELD   590A
