     A**************************************************************************
     A*  Copyright 2001 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Schnittstelle Kühne + Nagel                                           *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 29.02.2012 Projekt 8260                                  *
     A*                                                                        *
     A**************************************************************************
     A          R SPEDF01                   PFILE(SPEDF0)
     A*-------------------------------------------------------------------------
     A          K KUN020
