     A**************************************************************************
     A*  Copyright 2001 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Schnittstelle Schenker                                                *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 25.05.2012 Projekt 8390                                  *
     A*                                                                        *
     A**************************************************************************
     A          R SPEDG01                   PFILE(SPEDG0)
     A*-------------------------------------------------------------------------
     A          K SC2020
