     A**************************************************************************
     A*  Copyright 2012 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Schnittstelle BRT Italien                                             *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: PH 20.12.2012 Projekt 9128                                  *
     A*  Änderung: XX XX.XX.XXXX                                               *
     A**************************************************************************
     A          R SPEDH01                   PFILE(SPEDH0)
     A*-------------------------------------------------------------------------
     A          K BRT020
