     A**************************************************************************
     A*  Copyright 2013 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Schnittstelle TNT                                                     *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 17.02.2013 Projekt 8997                                  *
     A*  Änderung:                                                             *
     A**************************************************************************
     A          R SPEDI01                   PFILE(SPEDI0)
     A*-------------------------------------------------------------------------
     A          K TNT020
