     A**************************************************************************
     A*  Copyright 2013 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Schnittstelle Loxx                                                    *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 24.04.2013 Projekt 9228                                  *
     A*  Änderung:                                                             *
     A**************************************************************************
     A          R SPEDK01                   PFILE(SPEDK0)
     A*-------------------------------------------------------------------------
     A          K LOX020
