     A**************************************************************************
     A*  Copyright 2001 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  IDENTSTAMM-ERWEITERUNGEN                                              *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: ZG 16.11.2010 WAECO Besuch                                  *
     A*                                                                        *
     A**************************************************************************
     A          R TEEW1                     PFILE(TEEW)
     A*-------------------------------------------------------------------------
     A          K TEEWFIRM
     A          K TEEWTENR
