     A**************************************************************************
     A*  Copyright 2004 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Schnittstelle Schenker                                                *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 25.05 2012 Projekt 8390                                  *
     A*                                                                        *
     A**************************************************************************
     A                                      REF(SWMREF)
     A          R UXSPG01
     A*
     A            UXSPG02020R               REFFLD(SPEDG01/SC2020 *LIBL/SPEDG0)
