     A**************************************************************************
     A*  Copyright 2004 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Schnittstelle Kühne + Nagel                                           *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 29.02 2012 Projekt 8260                                  *
     A*                                                                        *
     A**************************************************************************
     A                                      REF(SWMREF)
     A          R UXSPF01
     A*
     A            UXSPF0N020R               REFFLD(SPEDF01/KUN020 *LIBL/SPEDF0)
