     A**************************************************************************
     A*  Copyright 2013 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Schnittstelle Loxx                                                    *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 24.04.2013 Projekt 9228                                  *
     A*  Änderung:                                                             *
     A**************************************************************************
     A                                      REF(SWMREF)
     A          R UXSPK01
     A*
     A            UXSPK0X020R               REFFLD(SPEDK01/LOX020 *LIBL/SPEDK0)
