     A**************************************************************************
     A*  Copyright 2004 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Schnittstelle-Schenker                                                *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: VU 06.06 2011                                               *
     A*                                                                        *
     A**************************************************************************
     A                                      REF(SWMREF)
     A          R UXSABE1
     A*
     A            UXSPD0H020R               REFFLD(SPEDD01/SCH020 *LIBL/SPEDD0)
