     A**************************************************************************
     A*  Copyright 2004 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Schnittstelle Boll/Unitrans                                           *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 27.07 2011                                               *
     A*                                                                        *
     A**************************************************************************
     A                                      REF(SWMREF)
     A          R UXSP601
     A*
     A            UXSP60L020R               REFFLD(HEL60R1/HEL020 *LIBL/SPED60)
