     A**************************************************************************
     A*  Copyright 2025 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Jechtinger Straße 9                              *
     A*                       DE 79111 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  B2B Interface                                                         *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: MG 15.07.2025 Case #04264118 Integration Siegen             *
     A*                                                                        *
     A**************************************************************************
     A                                      REF(W017)
     A          R UXW0171
     A*
     A            UXW017FIRMR               REFFLD(W017FIRM)
     A            UXW017TSTPR               REFFLD(W017TSTP)
