     A**************************************************************************
     A*  Copyright 2021 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Jechtinger Straße 9                              *
     A*                       DE 79111 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Artikelausschluss                                                     *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: PH 30.04.2021 DOMETIC Projekt 16416-01                      *
     A*  Änderung: XX XX.XX.XXXX                                               *
     A**************************************************************************
     A                                      REF(SWMREF)
     A          R UXWA141
     A*
     A            UXWA14FIRMR               REFFLD(WA141/WA14FIRM *LIBL/WA14)
     A            UXWA14TENRR               REFFLD(WA141/WA14TENR *LIBL/WA14)
