     A**************************************************************************
     A*  Copyright 2025 by    trend SWM EDV-Beratung GmbH & Co. KG             *
     A*                       Jechtinger Straße 9                              *
     A*                       DE 79111 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Zuordnung PRGR/Dometic <- Produktgruppe                               *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: PH 08.05.2025 Case #04280892                                *
     A*  Änderung: XX XX.XX.XXXX                                               *
     A**************************************************************************
     A                                      REF(SWMREF)
     A          R UXWA191
     A*
     A            UXWA19FIRMR               REFFLD(WA191/WA19FIRM *LIBL/WA19)
     A            UXWA19TEPGR               REFFLD(WA191/WA19TEPG *LIBL/WA19)
     A            UXWA19PRGRR               REFFLD(WA191/WA19PRGR *LIBL/WA19)
