     A**************************************************************************
     A*  Copyright 2024 by    trend SWM EDV-Beratung GmbH & Co. KG             *
     A*                       Verwaltung GmbH                                  *
     A*                       Jechtinger Straße 9                              *
     A*                       DE 79111 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Preisdifferenz-Briefkasten - Kopf                                     *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: PH 29.11.2024 Case #03829427                                *
     A*  Änderung: XX XX.XX.XXXX                                               *
     A**************************************************************************
     A                                      REF(SWMREF)
     A          R UXWA201
     A*
     A            UXWA20FIRMR               REFFLD(WA201/WA20FIRM *LIBL/WA20)
     A            UXWA20BLJJR               REFFLD(WA201/WA20BLJJ *LIBL/WA20)
     A            UXWA20BLNRR               REFFLD(WA201/WA20BLNR *LIBL/WA20)
