     A**************************************************************************
     A*  Copyright 2009 by    trend SWM                                        *
     A*                       Verwaltungs GmbH                                 *
     A*                       Ziegelhofstraße 210a                             *
     A*                       DE 79110 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Produktgruppen<-Margenmatrix                                          *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: HR 03.02.2011 Projekt 7120 für Kunde Dometec                *
     A*  Änderung: XX XX.XX.XXXX                                               *
     A**************************************************************************
     A                                      REF(SWMREF)
     A          R UXWAOC1
     A*
     A            UXWAOCFIRMR               REFFLD(WAOC1/WAOCFIRM *LIBL/WAOC)
     A            UXWAOCPRGRR               REFFLD(WAOC1/WAOCPRGR *LIBL/WAOC)
     A            UXWAOCLFNRR               REFFLD(WAOC1/WAOCLFNR *LIBL/WAOC)
