     A**************************************************************************
     A*  Copyright 2004 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Beschreibung                                                          *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: ZG 07.05.2014 BESUCH                                        *
     A*                                                                        *
     A**************************************************************************
     A                                      REF(SWMREF)
     A          R UXWAOQ1
     A*
     A            UXWAOQFIRMR               REFFLD(WAOQ1/WAOQFIRM *LIBL/WAOQ)
     A            UXWAOQTENRR               REFFLD(WAOQ1/WAOQTENR *LIBL/WAOQ)
     A            UXWAOQLANRR               REFFLD(WAOQ1/WAOQLANR *LIBL/WAOQ)
