     A**************************************************************************
     A*  Copyright 2022 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Jechtinger Straße 9                              *
     A*                       DE 79111 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Zuordnung Auftragswerk <- Artikel-Werk                                *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: PH 08.12.2022 Projekt 220567-02                             *
     A*  Änderung: XX XX.XX.XXXX                                               *
     A**************************************************************************
     A                                      REF(SWMREF)
     A          R UXWA111
     A*
     A            UXWA11FIRMR               REFFLD(WA111/WA11FIRM *LIBL/WA11)
     A            UXWA11WKNRR               REFFLD(WA111/WA11WKNR *LIBL/WA11)
     A            UXWA11TEWKR               REFFLD(WA111/WA11TEWK *LIBL/WA11)
