     A**************************************************************************
     A*  Copyright 2024 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Jechtinger Straße 9                              *
     A*                       DE 79111 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Zolltarif/Ident-Dateie                                                *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: ZG 14.01.2026 Case #05780597                                *
     A*  Änderung: XX XX.XX.XXXX                                               *
     A**************************************************************************
     A                                      REF(SWMREF)
     A          R UXZOTE1
     A*
     A            UXZOTEFIRMR               REFFLD(ZOTE1/ZOTEFIRM *LIBL/ZOTE)
     A            UXZOTETENRR               REFFLD(ZOTE1/ZOTETENR *LIBL/ZOTE)
     A            UXZOTEIMEXR               REFFLD(ZOTE1/ZOTEIMEX *LIBL/ZOTE)
     A            UXZOTEGADAR               REFFLD(ZOTE1/ZOTEGADA *LIBL/ZOTE)
