     A**************************************************************************
     A*  Copyright 2025 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Jechtinger Straße 9                              *
     A*                       DE 79111 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  B2B Interface                                                         *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: MG 15.07.2025 Case #04264118 Integration Siegen             *
     A*                                                                        *
     A**************************************************************************
     A                                      REF(SWMREF)
     A          R W0171
     A*-------------------------------------------------------------------------
     A            W017LOCK  R               REFFLD(##LOCK)
     A            W017JNAM  R               REFFLD(##JNAM)
     A            W017JDAT  R               REFFLD(##JDAT)
     A            W017JZEI  R               REFFLD(##JZEI)
     A            W017USER  R               REFFLD(##USER)
     A            W017PROG  R               REFFLD(##PROG)
     A            W017BIBL  R               REFFLD(##BIBL)
     A            W017FIRM  R               REFFLD(##FIRM)
     A            W017TSTP  R               REFFLD(##TSTP)
     A            W017ERUS  R               REFFLD(##ERUS)
     A            W017ERDA  R               REFFLD(##ERDA)
     A            W017TDIR  R               REFFLD(##TDIR)
     A                                      COLHDG('Verzeichnis')
     A                                      TEXT('Verzeichnis')
     A            W017IDEN  R               REFFLD(##IDEN)
     A                                      COLHDG('KD-Ident-Nr')
     A                                      TEXT('Kunden-Identnummer')
     A            W017LFTE  R               REFFLD(##LFTE)
     A                                      COLHDG('Lf-Termin')
     A                                      TEXT('Liefer-Termin')
     A            W017REFN  R               REFFLD(##REF1)
     A                                      COLHDG('Referenz-1')
     A                                      TEXT('Referenz 1')
     A            W017BEPO  R               REFFLD(##BEPO)
     A                                      COLHDG('BeP')
     A                                      TEXT('Bestell-POS')
     A            W017BEDA  R               REFFLD(##BEDA)
     A                                      COLHDG('Be-Datum')
     A                                      TEXT('Bestell-Datum')
     A            W017TEXT  R               REFFLD(##TEXT)
     A                                      COLHDG('Dokument-Text')
     A                                      TEXT('Doku-Text')
     A            W017PLMG  R               REFFLD(##PLMG)
     A            W017BSMG  R               REFFLD(##BSMG)
     A                                      COLHDG('Bestell-Mge')
     A                                      TEXT('Bestell-Menge')
     A            W017KDNR  R               REFFLD(##KDNR)
     A                                      COLHDG('Kunden-Nr')
     A                                      TEXT('Kunden-Nr')
     A            W017ABMA  R               REFFLD(##ABMA)
     A                                      COLHDG('AM')
     A                                      TEXT('Absatzmarkt')
     A            W017FRZO       3S 0       COLHDG('FROZ')
     A                                      TEXT('Frozen Zone')
     A            W017TENR  R               REFFLD(##TENR)
     A            W017VWAR  R               REFFLD(##VWAR)
     A                                      COLHDG('VA')
     A                                      TEXT('Verw-Art')
     A            W017WKNR  R               REFFLD(##WKNR)
     A                                      COLHDG('Wrk')
     A                                      TEXT('Werksnummer')
     A            W017AFAT  R               REFFLD(##AFAT)
     A                                      COLHDG('AfA')
     A                                      TEXT('Kunden-Auftrags-Art')
     A            W017STAT  R               REFFLD(##STAT)
     A                                      COLHDG('ST')
     A                                      TEXT('Status')
     A            W017FENR  R               REFFLD(##FENR)
     A                                      COLHDG('FeNr')
     A                                      TEXT('Fehler-Nr')
     A            W017FFLD  R               REFFLD(##FFLD)
     A                                      COLHDG('Fehler-Feld')
     A                                      TEXT('Fehler-Feld')
     A            W017IFFI  R               REFFLD(##IFFI)
     A                                      COLHDG('IF-Fa')
     A                                      TEXT('IF Firmen-Nr')
     A            W017IFNR  R               REFFLD(##IFNR)
     A                                      COLHDG('IFNr')
     A                                      TEXT('IF Auftrags-Nr')
     A            W017IFPO  R               REFFLD(##IFPO)
     A                                      COLHDG('IFP')
     A                                      TEXT('IF Af-Position')
     A            W017AFJJ  R               REFFLD(##AFJJ)
     A                                      COLHDG('AfJ')
     A                                      TEXT('KD-Af-Jahr')
     A            W017AFNR  R               REFFLD(##AFNR)
     A                                      COLHDG('KD-Af-Nr')
     A                                      TEXT('KD-Auftrags-Nr')
     A            W017AFPO  R               REFFLD(##AFPO)
     A                                      COLHDG('AfP')
     A                                      TEXT('KD-Af-Position')
     A            W017VSNR  R               REFFLD(##VSNR)
     A            W017FREI  R  253A         REFFLD(##FREI)
