     A**************************************************************************
     A*  Copyright 2022 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Jechtinger Straße 9                              *
     A*                       DE 79111 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Zuordnung Auftragswerk <- Artikel-Werk                                *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: PH 08.12.2022 Projekt 220567-02                             *
     A*  Änderung: XX XX.XX.XXXX                                               *
     A**************************************************************************
     A          R WA111                     PFILE(WA11)
     A*-------------------------------------------------------------------------
     A          K WA11FIRM
     A          K WA11WKNR
     A          K WA11TEWK
