     A**************************************************************************
     A*  Copyright 2004 by    trend SWM                                        *
     A*                       Verwaltungs GmbH                                 *
     A*                       Ziegelhofstraße 210a                             *
     A*                       DE 79110 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Kunden-Auftrags-Art Parameter     Erweiterung                         *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: RE 13.09.2016                                               *
     A*                                                                        *
     A**************************************************************************
     A          R WA131                     PFILE(WA13)
     A*-------------------------------------------------------------------------
     A          K WA13FIRM
     A          K WA13AFAT
