     A**************************************************************************
     A*  Copyright 2021 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Jechtinger Straße 9                              *
     A*                       DE 79111 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Artikelausschluss                                                     *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: PH 30.04.2021 DOMETIC Projekt 16416-01                      *
     A*  Änderung: XX XX.XX.XXXX                                               *
     A**************************************************************************
     A          R WA141                     PFILE(WA14)
     A*-------------------------------------------------------------------------
     A          K WA14FIRM
     A          K WA14TENR
