     A**************************************************************************
     A*  Copyright 2021 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Jechtinger Straße 9                              *
     A*                       DE 79111 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Lieferant/Versandbedingung                                            *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: JK 3010082021 DOMETIC Projekt 16637                         *
     A*  Änderung: XX XX.XX.XXXX                                               *
     A**************************************************************************
     A          R WA151                     PFILE(WA15)
     A*-------------------------------------------------------------------------
     A          K WA15FIRM
     A          K WA15VSBD
     A          K WA15LFNR
