     A**************************************************************************
     A*  Copyright 2024 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Jechtinger Straße 9                              *
     A*                       DE 79111 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Zuordnung Kunden-Nr <- Kundengruppe                                   *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: PH 04.11.2024 Case #03895676                                *
     A*  Änderung: XX XX.XX.XXXX                                               *
     A**************************************************************************
     A          R WA161                     PFILE(WA16)
     A*-------------------------------------------------------------------------
     A          K WA16FIRM
     A          K WA16KDNR
     A          K WA16KDGR
