     A**************************************************************************
     A*  Copyright 2024 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Jechtinger Straße 9                              *
     A*                       DE 79111 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Zuordnung Kundengruppe <- Produktgruppe                               *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: PH 05.11.2024 Case #03895676                                *
     A*  Änderung: XX XX.XX.XXXX                                               *
     A**************************************************************************
     A          R WA171                     PFILE(WA17)
     A*-------------------------------------------------------------------------
     A          K WA17FIRM
     A          K WA17PRGR
     A          K WA17KDGR
