     A**************************************************************************
     A*  Copyright 2024 by    trend SWM EDV-Beratung GmbH & Co. KG             *
     A*                       Jechtinger Straße 9                              *
     A*                       DE 79111 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Belegübernahme Toleranzdefinition                                     *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: PH 29.11.2024 Case #03829427                                *
     A*  Änderung: XX XX.XX.XXXX                                               *
     A**************************************************************************
     A                                      UNIQUE
     A          R WA181                     PFILE(WA18)
     A*-------------------------------------------------------------------------
     A          K WA18FIRM
     A          K WA18LFNR
     A          K WA18URLD
