     A**************************************************************************
     A*  Copyright 2025 by    trend SWM EDV-Beratung GmbH & Co. KG             *
     A*                       Jechtinger Straße 9                              *
     A*                       DE 79111 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Zuordnung PRGR/Dometic <- Produktgruppe                               *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: PH 08.05.2025 Case #04280892                                *
     A*  Änderung: XX XX.XX.XXXX                                               *
     A**************************************************************************
     A          R WA191                     PFILE(WA19)
     A*-------------------------------------------------------------------------
     A          K WA19FIRM
     A          K WA19PRGR
     A          K WA19TEPG
