     A**************************************************************************
     A*  Copyright 2025 by    trend SWM EDV-Beratung GmbH & Co. KG             *
     A*                       Jechtinger Straße 9                              *
     A*                       DE 79111 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Zuordnung PRGR/Dometic <- Produktgruppe                               *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: PH 08.05.2025 Case #04280892                                *
     A*  Änderung: XX XX.XX.XXXX                                               *
     A**************************************************************************
     A                                      REF(SWMREF)
     A          R WA191
     A*-------------------------------------------------------------------------
     A            WA19LOCK  R               REFFLD(##LOCK)
     A            WA19JNAM  R               REFFLD(##JNAM)
     A            WA19JDAT  R               REFFLD(##JDAT)
     A            WA19JZEI  R               REFFLD(##JZEI)
     A            WA19USER  R               REFFLD(##USER)
     A            WA19PROG  R               REFFLD(##PROG)
     A            WA19BIBL  R               REFFLD(##BIBL)
     A            WA19FIRM  R               REFFLD(##FIRM)
     A            WA19TEPG  R               REFFLD(##PRGR)
     A                                      TEXT('PRGR/Dometic')
     A                                      COLHDG('PRGR/Dometic')
     A            WA19PRGR  R               REFFLD(##PRGR)
     A            WA19TSTP  R               REFFLD(##TSTP)
     A            WA19ERUS  R               REFFLD(##ERUS)
     A            WA19FREI  R  100          REFFLD(##FREI)
