     A**************************************************************************
     A*  Copyright 2024 by    trend SWM EDV-Beratung GmbH & Co. KG             *
     A*                       Jechtinger Straße 9                              *
     A*                       DE 79111 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Preisdifferenz-Briefkasten-Position                                   *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: PH 29.11.2024 Case #03829427                                *
     A*  Änderung: XX XX.XX.XXXX                                               *
     A**************************************************************************
     A                                      UNIQUE
     A          R WA211                     PFILE(WA21)
     A*-------------------------------------------------------------------------
     A          K WA21FIRM
     A          K WA21BLJJ
     A          K WA21BLNR
     A          K WA21BLPO
