     A**************************************************************************
     A*                                                                        *
     A*  Copyright 2003 by    trend SWM                                        *
     A*                       EDV-Beratung GmbH                                *
     A*                       Ziegelhofstr. 210a                               *
     A*                       D-79112 Freiburg                                 *
     A*  --------------------------------------------------------------------- *
     A*                                                                        *
     A*  ----------------------------------------------------------------------*
     A*  Erstellt: TB 18.03.2003                                               *
     A*                                                                        *
     A**************************************************************************
     A*
     A          R WAO11                     PFILE(WAO1)
     A*
     A          K WAO1FIRM
     A          K WAO1UEST
     A          K WAO1LIJJ
     A          K WAO1LINR
     A          K WAO1RALP
