     A**************************************************************************
     A*  Copyright 2007 by    trend SWM                                        *
     A*                       Verwaltungs GmbH                                 *
     A*                       Ziegelhofstraße 210a                             *
     A*                       DE 79110 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Serien-Nr                                                             *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: MG 06.02.2007 Projekt-Nr 4200                               *
     A*            Vergabe von Serien-Nr in der Bestell-Abwicklung             *
     A*                                                                        *
     A**************************************************************************
     A          R WAO21                     PFILE(WAO2)
     A*-------------------------------------------------------------------------
     A          K WAO2FIRM
     A          K WAO2BEJJ
     A          K WAO2BENR
     A          K WAO2BEPO
