     A**************************************************************************
     A*  Copyright 2001 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Beschreibung                                                          *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: ZG 21.07.2010 PROJKET 6231 WAECO                            *
     A*                                                                        *
     A**************************************************************************
     A          R WAO61                     PFILE(WAO6)
     A*-------------------------------------------------------------------------
     A          K WAO6FIRM
     A          K WAO6TENR
     A          K WAO6LPTY
