     A**************************************************************************
     A*  Copyright 2010 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  LG-PLATZ/TYP-ZUORDNUNG                                                *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: ZG 05.10.2010 BESUCH                                        *
     A*                                                                        *
     A**************************************************************************
     A          R WAO71                     PFILE(WAO7)
     A*-------------------------------------------------------------------------
     A          K WAO7FIRM
     A          K WAO7LANR
     A          K WAO7LORT
