     A**************************************************************************
     A*  Copyright 2001 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Vorkalkulation Rechenschemaübersicht                                  *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: HR 31.03.2011                                               *
     A*                                                                        *
     A**************************************************************************
     A                                      REF(SWMREF)
     A          R WAOF1
     A*-------------------------------------------------------------------------
     A            WAOFLOCK  R               REFFLD(##LOCK)
     A            WAOFJNAM  R               REFFLD(##JNAM)
     A            WAOFJDAT  R               REFFLD(##JDAT)
     A            WAOFJZEI  R               REFFLD(##JZEI)
     A            WAOFUSER  R               REFFLD(##USER)
     A            WAOFPROG  R               REFFLD(##PROG)
     A            WAOFBIBL  R               REFFLD(##BIBL)
     A*
     A            WAOFFIRM  R               REFFLD(##FIRM)
     A            WAOFKAJJ  R               REFFLD(##KAJJ)
     A            WAOFKANR  R               REFFLD(##KANR)
     A            WAOFVEUR  R               REFFLD(##VEUR)
     A            WAOFWF01  R               REFFLD(##RAWT)
     A            WAOFWF02  R               REFFLD(##RAWT)
     A            WAOFWF03  R               REFFLD(##RAWT)
     A            WAOFWF04  R               REFFLD(##RAWT)
     A            WAOFWF05  R               REFFLD(##RAWT)
     A            WAOFWF06  R               REFFLD(##RAWT)
     A            WAOFWF07  R               REFFLD(##RAWT)
     A            WAOFWF08  R               REFFLD(##RAWT)
     A            WAOFWF09  R               REFFLD(##RAWT)
     A            WAOFWF10  R               REFFLD(##RAWT)
     A            WAOFWF11  R               REFFLD(##RAWT)
     A            WAOFWF12  R               REFFLD(##RAWT)
     A            WAOFWF13  R               REFFLD(##RAWT)
     A            WAOFWF14  R               REFFLD(##RAWT)
     A            WAOFWF15  R               REFFLD(##RAWT)
     A            WAOFWF16  R               REFFLD(##RAWT)
     A            WAOFWF17  R               REFFLD(##RAWT)
     A            WAOFWF18  R               REFFLD(##RAWT)
     A            WAOFWF19  R               REFFLD(##RAWT)
     A            WAOFWF20  R               REFFLD(##RAWT)
     A            WAOFWF21  R               REFFLD(##RAWT)
     A            WAOFWF22  R               REFFLD(##RAWT)
     A            WAOFWF23  R               REFFLD(##RAWT)
     A            WAOFWF24  R               REFFLD(##RAWT)
     A            WAOFWF25  R               REFFLD(##RAWT)
     A            WAOFWF26  R               REFFLD(##RAWT)
     A            WAOFWF27  R               REFFLD(##RAWT)
     A            WAOFWF28  R               REFFLD(##RAWT)
     A            WAOFWF29  R               REFFLD(##RAWT)
     A            WAOFWF30  R               REFFLD(##RAWT)
     A            WAOFWF31  R               REFFLD(##RAWT)
     A            WAOFWF32  R               REFFLD(##RAWT)
     A            WAOFWF33  R               REFFLD(##RAWT)
     A            WAOFWF34  R               REFFLD(##RAWT)
     A            WAOFWF35  R               REFFLD(##RAWT)
     A            WAOFWF36  R               REFFLD(##RAWT)
     A            WAOFWF37  R               REFFLD(##RAWT)
     A            WAOFWF38  R               REFFLD(##RAWT)
     A            WAOFWF39  R               REFFLD(##RAWT)
     A            WAOFWF40  R               REFFLD(##RAWT)
     A            WAOFWF41  R               REFFLD(##RAWT)
     A            WAOFWF42  R               REFFLD(##RAWT)
     A            WAOFWF43  R               REFFLD(##RAWT)
     A            WAOFWF44  R               REFFLD(##RAWT)
     A            WAOFWF45  R               REFFLD(##RAWT)
     A            WAOFWF46  R               REFFLD(##RAWT)
     A            WAOFWF47  R               REFFLD(##RAWT)
     A            WAOFWF48  R               REFFLD(##RAWT)
     A            WAOFWF49  R               REFFLD(##RAWT)
     A            WAOFWF50  R               REFFLD(##RAWT)
     A            WAOFTSTP  R               REFFLD(##TSTP)
     A            WAOFERUS  R               REFFLD(##ERUS)
     A            WAOFBERE  R               REFFLD(##KABE)
     A            WAOFWF51  R               REFFLD(##RAWT)
     A            WAOFWF52  R               REFFLD(##RAWT)
     A            WAOFWF53  R               REFFLD(##RAWT)
     A            WAOFWF54  R               REFFLD(##RAWT)
     A            WAOFFREI  R   53          REFFLD(##FREI)
