     A**************************************************************************
     A*  Copyright 2001 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Vorkalkulation Rechenschemaübersicht                                  *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: HR 31.03.2011                                               *
     A*                                                                        *
     A**************************************************************************
     A          R WAOF1                     PFILE(WAOF)
     A*-------------------------------------------------------------------------
     A          K WAOFFIRM
     A          K WAOFKAJJ
     A          K WAOFKANR
     A          K WAOFVEUR
