     A**************************************************************************
     A*  Copyright 2010 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Etiketten Schenker                                                    *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 03.06.2011 Projekt 7357                                  *
     A*                                                                        *
     A**************************************************************************
     A          R WAOG1
     A*-------------------------------------------------------------------------
     A            WAOGFELD     128A
