     A**************************************************************************
     A*  Copyright 2000 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  PLZ Schenker                                                          *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 07.06.2011 Projekt 7485                                  *
     A*                                                                        *
     A**************************************************************************
     A          R WAOH1                     PFILE(WAOH)
     A*
     A          K WAOHFIRM
     A          K WAOHPOLZ
