     A**************************************************************************
     A*  Copyright 2000 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  HUB-Kettendatei für Schenker                                          *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: VU 10.06.2011 Projekt 7485                                  *
     A*                                                                        *
     A**************************************************************************
     A          R WAOJ1                     PFILE(WAOJ)
     A*
     A          K WAOJFIRM
     A          K WAOJGENR
