     A**************************************************************************
     A*  Copyright 2011 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Absatz/Umsatz-Statistik                                               *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: MG 24.08.2011 Projekt 7668, Planungssystem                  *
     A*                                                                        *
     A**************************************************************************
     A          R WAOL1                     PFILE(WAOL)
     A*-------------------------------------------------------------------------
     A          K WAOLFIRM
     A          K WAOLPLAT
     A          K WAOLWKNR
     A          K WAOLKSTC
     A          K WAOLKDGR
     A          K WAOLKDPL
     A          K WAOLKDNR
     A          K WAOLPRGR
     A          K WAOLJAHR
     A          K WAOLMONA
