     A**************************************************************************
     A*  Copyright 2010 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Etiketten Kühne + Nagel                                               *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: SZ 21.03.2012 Projekt 8320                                  *
     A*                                                                        *
     A**************************************************************************
     A          R WAON1
     A*-------------------------------------------------------------------------
     A            WAONFELD     128A
