     A**************************************************************************
     A*  Copyright 2011 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Lager-Zugang Fehler-Code                                              *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: RE 23.01.2012                                               *
     A*                                                                        *
     A**************************************************************************
     A          R WAOO1                     PFILE(WAOO)
     A*-------------------------------------------------------------------------
     A          K WAOOFIRM
     A          K WAOOLGJJ
     A          K WAOOLGNR
     A          K WAOOLGPO
     A          K WAOOFBNR
     A          K WAOOTSTP
