     A**************************************************************************
     A*  Copyright 2012 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Absatz/Umsatz-Plan Planungs-KD/Artikel                                *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: MG 24.08.2011 Projekt 8559, Planungssystem                  *
     A*                                                                        *
     A**************************************************************************
     A                                      REF(SWMREF)
     A          R WAOP1
     A*-------------------------------------------------------------------------
     A            WAOPLOCK  R               REFFLD(##LOCK)
     A            WAOPJNAM  R               REFFLD(##JNAM)
     A            WAOPJDAT  R               REFFLD(##JDAT)
     A            WAOPJZEI  R               REFFLD(##JZEI)
     A            WAOPUSER  R               REFFLD(##USER)
     A            WAOPPROG  R               REFFLD(##PROG)
     A            WAOPBIBL  R               REFFLD(##BIBL)
     A            WAOPFIRM  R               REFFLD(##FIRM)
     A            WAOPPLAT  R               REFFLD(##PLAT)
     A            WAOPWKNR  R               REFFLD(##WKNR)
     A            WAOPKSTC  R               REFFLD(##KSTC)
     A            WAOPKDGR  R               REFFLD(##KDGR)
     A            WAOPKDPL  R               REFFLD(KDEW1/KDEWKDPL *LIBL/KDEW)
     A            WAOPKDNR  R               REFFLD(##KDNR)
     A            WAOPLDNR  R               REFFLD(##LDNR)
     A            WAOPTENR  R               REFFLD(##TENR)
     A            WAOPJAHR  R               REFFLD(##JAHR)
     A            WAOPPLMG  R               REFFLD(##PLMG)
     A            WAOPPLUM  R               REFFLD(##PLUM)
     A            WAOPSTPR  R               REFFLD(##STPR)
     A            WAOPPDAV  R               REFFLD(##PDAV)
     A            WAOPERTR  R               REFFLD(##ERTR)
     A            WAOPMG01  R               REFFLD(##PLMG)
     A            WAOPMG02  R               REFFLD(##PLMG)
     A            WAOPMG03  R               REFFLD(##PLMG)
     A            WAOPMG04  R               REFFLD(##PLMG)
     A            WAOPMG05  R               REFFLD(##PLMG)
     A            WAOPMG06  R               REFFLD(##PLMG)
     A            WAOPMG07  R               REFFLD(##PLMG)
     A            WAOPMG08  R               REFFLD(##PLMG)
     A            WAOPMG09  R               REFFLD(##PLMG)
     A            WAOPMG10  R               REFFLD(##PLMG)
     A            WAOPMG11  R               REFFLD(##PLMG)
     A            WAOPMG12  R               REFFLD(##PLMG)
     A            WAOPUM01  R               REFFLD(##PLUM)
     A            WAOPUM02  R               REFFLD(##PLUM)
     A            WAOPUM03  R               REFFLD(##PLUM)
     A            WAOPUM04  R               REFFLD(##PLUM)
     A            WAOPUM05  R               REFFLD(##PLUM)
     A            WAOPUM06  R               REFFLD(##PLUM)
     A            WAOPUM07  R               REFFLD(##PLUM)
     A            WAOPUM08  R               REFFLD(##PLUM)
     A            WAOPUM09  R               REFFLD(##PLUM)
     A            WAOPUM10  R               REFFLD(##PLUM)
     A            WAOPUM11  R               REFFLD(##PLUM)
     A            WAOPUM12  R               REFFLD(##PLUM)
     A            WAOPER01  R               REFFLD(##ERTR)
     A            WAOPER02  R               REFFLD(##ERTR)
     A            WAOPER03  R               REFFLD(##ERTR)
     A            WAOPER04  R               REFFLD(##ERTR)
     A            WAOPER05  R               REFFLD(##ERTR)
     A            WAOPER06  R               REFFLD(##ERTR)
     A            WAOPER07  R               REFFLD(##ERTR)
     A            WAOPER08  R               REFFLD(##ERTR)
     A            WAOPER09  R               REFFLD(##ERTR)
     A            WAOPER10  R               REFFLD(##ERTR)
     A            WAOPER11  R               REFFLD(##ERTR)
     A            WAOPER12  R               REFFLD(##ERTR)
     A            WAOPWACD  R               REFFLD(##WACD)
     A            WAOPPLKZ       1A         TEXT('Planungskz')
     A                                      COLHDG('Planungskz')
     A            WAOPSTKD  R               REFFLD(##STKD)
     A            WAOPFREI  R  100          REFFLD(##FREI)
