     A**************************************************************************
     A*  Copyright 2001 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Beschreibung                                                          *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: ZG 07.05.2014 BESUCH                                        *
     A*                                                                        *
     A**************************************************************************
     A          R WAOQ1                     PFILE(WAOQ)
     A*-------------------------------------------------------------------------
     A          K WAOQFIRM
     A          K WAOQTENR
     A          K WAOQLANR
