     A**************************************************************************
     A*  Copyright 2013 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Relationen TNT                                                        *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: PH 19.02.2012 DOMETIC Projekt 8997                          *
     A*  Änderung: XX XX.XX.XXXX                                               *
     A**************************************************************************
     A          R WAOS1                     PFILE(WAOS)
     A*-------------------------------------------------------------------------
     A          K WAOSFIRM
     A          K WAOSLISO
     A          K WAOSPLZB
