     A**************************************************************************
     A*  Copyright 2013 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Relationen TNT                                                        *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: PH 19.02.2012 DOMETIC Projekt 8997                          *
     A*  Änderung: XX XX.XX.XXXX                                               *
     A**************************************************************************
     A                                      REF(SWMREF)
     A          R WAOS1
     A*-------------------------------------------------------------------------
     A            WAOSLOCK  R               REFFLD(##LOCK)
     A            WAOSJNAM  R               REFFLD(##JNAM)
     A            WAOSJDAT  R               REFFLD(##JDAT)
     A            WAOSJZEI  R               REFFLD(##JZEI)
     A            WAOSUSER  R               REFFLD(##USER)
     A            WAOSPROG  R               REFFLD(##PROG)
     A            WAOSBIBL  R               REFFLD(##BIBL)
     A            WAOSFIRM  R               REFFLD(##FIRM)
     A            WAOSLISO  R               REFFLD(##LISO)
     A            WAOSPLZV  R               REFFLD(##POLZ)
     A                                      COLHDG('PLZ von')
     A                                      TEXT('PLZ von')
     A            WAOSPLZB  R               REFFLD(##POLZ)
     A                                      COLHDG('PLZ bis')
     A                                      TEXT('PLZ bis')
     A            WAOSRLTN  R    2          REFFLD(##RLTN)
     A            WAOSFREI  R  100          REFFLD(##FREI)
