     A**************************************************************************
     A*  Copyright 2009 by    trend SWM                                        *
     A*                       Verwaltungs GmbH                                 *
     A*                       Ziegelhofstraße 210a                             *
     A*                       DE 79110 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Skiplot-Zähler                                                        *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: RE 20.08.2013 Projekt 9609                                  *
     A*                                                                        *
     A**************************************************************************
     A          R WAOT1                     PFILE(WAOT)
     A*-------------------------------------------------------------------------
     A          K WAOTFIRM
     A          K WAOTTENR
