     A**************************************************************************
     A*  Copyright 2014 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Sicherheitsdatenblätter pro Land, Artikel                             *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: MG 14.01.2014 Projekt 9787                                  *
     A*                                                                        *
     A**************************************************************************
     A          R WAOU1                     PFILE(WAOU)
     A*-------------------------------------------------------------------------
     A          K WAOUFIRM
     A          K WAOUTENR
     A          K WAOULAND
