     A**************************************************************************
     A*  Copyright 2014 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Beschreibung                                                          *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: RE 18.11.2014 PROJEKT 11070                                 *
     A*                                                                        *
     A**************************************************************************
     A          R WAOW1                     PFILE(WAOW)
     A*-------------------------------------------------------------------------
     A          K WAOWFIRM
     A          K WAOWRGJJ
     A          K WAOWRGNR
     A          K WAOWLIJJ
     A          K WAOWLINR
