     A**************************************************************************
     A*  Copyright 2015 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Gundelfinger Straße 11                           *
     A*                       DE 79108 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Ident-Nr -> Land                                                      *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: PH 13.08.2015 Projekt 11567                                 *
     A*  Änderung: XX XX.XX.XXXX                                               *
     A**************************************************************************
     A          R WAOX1                     PFILE(WAOX)
     A*-------------------------------------------------------------------------
     A          K WAOXFIRM
     A          K WAOXLAND
     A          K WAOXTENR
