     A**************************************************************************
     A*  Copyright 2021 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Jechtinger Straße 9                              *
     A*                       DE 79111 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Zuordnung Land <- Artikel (Ein-/Ausschluss)                           *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: PH 01.03.2021 Projekt 16393-01                              *
     A*  Änderung: XX XX.XX.XXXX                                               *
     A**************************************************************************
     A          R WAOY1                     PFILE(WAOY)
     A*-------------------------------------------------------------------------
     A          K WAOYFIRM
     A          K WAOYLAND
     A          K WAOYTENR
