     A**************************************************************************
     A*  Copyright 2021 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Jechtinger Straße 9                              *
     A*                       DE 79111 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: JK 31.08.2021 DOMETIC Projekt 16637                         *
     A**************************************************************************
     A                                      REF(SWMREF)
     A          R WAPR1
     A*-------------------------------------------------------------------------
     A            WAPRPROG  R               REFFLD(##PROG)
     A            WAPRTSTP  R               REFFLD(##TSTP)
     A            WAPRDATE        L
     A            WAPRTIME        T
     A            WAPRDESC     128
