     A          R ZGLB1
     A            EZLBLB      1024A
     A            RZLBLB      1024A
     A            D1FIRM         2A
     A            D2FIRM         2A
     A            D3FIRM         2A
