     A**************************************************************************
     A*  Copyright 2026 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Jechtinger Straße 9                              *
     A*                       DE 79111 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Zolltarif/Ident-Dateie                                                *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: ZG 14.01.2026 Case #05780597                                *
     A*  Änderung: XX XX.XX.XXXX                                               *
     A**************************************************************************
     A                                      UNIQUE
     A          R ZOTE1                     PFILE(ZOTE)
     A*-------------------------------------------------------------------------
     A          K ZOTEFIRM
     A          K ZOTEZOTN
     A          K ZOTETENR
     A          K ZOTEIMEX
     A          K ZOTEGADA
