     A**************************************************************************
     A*  Copyright 2026 by    trend SWM                                        *
     A*                       Verwaltung GmbH                                  *
     A*                       Jechtinger Straße 9                              *
     A*                       DE 79111 Freiburg                                *
     A*  --------------------------------------------------------------------  *
     A*  Zolltarif/Ident-Dateie                                                *
     A*  --------------------------------------------------------------------  *
     A*  Erstellt: ZG 14.01.2026 Case #05780597                                *
     A*  Änderung: XX XX.XX.XXXX                                               *
     A**************************************************************************
     A                                      REF(SWMREF)
     A          R ZOTE1
     A*-------------------------------------------------------------------------
     A            ZOTELOCK  R               REFFLD(##LOCK)
     A            ZOTEJNAM  R               REFFLD(##JNAM)
     A            ZOTEJDAT  R               REFFLD(##JDAT)
     A            ZOTEJZEI  R               REFFLD(##JZEI)
     A            ZOTEUSER  R               REFFLD(##USER)
     A            ZOTEPROG  R               REFFLD(##PROG)
     A            ZOTEBIBL  R               REFFLD(##BIBL)
     A            ZOTEFIRM  R               REFFLD(##FIRM)
     A            ZOTETENR  R               REFFLD(##TENR)
     A            ZOTEZOTN  R               REFFLD(##ZOTN)
     A            ZOTEIMEX       1A         TEXT('Import/Export')
     A                                      COLHDG('Import/Export')
     A            ZOTECODE      20A         TEXT('Unterl-Kodierung')
     A                                      COLHDG('Unterl-Kodierung')
     A            ZOTECBZ1  R  256          REFFLD(##ABEZ)
     A                                      TEXT('Kodierungsbezeich.')
     A                                      COLHDG('Kodierungsbezeich.')
     A            ZOTEGADA  R               REFFLD(##GADA)
     A            ZOTEGBDA  R               REFFLD(##GBDA)
     A            ZOTETSTP  R               REFFLD(##TSTP)
     A            ZOTEERUS  R               REFFLD(##ERUS)
     A            ZOTEFREI  R  120          REFFLD(##FREI)
