     A**                                    UNIQUE
     A          R #IDCOR
     A            DCCODE         6A         TEXT('DOMCODE')
     A            INUMBE        20A         TEXT('ITEMNUM')
     A            IDESCR        60A         TEXT('ITEMDES')
     A            IDCO_          5A         TEXT('IDCO')
     A            REPYEA         4S 0       TEXT('REPYEAR')
     A            REPMON         2S 0       TEXT('REPMONT')
     A            QTY           10S 0       TEXT('QTY')
     A            UNIT           3A         TEXT('UNIT')
     A            ACPAID        10S 0       TEXT('ACTUALP')
     A            CURREN         3A         TEXT('CURRENC')
     A            STK           10S 2       TEXT('STK')
     A            STKPRI         6S 0       TEXT('STKPRIC')
     A            SUPNAM       100A         TEXT('SUPNAME')
     A            SUPTYP         1A         TEXT('SUPPTYP')
     A            SUPCOU         2A         TEXT('SUPPCOU')
     A            DELTER         3A         TEXT('DELIVTE')
     A            PAYTER         3S         TEXT('PAYMTER')
     A            CASHDI         3S 1       TEXT('CASHDIS')
     A            GRPCON         1A         TEXT('GRPCONT')
     A            PROGRP         3A         TEXT('PRODGRP')
     A            PURCHC         4A         TEXT('PURCATE')
