     A**                                    UNIQUE
     A          R #KP0100R
     A            COUNTRY        3A         TEXT(' ')
     A            CUSTOMER       5S 0       TEXT(' ')
     A            BRANCHE        2S 0       TEXT(' ')
     A            S_CHANNEL      2A         TEXT(' ')
     A            C_GROUP        2S 0       TEXT(' ')
     A            SUPPLIER       3A         TEXT(' ')
     A            MODEL_NO      15A         TEXT(' ')
     A            PRICE          9S 2       TEXT(' ')
     A            PR_GROUP       3A         TEXT(' ')
     A            KEYT          35A         TEXT(' ')
     A            RECORD         1A         TEXT(' ')
     A*
     A            KURS           8S 4       TEXT('KURS')
     A            ICS            8S 4       TEXT('ICS')
     A            ICN            8S 4       TEXT('ICN')
     A            EXS            8S 4       TEXT('EXS')
     A            EXN            8S 4       TEXT('EXN')
     A            OEM            8S 4       TEXT('OEM')
     A            GHNETTO        8S 4       TEXT('GHNETTO')
     A            GHRAB          8S 4       TEXT('GHRAB')
     A            RISIKO         8S 4       TEXT('RISIKO')
     A            GK             8S 4       TEXT('GK')
     A            #KURS          8S 4       TEXT('KURS')
     A            #ICS           8S 4       TEXT('ICS')
     A            #ICN           8S 4       TEXT('ICN')
     A            #EXS           8S 4       TEXT('EXS')
     A            #EXN           8S 4       TEXT('EXN')
     A            #OEM           8S 4       TEXT('OEM')
     A            #GHNETTO       8S 4       TEXT('GHNETTO')
     A            #GHRAB         8S 4       TEXT('GHRAB')
     A            #RISIKO        8S 4       TEXT('RISIKO')
     A            #GK            8S 4       TEXT('GK')
     A*
     A            ABS_JAN_VJ     9S 0       TEXT(' ')
     A            ABS_FEB_VJ     9S 0       TEXT(' ')
     A            ABS_MAE_VJ     9S 0       TEXT(' ')
     A            ABS_APR_VJ     9S 0       TEXT(' ')
     A            ABS_MAI_VJ     9S 0       TEXT(' ')
     A            ABS_JUN_VJ     9S 0       TEXT(' ')
     A            ABS_JUL_VJ     9S 0       TEXT(' ')
     A            ABS_AUG_VJ     9S 0       TEXT(' ')
     A            ABS_SEP_VJ     9S 0       TEXT(' ')
     A            ABS_OKT_VJ     9S 0       TEXT(' ')
     A            ABS_NOV_VJ     9S 0       TEXT(' ')
     A            ABS_DEZ_VJ     9S 0       TEXT(' ')
     A*
     A            UMS_JAN_VJ     9S 2       TEXT(' ')
     A            UMS_FEB_VJ     9S 2       TEXT(' ')
     A            UMS_MAE_VJ     9S 2       TEXT(' ')
     A            UMS_APR_VJ     9S 2       TEXT(' ')
     A            UMS_MAI_VJ     9S 2       TEXT(' ')
     A            UMS_JUN_VJ     9S 2       TEXT(' ')
     A            UMS_JUL_VJ     9S 2       TEXT(' ')
     A            UMS_AUG_VJ     9S 2       TEXT(' ')
     A            UMS_SEP_VJ     9S 2       TEXT(' ')
     A            UMS_OKT_VJ     9S 2       TEXT(' ')
     A            UMS_NOV_VJ     9S 2       TEXT(' ')
     A            UMS_DEZ_VJ     9S 2       TEXT(' ')
     A*
     A            ROH_JAN_VJ     9S 2       TEXT(' ')
     A            ROH_FEB_VJ     9S 2       TEXT(' ')
     A            ROH_MAE_VJ     9S 2       TEXT(' ')
     A            ROH_APR_VJ     9S 2       TEXT(' ')
     A            ROH_MAI_VJ     9S 2       TEXT(' ')
     A            ROH_JUN_VJ     9S 2       TEXT(' ')
     A            ROH_JUL_VJ     9S 2       TEXT(' ')
     A            ROH_AUG_VJ     9S 2       TEXT(' ')
     A            ROH_SEP_VJ     9S 2       TEXT(' ')
     A            ROH_OKT_VJ     9S 2       TEXT(' ')
     A            ROH_NOV_VJ     9S 2       TEXT(' ')
     A            ROH_DEZ_VJ     9S 2       TEXT(' ')
     A*
     A            ABS_JAN_LJ     9S 0       TEXT(' ')
     A            ABS_FEB_LJ     9S 0       TEXT(' ')
     A            ABS_MAE_LJ     9S 0       TEXT(' ')
     A            ABS_APR_LJ     9S 0       TEXT(' ')
     A            ABS_MAI_LJ     9S 0       TEXT(' ')
     A            ABS_JUN_LJ     9S 0       TEXT(' ')
     A            ABS_JUL_LJ     9S 0       TEXT(' ')
     A            ABS_AUG_LJ     9S 0       TEXT(' ')
     A            ABS_SEP_LJ     9S 0       TEXT(' ')
     A            ABS_OKT_LJ     9S 0       TEXT(' ')
     A            ABS_NOV_LJ     9S 0       TEXT(' ')
     A            ABS_DEZ_LJ     9S 0       TEXT(' ')
     A*
     A            UMS_JAN_LJ     9S 2       TEXT(' ')
     A            UMS_FEB_LJ     9S 2       TEXT(' ')
     A            UMS_MAE_LJ     9S 2       TEXT(' ')
     A            UMS_APR_LJ     9S 2       TEXT(' ')
     A            UMS_MAI_LJ     9S 2       TEXT(' ')
     A            UMS_JUN_LJ     9S 2       TEXT(' ')
     A            UMS_JUL_LJ     9S 2       TEXT(' ')
     A            UMS_AUG_LJ     9S 2       TEXT(' ')
     A            UMS_SEP_LJ     9S 2       TEXT(' ')
     A            UMS_OKT_LJ     9S 2       TEXT(' ')
     A            UMS_NOV_LJ     9S 2       TEXT(' ')
     A            UMS_DEZ_LJ     9S 2       TEXT(' ')
     A*
     A            ROH_JAN_LJ     9S 2       TEXT(' ')
     A            ROH_FEB_LJ     9S 2       TEXT(' ')
     A            ROH_MAE_LJ     9S 2       TEXT(' ')
     A            ROH_APR_LJ     9S 2       TEXT(' ')
     A            ROH_MAI_LJ     9S 2       TEXT(' ')
     A            ROH_JUN_LJ     9S 2       TEXT(' ')
     A            ROH_JUL_LJ     9S 2       TEXT(' ')
     A            ROH_AUG_LJ     9S 2       TEXT(' ')
     A            ROH_SEP_LJ     9S 2       TEXT(' ')
     A            ROH_OKT_LJ     9S 2       TEXT(' ')
     A            ROH_NOV_LJ     9S 2       TEXT(' ')
     A            ROH_DEZ_LJ     9S 2       TEXT(' ')
