     A**                                    UNIQUE
     A          R #ST0054R
     A            BRANCHE        2S 0       TEXT(' ')
     A            VT1            2S 0       TEXT(' ')
     A            VT2           12S 0       TEXT(' ')
     A            VT3            2S 0       TEXT(' ')
     A            KUNDE          5S 0       TEXT(' ')
     A            NAME_1        25A         TEXT(' ')
     A            NAME_2        25A         TEXT(' ')
     A            PLZ            5S 0       TEXT(' ')
     A            ORT           25A         TEXT(' ')
     A            KGRUPPE        2S 0       TEXT(' ')
     A            ABS_JAN_VJ     9S 0       TEXT(' ')
     A            ABS_FEB_VJ     9S 0       TEXT(' ')
     A            ABS_MAE_VJ     9S 0       TEXT(' ')
     A            ABS_APR_VJ     9S 0       TEXT(' ')
     A            ABS_MAI_VJ     9S 0       TEXT(' ')
     A            ABS_JUN_VJ     9S 0       TEXT(' ')
     A            ABS_JUL_VJ     9S 0       TEXT(' ')
     A            ABS_AUG_VJ     9S 0       TEXT(' ')
     A            ABS_SEP_VJ     9S 0       TEXT(' ')
     A            ABS_OKT_VJ     9S 0       TEXT(' ')
     A            ABS_NOV_VJ     9S 0       TEXT(' ')
     A            ABS_DEZ_VJ     9S 0       TEXT(' ')
     A*
     A            UMS_JAN_VJ     9S 2       TEXT(' ')
     A            UMS_FEB_VJ     9S 2       TEXT(' ')
     A            UMS_MAE_VJ     9S 2       TEXT(' ')
     A            UMS_APR_VJ     9S 2       TEXT(' ')
     A            UMS_MAI_VJ     9S 2       TEXT(' ')
     A            UMS_JUN_VJ     9S 2       TEXT(' ')
     A            UMS_JUL_VJ     9S 2       TEXT(' ')
     A            UMS_AUG_VJ     9S 2       TEXT(' ')
     A            UMS_SEP_VJ     9S 2       TEXT(' ')
     A            UMS_OKT_VJ     9S 2       TEXT(' ')
     A            UMS_NOV_VJ     9S 2       TEXT(' ')
     A            UMS_DEZ_VJ     9S 2       TEXT(' ')
     A*
     A            ROH_JAN_VJ     9S 2       TEXT(' ')
     A            ROH_FEB_VJ     9S 2       TEXT(' ')
     A            ROH_MAE_VJ     9S 2       TEXT(' ')
     A            ROH_APR_VJ     9S 2       TEXT(' ')
     A            ROH_MAI_VJ     9S 2       TEXT(' ')
     A            ROH_JUN_VJ     9S 2       TEXT(' ')
     A            ROH_JUL_VJ     9S 2       TEXT(' ')
     A            ROH_AUG_VJ     9S 2       TEXT(' ')
     A            ROH_SEP_VJ     9S 2       TEXT(' ')
     A            ROH_OKT_VJ     9S 2       TEXT(' ')
     A            ROH_NOV_VJ     9S 2       TEXT(' ')
     A            ROH_DEZ_VJ     9S 2       TEXT(' ')
     A*
     A            ABS_JAN_LJ     9S 0       TEXT(' ')
     A            ABS_FEB_LJ     9S 0       TEXT(' ')
     A            ABS_MAE_LJ     9S 0       TEXT(' ')
     A            ABS_APR_LJ     9S 0       TEXT(' ')
     A            ABS_MAI_LJ     9S 0       TEXT(' ')
     A            ABS_JUN_LJ     9S 0       TEXT(' ')
     A            ABS_JUL_LJ     9S 0       TEXT(' ')
     A            ABS_AUG_LJ     9S 0       TEXT(' ')
     A            ABS_SEP_LJ     9S 0       TEXT(' ')
     A            ABS_OKT_LJ     9S 0       TEXT(' ')
     A            ABS_NOV_LJ     9S 0       TEXT(' ')
     A            ABS_DEZ_LJ     9S 0       TEXT(' ')
     A*
     A            UMS_JAN_LJ     9S 2       TEXT(' ')
     A            UMS_FEB_LJ     9S 2       TEXT(' ')
     A            UMS_MAE_LJ     9S 2       TEXT(' ')
     A            UMS_APR_LJ     9S 2       TEXT(' ')
     A            UMS_MAI_LJ     9S 2       TEXT(' ')
     A            UMS_JUN_LJ     9S 2       TEXT(' ')
     A            UMS_JUL_LJ     9S 2       TEXT(' ')
     A            UMS_AUG_LJ     9S 2       TEXT(' ')
     A            UMS_SEP_LJ     9S 2       TEXT(' ')
     A            UMS_OKT_LJ     9S 2       TEXT(' ')
     A            UMS_NOV_LJ     9S 2       TEXT(' ')
     A            UMS_DEZ_LJ     9S 2       TEXT(' ')
     A*
     A            ROH_JAN_LJ     9S 2       TEXT(' ')
     A            ROH_FEB_LJ     9S 2       TEXT(' ')
     A            ROH_MAE_LJ     9S 2       TEXT(' ')
     A            ROH_APR_LJ     9S 2       TEXT(' ')
     A            ROH_MAI_LJ     9S 2       TEXT(' ')
     A            ROH_JUN_LJ     9S 2       TEXT(' ')
     A            ROH_JUL_LJ     9S 2       TEXT(' ')
     A            ROH_AUG_LJ     9S 2       TEXT(' ')
     A            ROH_SEP_LJ     9S 2       TEXT(' ')
     A            ROH_OKT_LJ     9S 2       TEXT(' ')
     A            ROH_NOV_LJ     9S 2       TEXT(' ')
     A            ROH_DEZ_LJ     9S 2       TEXT(' ')
