      * Physische Datei:
      * ANLEGEDATUM:
      * ÄNDERUNGEN:
      *
     A                                      UNIQUE
     A          R CALENDER                  PFILE(CALENDER)
     A
     A          K $CDATEISO
