     A          R EDI_TECHPR
     A            EDDART         1A         COLHDG('DOKUMENTENART')
     A            EDTESTK        1A         COLHDG('TESTKENNZEI')
     A            EDBELEGNR     15A         COLHDG('BELEGNR')
     A            EDBLDATUM      8A         COLHDG('BELEGDATUM')
     A            EDRECHNR      15A         COLHDG('RECHNR')
     A            EDRECHDA      08A         COLHDG('RECHDATUM')
     A            EDKAUFER      06A         COLHDG('KÄUFER')
     A            EDTLNUMMER    04A         COLHDG('TECHLNUMMER')
     A            EDGLNTECHN    13A         COLHDG('GLNDERTECHO')
     A            EDUSTIDTEC    20A         COLHDG('USTIDTECHNO')
     A            EDVALUDATU    08A         COLHDG('VALUDATUM')
     A            EDFORMATVD    03A         COLHDG('FORMATVALUDA')
     A            EDNAMEKAUF    31A         COLHDG('NAMEKÄUFER')
     A            EDNAMEKAU2    31A         COLHDG('NAMEKÄUFER2')
     A            EDSTRHAUNR    31A         COLHDG('STRHAUSNR')

     A            EDORTNKAUF    31A         COLHDG('ORTSNAMEKÄUF')
     A            EDPLZKAUFE    15A         COLHDG('PLZKÄUFER')
     A            EDLANDKAUF    03A         COLHDG('LANDKÄUFER')
     A            EDSTNRKAUF    20A         COLHDG('STEURNRKAUF')
     A            EDARTSTNRK    01A         COLHDG('ARTSTEUERNRK')
     A            EDSTNRLIEF    20A         COLHDG('STEURNRLIEF')
     A            EDARTSTNRL    01A         COLHDG('ARTSTNRLIEF')
     A            EDWAHRUNRE    03A         COLHDG('WAHRUNGRECH')
     A            EDWAHRUNZA    03A         COLHDG('WAHRUNGZAHL')
     A            EDWECHKURS    17A         COLHDG('WECHSELKURS')
     A            EDWECHDATU    08A         COLHDG('WECHSKUDATUM')
     A            EDZUFRACHT    17A         COLHDG('ZUSCHFRACHTG')
     A            EDPOSITINR    06A         COLHDG('POSITIONSNR')
     A            EDARTIKNRL    22A         COLHDG('ARTKLNRLIEF')
     A            EDARTKLBEZ   120A         COLHDG('ARTIKELBEZEI')
     A            EDBERMENGE    17A         COLHDG('BERECHNMENGE')
     A            EDMASEINHE    03A         COLHDG('MASEINHEIT')
     A            EDEINZELPR    17A         COLHDG('EINZELPREIS')
     A            EDNETTOPRE    09A         COLHDG('NETTOPREIS')
     A            EDPREISEIN    03A         COLHDG('PREISEINHEIT')
     A            EDLSNUMMER    15A         COLHDG('LIEFERSCHENR')
     A            EDLSDATUM     08A         COLHDG('LSDATUM')
     A            EDUSTSATZ     17A         COLHDG('UMSATZSTSATZ')
     A            EDUSTBETR     17A         COLHDG('UMSATZSTBETR')
     A            EDPOSIBETR    17A         COLHDG('POSIBETRAG')
     A            EDBNRKAEUF    15A         COLHDG('BESTNRKAEUFE')
     A            EDBESTDATU    08A         COLHDG('BESTELLDATUM')
     A            EDSTSATZAT    17A         COLHDG('STSATZAUSTTE')
     A            EDSTBETRAT    17A         COLHDG('STEUERBETRAT')
     A            EDNAMEEMPF    31A         COLHDG('NAMEENDEMPFA')
     A            EDNAMEEMP2    31A         COLHDG('NAMEENDEMP2')
     A            EDSTRHNRES    31A         COLHDG('STRHNRENDEMP')
     A            EDORTNAMES    31A         COLHDG('ORTNAMEENDES')
     A            EDPLZENDES    15A         COLHDG('PLZENDEMPFAE')
     A            EDLANDENES    03A         COLHDG('LANDENDEMPFA')
     A            EDABPROSAZ    17A         COLHDG('ABSCHLAGPSAZ')
     A            EDABBETRAG    17A         COLHDG('ABSCHLAGBETR')
     A            EDZUPROSAZ    17A         COLHDG('ZUSCHLAGPSAZ')
     A            EDZUBETRAG    17A         COLHDG('ZUSCHLAGBETR')
     A            EDGESAMTRE    17A         COLHDG('GESAMTBETREC')
     A            EDUMSSTBET    17A         COLHDG('UMSASTBETREC')
     A            EDSTBEAUST    17A         COLHDG('STBETAUSTATE')
     A            EDFILLER      17A         COLHDG('FILLER')
     A          K EDDART
