     A          R EDI_TECHPR
     A            EDDART         1A         COLHDG('DOKUMENTENART')
     A            EDTESTK        1A         COLHDG('TESTKENNZEI')
     A            EDRECHNUNG    15A         COLHDG('RECHNUNG')
     A            EDBLDATUM      8A         COLHDG('BELEGDATUM')
     A            EDRECHNR      15A         COLHDG('RECHNR')
     A            EDRECHDA      08A         COLHDG('RECHDATUM')
     A            EDKAUFER      06A         COLHDG('KÄUFER')
     A            EDTLNUMMER    04A         COLHDG('TECHLNUMMER')
     A            EDGLNTECHN    13A         COLHDG('GLNDERTECHO')
     A            EDUSTIDTEC    20A         COLHDG('USTIDTECHNO')
     A            EDVALUDATU    08A         COLHDG('VALUDATUM')
     A            EDFORMATVD    03A         COLHDG('FORMATVALUDA')
     A            EDNAMEKAUF    31A         COLHDG('NAMEKÄUFER')
     A            EDSTRHAUNR    31A         COLHDG('STRHAUSNR')
     A            EDORTNKAUF    31A         COLHDG('ORTSNAMEKÄUF')
     A            EDPLZKAUFE    15A         COLHDG('PLZKÄUFER')
     A            EDLANDKAUF    03A         COLHDG('LANDKÄUFER')
     A            EDSTNRKAUF    20A         COLHDG('STEURNRKAUF')
     A            EDARTSTNRK    01A         COLHDG('ARTSTEUERNRK')
     A            EDSTNRLIEF    20A         COLHDG('STEURNRLIEF')
     A            EDARTSTNRL    01A         COLHDG('ARTSTNRLIEF')
     A            EDWAHRUNRE    03A         COLHDG('WAHRUNGRECH')
     A            EDWAHRUNZA    03A         COLHDG('WAHRUNGZAHL')
     A            EDWECHKURS    17A         COLHDG('WECHSELKURS')
     A            EDWECHDAZU    08A         COLHDG('WECHSKUDATUM')
     A            EDZUFRACHT    17A         COLHDG('ZUSCHFRACHTG')
     A            EDSATZART     02A         COLHDG('SATZART')
     A            EDFIRMENNR    02A         COLHDG('FIRMENNUMMER')
     A            EDKUNDENNR    10A         COLHDG('KUNDENNUMMER')
     A            EDBELEGNR     10A         COLHDG('BELEGNUMMER')
     A            EDLSNR        10A         COLHDG('LSNUMMER')
     A            EDLSDATUMM    08A         COLHDG('LSDATUMM')
     A            EDWDKANUB     20A         COLHDG('WDKANUBNR')
     A            EDLIEFARNR    20A         COLHDG('LIEFARTKNR')
     A            EDMENGENSC    01A         COLHDG('MENGENSCHL')
     A            EDQUALITKZ    01A         COLHDG('QUALITKENNZ')
     A            EDMENGE       06A         COLHDG('MENGE')
     A            EDLPSTUECK    08A         COLHDG('LISTENPSTUECK')
     A            EDPOSIRECH    10A         COLHDG('POSIWERTRECH')
     A            EDBORABATT    02A         COLHDG('BONUSRABATTS')
     A            EDKENNLAST    01A         COLHDG('KENNZLAGERSTR')
     A            EDFILIANR     05A         COLHDG('FILIALNR')
     A            EDBESTFILI    10A         COLHDG('BESTELLFILIA')
     A            EDRECHGUTD    08A         COLHDG('RECHGUTDATU')
     A            EDARTKBEZE    50A         COLHDG('ARTIKELBEZEI')
     A            EDZEILENEN    02A         COLHDG('ZEILENENDE')
     A            EDPOSITINR    06A         COLHDG('POSITIONSNR')
     A            EDARTIKNRL    22A         COLHDG('ARTKLNRLIEF')
     A            EDARTKLBEZ   120A         COLHDG('ARTIKELBEZEI')
     A            EDBERMENGE    17A         COLHDG('BERECHNMENGE')
     A            EDMASEINHE    03A         COLHDG('MASEINHEIT')
     A            EDBRUTTOPR    17A         COLHDG('BRUTTOPREIS')
     A            EDNETTOPRE    09A         COLHDG('NETTOPREIS')
     A            EDPREISEIN    03A         COLHDG('PREISEINHEIT')
     A            EDLSNUMMER    15A         COLHDG('LIEFERSCHENR')
     A            EDLSDATUM     08A         COLHDG('LSDATUM')
     A            EDUSTSATZ     17A         COLHDG('UMSATZSTSATZ')
     A            EDUSTBETR     17A         COLHDG('UMSATZSTBETR')
     A            EDPOSIBETR    17A         COLHDG('POSIBETRAG')
     A            EDBNRKAEUF    15A         COLHDG('BESTNRKAEUFE')
     A            EDBESTDATU    08A         COLHDG('BESTELLDATUM')
     A            EDSTSATZAT    17A         COLHDG('STSATZAUSTTE')
     A            EDSTBETRAT    17A         COLHDG('STEUERBETRAT')
     A            EDNAMEEMPF    31A         COLHDG('NAMEENDEMPFA')
     A            EDSTRHNRES    31A         COLHDG('STRHNRENDEMP')
     A            EDORTNAMES    31A         COLHDG('ORTNAMEENDES')
     A            EDPLZENDES    15A         COLHDG('PLZENDEMPFAE')
     A            EDLANDENES    03A         COLHDG('LANDENDEMPFA')
     A            EDABPROSAZ    17A         COLHDG('ABSCHLAGPSAZ')
     A            EDABBETRAG    17A         COLHDG('ABSCHLAGBETR')
     A            EDZUPROSAZ    17A         COLHDG('ZUSCHLAGPSAZ')
     A            EDZUBETRAG    17A         COLHDG('ZUSCHLAGBETR')
     A          K EDDART
