     A****                                  UNIQUE
     A          R EPIM                      TEXT('KATALOGE EPIM')
     A            SENTENCE     132A         COLHDG('AUSGABE')
