      * Physische Datei: F3 STRUKTUR
      * ANLEGEDATUM: FEBRUAR 2010
      * ÄNDERUNGEN:
      *
     A*                                     UNIQUE
     A          R F3                        PFILE(F3)
     A                                      TEXT('STRUKTUR F3')
     A          K FAK1010
     A          K FAK1020
     A          K FAK3090
     A          K FAK1040
