     A**                                    UNIQUE
     A          R FAKTURA_U
     A            FAK1010        2S 0       TEXT('FIRMA              ')
     A            FAK1020        5S 0       TEXT('KUNDEN-NUMMER      ')
     A            FAK1030        6S 0       TEXT('AUFTRAGS-NUMMER    ')
     A            FAK1040        2S 0       TEXT('AUFTRAGS-ART       ')
     A            FAK1750        6S 0       TEXT('RECHNUNGS-NUMMER   ')
     A            FAK3380        6S 0       TEXT('RECHNUNGS DATUM    ')
     A            FAK5100        3A         TEXT('ARTIKEL-GRUPPE     ')
     A            FAK5090       15A         TEXT('VERKAUFSARTIKEL-   ')
     A            FAK5750        9S 2       TEXT('WAREN WERT IN WÄ   ')
     A            FAK5580        9S 2       TEXT('WERTE - ROHERLÖS   ')
     A            KDS210         2A         TEXT('BRANCHE            ')
     A            KDS230         7A         TEXT('MITGLIEDSNR. VERBAN')
     A            KDS360         5A         TEXT('KUNDEN-NR. DEBITOR ')
     A            KDS760         5A         TEXT('INTERN  KOSTENSTELL')
     A            FAK1170        3A         TEXT('HINWEIS GARANTIE   ')
     A            FRACHT         1A         TEXT('FRACHT             ')
     A            ENTW           1A         TEXT('ENTWICKLUNG        ')
     A            WERB           1A         TEXT('WERBUNG            ')
     A            GARANT1        1A         TEXT('GARANTIE 1         ')
     A            GARANT2        1A         TEXT('GARANTIE 2         ')
     A            UMSATZ         1A         TEXT('UMSATZ             ')
     A            FREE           1A         TEXT('FREE               ')
     A            PROTOKOLL     20A         TEXT('PROTOKOLL          ')
     A            DATUMEURO       L         TEXT('DATUM EURO         ')
     A            DATUM           L         TEXT('DATE               ')
     A            TIMESTAMPP      Z         TEXT('TIMESTAMP          ')
     A**                                    UNIQUE
