     A*         CARRIAGE RETURN BZW. LINE FEED AM ENDE SETZEN
     A          R HELLADRR
     A            H1EMPFAEN     10A         COLHDG('Empfänger')
     A                                      TEXT('Empfänger')
     A            H1NAME01      35A         COLHDG('Name01')
     A                                      TEXT('Name01')
     A            H1NAME02      35A         COLHDG('Name02')
     A                                      TEXT('Name02')
     A            H1STRASSE     35A         COLHDG('Strasse')
     A                                      TEXT('Strasse')
     A            H1ORT         35A         COLHDG('Ort')
     A                                      TEXT('Ort')
     A            H1PLZ         17A         COLHDG('Plz')
     A                                      TEXT('Plz')
     A            H1LANDISO      2A         COLHDG('LandIsoKz')
     A                                      TEXT('LandIsoKz')
     A            H1ANPARTN     35A         COLHDG('Ansprechpartner')
     A                                      TEXT('Ansprechpartner')
     A            H1TELEFON     25A         COLHDG('Telefon')
     A                                      TEXT('Telefon')
     A            H1TELEFAX     25A         COLHDG('Telefax')
     A                                      TEXT('Telefax')
     A            H1EMAIL      512A         COLHDG('Email')
     A                                      TEXT('Email')
     A            H1MATCHC      35A         COLHDG('Matchcode')
     A                                      TEXT('Matchcode')
