     A**                                    UNIQUE
     A          R IFFAKTR
     A            IFF001         2S 0       TEXT('                   ')
     A            IFF002         5P 0       TEXT('                   ')
     A            IFF003         5P 0       TEXT('                   ')
     A            IFF004         4S 0       TEXT('                   ')
     A            IFF005         7P 0       TEXT('                   ')
     A            IFF006         7P 0       TEXT('                   ')
     A            IFF007         7P 0       TEXT('                   ')
     A            IFF008         3S 0       TEXT('                   ')
     A            IFF009         7P 0       TEXT('                   ')
     A            IFF010         4A         TEXT('                   ')
     A            IFF011         6S 0       TEXT('                   ')
     A            IFF012         7P 0       TEXT('                   ')
     A            IFF013         1A         TEXT('                   ')
     A            IFF014         6S 0       TEXT('                   ')
     A            IFF015        11P 2       TEXT('                   ')
     A            IFF016         1A         TEXT('                   ')
     A            IFF017         1A         TEXT('                   ')
     A            IFF018         2A         TEXT('                   ')
     A            IFF019         2A         TEXT('                   ')
     A            IFF020         5P 0       TEXT('                   ')
     A            IFF021         5P 0       TEXT('                   ')
     A            IFF022         3A         TEXT('                   ')
     A            IFF023         5A         TEXT('                   ')
     A            IFF024        12A         TEXT('                   ')
     A            IFF025         7P 0       TEXT('                   ')
     A            IFF026         7P 0       TEXT('                   ')
     A            IFF027         3P 0       TEXT('                   ')
     A            IFF028         3P 0       TEXT('                   ')
     A            IFF029         1A         TEXT('                   ')
     A            IFF030         1A         TEXT('                   ')
     A            IFF031         4A         TEXT('                   ')
     A            IFF032        11P 4       TEXT('                   ')
     A            IFF033        11P 0       TEXT('                   ')
     A            IFF034        10A         TEXT('                   ')
     A            IFF035        13P 0       TEXT('                   ')
     A            IFF036        10A         TEXT('                   ')
     A            IFF037         5P 0       TEXT('                   ')
     A            IFF038         1A         TEXT('                   ')
     A            IFF039         9A         TEXT('                   ')
     A**                                    UNIQUE
