     A          R INTERF1024
     A            INTERF1024  1024A         COLHDG('Ausgabe 1024 Bytes')
     A                                      TEXT('Ausgabe 1024 Bytes')
