     A**                                    UNIQUE
     A          R #SATZ
     A            LIB           10A         TEXT(' ')
     A            AI             1A         TEXT(' ')
     A*
