     A          R ART00R1
     A            AND010         3A
     A            AND020         3A
     A            AND030        12A
     A            AND040        12A
     A            AND050         8S 0
     A            AND060         6S 0
     A            AND070         1A
     A            AND080         1A
     A            AND090        17A
     A            AND999         1A
     A            ART010    R               REFFLD(FIRMA FLDREF)
     A                                      TEXT('Firma')
     A                                      COLHDG('Firma')
     A            ART020    R               REFFLD(LIEFERANT FLDREF)
     A                                      TEXT('Lieferant')
     A                                      COLHDG('Lief.')
     A            ART030    R               REFFLD(ARTIKELNR FLDREF)
     A                                      TEXT('Artikel-Nr.')
     A                                      COLHDG('Artikel-Nr.')
     A            ART040    R               REFFLD(ARTGRUPPE FLDREF)
     A                                      TEXT('Art-Grp.')
     A                                      COLHDG('AGR')
     A            ART050    R               REFFLD(STATNR FLDREF)
     A                                      TEXT('Statistik-Nr.')
     A                                      COLHDG('Stat.' -
     A                                      'Nr.')
     A            ART060    R               REFFLD(BEZ30 FLDREF)
     A                                      TEXT('Artikel-Bezeichnung')
     A                                      COLHDG('Artikel-Bezeichnung')
     A            ART070    R               REFFLD(LIEFERANT FLDREF)
     A                                      TEXT('Bestandsart. Lieferant')
     A                                      COLHDG('Bstd.' -
     A                                      'Lief.')
     A            ART080    R               REFFLD(ARTIKELNR FLDREF)
     A                                      TEXT('Artikel-Nr.')
     A                                      COLHDG('Bestands' -
     A                                      'Artikel-Nr.')
     A            ART090    R               REFFLD(LIEFERANT FLDREF)
     A                                      TEXT('Ersatzartikel Lieferant')
     A                                      COLHDG('Ers.' -
     A                                      'Art.' -
     A                                      'Lief')
     A            ART100    R               REFFLD(ARTIKELNR FLDREF)
     A                                      TEXT('Ersatzartikel  Artikel-Nr.')
     A                                      COLHDG('Ersatz' -
     A                                      'Artikel-Nr.')
     A            ART110    R               REFFLD(LIEFERANT FLDREF)
     A                                      TEXT('Bestell-Artikel Lief.')
     A                                      COLHDG('Bst.' -
     A                                      'Art.' -
     A                                      'Lief.')
     A            ART120    R               REFFLD(ARTIKELNR FLDREF)
     A                                      TEXT('Bestellartikel Artikel-Nr.')
     A                                      COLHDG('Bestell' -
     A                                      'Artikel-Nr.')
     A            ART130    R               REFFLD(MENGENEINH FLDREF)
     A                                      TEXT('ME')
     A                                      COLHDG('ME')
     A            ART140    R               REFFLD(PREISEINH FLDREF)
     A                                      TEXT('PE')
     A                                      COLHDG('PE')
     A            ART150    R               REFFLD(KZMWST FLDREF)
     A                                      TEXT('MwSt')
     A                                      COLHDG('MwSt')
     A            ART160    R               REFFLD(KZ01 FLDREF)
     A                                      TEXT('Austauschteil')
     A                                      COLHDG('AT')
     A            ART170    R               REFFLD(KZ012 FLDREF)
     A                                      TEXT('Ersatzteil')
     A                                      COLHDG('ET')
     A            ART180    R               REFFLD(KZABC FLDREF)
     A                                      TEXT('ABC')
     A                                      COLHDG('ABC')
     A            ART190    R               REFFLD(KZ01 FLDREF)
     A                                      TEXT('Seriennr.')
     A                                      COLHDG('SNr.')
     A            ART200    R               REFFLD(KZ01 FLDREF)
     A                                      TEXT('Automatische Bestellung')
     A                                      COLHDG('aut' -
     A                                      'Bst')
     A            ART210    R               REFFLD(LAND FLDREF)
     A                                      TEXT('Ursprungsland')
     A                                      COLHDG('Ursp' -
     A                                      'Land')
     A            ART220    R               REFFLD(ZOLLTARINR FLDREF)
     A                                      TEXT('Zolltarif-Nr.')
     A                                      COLHDG('Zolltarif-Nr.')
     A            ART230    R               REFFLD(ANZAHL5P FLDREF)
     A                                      TEXT('Pack-Inhalt')
     A                                      COLHDG('Pack-' -
     A                                      'Inhalt')
     A            ART240    R               REFFLD(GEWKG4V3P FLDREF)
     A                                      TEXT('Gewicht in kg')
     A                                      COLHDG('Gew.kg')
     A            ART250    R               REFFLD(KUBIKM2V3P FLDREF)
     A                                      TEXT('Kubikmeter')
     A                                      COLHDG('m3')
     A            ART260    R               REFFLD(ANZAHL2P FLDREF)
     A                                      TEXT('Anz.Kolli.')
     A                                      COLHDG('Anz.' -
     A                                      'Kolli')
     A            ART270    R               REFFLD(PREIS7V2P FLDREF)
     A                                      TEXT('VK-Preis 1')
     A                                      COLHDG('VK-Preis1')
     A            ART280    R               REFFLD(DATUMJMTP FLDREF)
     A                                      TEXT('Datum 1')
     A                                      COLHDG('Datum 1')
     A            ART290    R               REFFLD(PREIS7V2P FLDREF)
     A                                      TEXT('VK-Preis 2')
     A                                      COLHDG('VK-Preis2')
     A            ART300    R               REFFLD(DATUMJMTP FLDREF)
     A                                      TEXT('Datum 2')
     A                                      COLHDG('Datum 2')
     A            ART310    R               REFFLD(PREIS7V2P FLDREF)
     A                                      TEXT('VK-Preis 3')
     A                                      COLHDG('VK-Preis3')
     A            ART320    R               REFFLD(DATUMJMTP FLDREF)
     A                                      TEXT('Datum 3')
     A                                      COLHDG('Datum3')
     A            ART330    R               REFFLD(PREIS9V2P FLDREF)
     A                                      TEXT('EK-Preis in Fremdwährung')
     A                                      COLHDG('EK-Pr.Fremdw.')
     A            ART340    R               REFFLD(WAEHRUNG FLDREF)
     A                                      TEXT('Währungsschlüssel')
     A                                      COLHDG('Währungs-' -
     A                                      'schlüssel')
     A            ART350    R               REFFLD(KZBRUTNET FLDREF)
     A                                      TEXT('Brutto/Netto-Kennzeichen')
     A                                      COLHDG('B' -
     A                                      '/' -
     A                                      'N')
     A            ART360    R               REFFLD(KZBRUTNET FLDREF)
     A                                      TEXT('?')
     A                                      COLHDG('B/N' -
     A                                      'VK')
     A            ART370    R               REFFLD(MULTIP1V4P FLDREF)
     A                                      TEXT('Multiplikator VK')
     A                                      COLHDG('M.VK')
     A            ART375    R               REFFLD(RAB3V2P FLDREF)
     A                                      TEXT('Rabatt EK')
     A                                      COLHDG('Rab.EK')
     A            ART380    R               REFFLD(PROZ3V2P FLDREF)
     A                                      TEXT('%-Satz Roherlöse')
     A                                      COLHDG('%-Roh')
     A            ART390    R               REFFLD(ARTZUSATZ FLDREF)
     A                                      TEXT('Artikel-Zusatz 1')
     A                                      COLHDG('Art-Zus1')
     A            ART400    R               REFFLD(ARTZUSATZ FLDREF)
     A                                      TEXT('Artikel-Zusatz2')
     A                                      COLHDG('Art-Zus2')
     A            ART410    R               REFFLD(KZ01 FLDREF)
     A                                      TEXT('kostenlos')
     A                                      COLHDG('kl')
     A            ART420    R               REFFLD(KZ01 FLDREF)
     A                                      TEXT('Eigenproduktion')
     A                                      COLHDG('EP')
     A            ART430    R               REFFLD(KZ01 FLDREF)
     A                                      TEXT('Diverse')
     A                                      COLHDG('Div')
     A            ART440    R               REFFLD(KZ01 FLDREF)
     A                                      TEXT('Maschine')
     A                                      COLHDG('Ma')
     A            ART450    R               REFFLD(KZZUSATZ FLDREF)
     A                                      TEXT('Zusatz')
     A                                      COLHDG('Zus')
     A            ART460    R               REFFLD(ANZAHL1 FLDREF)
     A                                      TEXT('Anzahl Nachkommastellen')
     A                                      COLHDG('NK')
     A            ART470    R               REFFLD(METALLZU FLDREF)
     A                                      TEXT('Metall-Zuschlag 1')
     A                                      COLHDG('Mz1')
     A            ART480    R               REFFLD(METALLZU FLDREF)
     A                                      TEXT('Metall-Zuschlag 2')
     A                                      COLHDG('Mz2')
     A            ART490    R               REFFLD(TEUERUNGSZ FLDREF)
     A                                      TEXT('Teuerungszuschlag')
     A                                      COLHDG('Tz')
     A            ART500    R               REFFLD(KZTEXT FLDREF)
     A                                      TEXT('T=Text')
     A                                      COLHDG('T')
     A            ART510    R               REFFLD(LIEFERANT FLDREF)
     A                                      TEXT('Aktueller Lieferant')
     A                                      COLHDG('akt.' -
     A                                      'Lief')
     A            ART520    R               REFFLD(TEXTBSTN5P FLDREF)
     A                                      TEXT('Textbaustein 1')
     A                                      COLHDG('Txt1')
     A            ART530    R               REFFLD(TEXTBSTN5P FLDREF)
     A                                      TEXT('Textbaustein 2')
     A                                      COLHDG('Txt2')
     A            ART540    R               REFFLD(TEXTBSTN5P FLDREF)
     A                                      TEXT('Textbaustein 3')
     A                                      COLHDG('Txt3')
     A            ART550    R               REFFLD(ARTZUSATZ FLDREF)
     A                                      TEXT('Arikelzusatz 3')
     A                                      COLHDG('Art-Zus3')
     A            ART940    R               REFFLD(PREIS7V2P FLDREF)
     A                                      TEXT('Beziehungs-Preis')
     A                                      COLHDG('Beziehungs' -
     A                                      'Preis')
     A            ART950    R               REFFLD(PREIS7V2P FLDREF)
     A                                      TEXT('Endverbraucher-Preis')
     A                                      COLHDG('Endverbr.' -
     A                                      'Preis')
     A            ART960    R               REFFLD(PREIS7V2P FLDREF)
     A                                      TEXT('Rückverg. Grenz Preis')
     A                                      COLHDG('Rückverg.' -
     A                                      'Grenz' -
     A                                      'Preis')
     A            ART970    R               REFFLD(DATUMJMTP FLDREF)
     A                                      TEXT('Datum EKP')
     A                                      COLHDG('Datum EKP')
     A            ART980    R               REFFLD(PREIS7V2P FLDREF)
     A                                      TEXT('Aktueller EK')
     A                                      COLHDG('aktueller' -
     A                                      'EK')
     A            ART999    R               REFFLD(STATUS FLDREF)
     A                                      TEXT('Status')
     A                                      COLHDG('KZ')
     A            ART610    R               REFFLD(BEREICH FLDREF)
     A                                      TEXT('Bereich')
     A                                      COLHDG('Ber')
     A            ART620    R               REFFLD(MATCHC10 FLDREF)
     A                                      TEXT('Matchcode 1')
     A                                      COLHDG('Matchcode1')
     A            ART630    R               REFFLD(MATCHC10 FLDREF)
     A                                      TEXT('Matchcode 2')
     A                                      COLHDG('Matchcode2')
     A            ART640    R               REFFLD(MATCHC10 FLDREF)
     A                                      TEXT('Matchcode 3')
     A                                      COLHDG('Matchcode3')
     A            ART650    R               REFFLD(LIEFERANT FLDREF)
     A                                      TEXT('VK-Gruppe Lieferant')
     A                                      COLHDG('VK' -
     A                                      'Grp.' -
     A                                      'Lief')
     A            ART655    R               REFFLD(ARTGRUPPE FLDREF)
     A                                      TEXT('VK-Artikel-Gruppe')
     A                                      COLHDG('VK' -
     A                                      'Art' -
     A                                      'Grp')
     A            ART660    R               REFFLD(LIEFERANT FLDREF)
     A                                      TEXT('EK-Gruppe Lieferant')
     A                                      COLHDG('EK' -
     A                                      'Grp.' -
     A                                      'Lief')
     A            ART665    R               REFFLD(ARTGRUPPE FLDREF)
     A                                      TEXT('EK-Artikel-Gruppe')
     A                                      COLHDG('EK-ARG')
     A            ART670    R               REFFLD(RAB3V2P FLDREF)
     A                                      TEXT('Rabatt EK')
     A                                      COLHDG('Rabatt' -
     A                                      'EK')
     A            ART680    R               REFFLD(PREIS7V2P FLDREF)
     A                                      TEXT('Katalog Preis')
     A                                      COLHDG('Katalog-' -
     A                                      'Preis')
     A            ART690    R               REFFLD(KZ01 FLDREF)
     A                                      TEXT('1=EKP. für Roherlöse')
     A                                      COLHDG('EK' -
     A                                      'PrRo' -
     A                                      'Erl')
     A            ART700    R               REFFLD(KZ01 FLDREF)
     A                                      TEXT('Preis-Band')
     A                                      COLHDG('Pr' -
     A                                      'Bd')
     A            ART710    R               REFFLD(KZ01 FLDREF)
     A                                      TEXT('Kata-Kalkulation')
     A                                      COLHDG('Kat' -
     A                                      'Kal')
     A            ART985    R               REFFLD(PREIS7V2P FLDREF)
     A                                      TEXT('EK-Preis inc. Zuschläge')
     A                                      COLHDG('EK-Preis' -
     A                                      'inc.' -
     A                                      'Zuschläge')
     A            ART720    R               REFFLD(KZ01 FLDREF)
     A                                      TEXT('Abwertg.')
     A                                      COLHDG('Abw')
     A            ARTBED    R               REFFLD(BEDIENER FLDREF)
     A                                      TEXT('Bediener')
     A                                      COLHDG('Bed')
     A          K ART010
     A          K ART020
     A          K ART030
