     A*%%TS  SD  19990510  140018  GANG        REL-V4R2M0  5769-PW1
     A*------------------------------------------------------------------------
     A*GANG, MANFRED                                                  ---------
     A*-------------                                                  ---------
     A*SUBFILESTEUERUNG                                               ---------
     A*VARIABLER BILDSCHIRMDEFINITION DS3/DS4                         ---------
     A*WINDOW-FUNKTION                                                ---------
     A*MESSAGES ÜBER SUBFILE                                          ---------
     A*BERECHTIGUNGSPLAUSIBILITÄT                                     ---------
     A*------------------------------------------------------------------------
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      PRINT
     A  35                                  CF01
     A  82                                  CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A  83                                  CF06
     A  36                                  CF07
     A  36                                  CF08
     A  40                                  CF09
     A                                      CF10
     A  37                                  CF11
     A                                      CA12
     A  82
     AO 83                                  CF14
     A  83                                  CF15
     A  82
     AO 83                                  CF16
     A  39                                  CF17
     A  39                                  CF18
     A  38                                  CF19
     A  38                                  CF20
     A  85                                  CF21
     A  87                                  CF22
     A  84                                  CF23
     A  29                                  CF24
     A                                      HELP(01)
     A                                      VLDCMDKEY(99)
     A*------------------------------------------------------------------------
     A*PSEUDO-SATZ                                                    ---------
     A*------------------------------------------------------------------------
     A          R SYS0015D0
     A*%%TS  SD  19990420  162614  GANG        REL-V4R2M0  5769-PW1
     A                                      TEXT('Pseudo-Satz')
     A                                      ASSUME
     A  33                                  DSPMOD(*DS4)
     A                                      OVERLAY
     A                                 24 80' '
     A  *DS4                           27132
     A*------------------------------------------------------------------------
     A*WINDOWDEFINITION + FUßFORMATE                                  ---------
     A*------------------------------------------------------------------------
     A          R SYS0015D1
     A*%%TS  SD  19990420  162614  GANG        REL-V4R2M0  5769-PW1
     A                                      TEXT('Window')
     A                                      RTNCSRLOC(&§§CRR &§§CRF &§§CRP)
     A  33                                  DSPMOD(*DS4)
     A                                      CSRLOC(§§CRLN §§CRCL)
     A                                      OVERLAY
     A                                      PUTOVR
     A                                      OVRDTA
     A                                      OVRATR
     A  *DS3                                WINDOW(&§§YP &§§XP 20 74)
     A  *DS4                                WINDOW(&§§YP &§§XP 20 74)
     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
     A                                          '))
     A            §§CRLN         3  0H
     A            §§CRCL         3  0H
     A            §§XP           3S 0P
     A            §§YP           2S 0P
     A            §§CRR         10A  H
     A            §§CRF         10A  H
     A            §§CRP          4S 0H
     A            D2FT01        74A  O 18  1COLOR(BLU)
     A*------------------------------------------------------------------------
     A*SUBFILESATZ-STRUKTUR                                           ---------
     A*------------------------------------------------------------------------
     A          R SYS0015S1                 SFL
     A*%%TS  SD  19990510  134509  GANG        REL-V4R2M0  5769-PW1
     A                                      TEXT('Subfile Dateifelder für Kondi-
     A                                      tionendatei')
     A  34                                  SFLNXTCHG
     A            §§OP           1A  P
     A            §§PRF          1A  P
     A            §§DESC         1A  P
     A            S1RRN         15S 0H
     A            S1F1RR        15S 0H
     A            H1PRF     R        H      REFFLD(SYSPROFPFR/S5PRF *LIBL/SYSPR-
     A                                      OFPF)
     A            H1USRP    R        H      REFFLD(SYSPROFPFR/S5USRP *LIBL/SYSP-
     A                                      ROFPF)
     A            H1DESC    R        H      REFFLD(SYSPROFPFR/S5DESC *LIBL/SYSP-
     A                                      ROFPF)
     A            S1OP           1A  B  8  1
     A  60                                  DSPATR(PC)
     A                                      DSPATR(&§§OP)
     A            S1PRF     R        B  8  3REFFLD(SYSPROFPFR/S5PRF *LIBL/SYSPR-
     A                                      OFPF)
     A  62                                  DSPATR(PC)
     A                                      DSPATR(&§§PRF)
     A            S1USRP    R        H      REFFLD(SYSPROFPFR/S5USRP *LIBL/SYSP-
     A                                      ROFPF)
     A            S1DESC    R        B  8 14REFFLD(SYSPROFPFR/S5DESC *LIBL/SYSP-
     A                                      ROFPF)
     A  70                                  DSPATR(PC)
     A                                      DSPATR(&§§DESC)
     A                                      CHECK(LC)
     A*------------------------------------------------------------------------
     A*SUBFILE-CONTROL-SATZ                                           ---------
     A*------------------------------------------------------------------------
     A          R SYS0015C1                 SFLCTL(SYS0015S1)
     A*%%TS  SD  19990510  140018  GANG        REL-V4R2M0  5769-PW1
     A  *DS3                                SFLSIZ(0010)
     A  *DS4                                SFLSIZ(0010)
     A  *DS3                                SFLPAG(0009)
     A  *DS4                                SFLPAG(0009)
     A  *DS3                                WINDOW(SYS0015D1)
     A  *DS4                                WINDOW(SYS0015D1)
     A                                      CHANGE(34)
     A                                      RTNCSRLOC(&§§CRR &§§CRF &§§CRP)
     A  33                                  DSPMOD(*DS4)
     A                                      CSRLOC(§§CRLN     §§CRCL)
     A                                      OVERLAY
     A                                      PUTOVR
     A                                      OVRDTA
     A                                      OVRATR
     A                                      SFLCSRRRN(&§§CRN)
     A  31                                  SFLDSP
     A  31                                  SFLDSPCTL
     A N31                                  SFLCLR
     A* 99
     A*N99                                  SFLEND(*MORE)
     A  98                                  SFLEND(*MORE)
     A            §§CRLN         3S 0H
     A            §§CRCL         3S 0H
     A            §§CRR         10A  H
     A            §§CRF         10A  H
     A            §§CRP          4S 0H
     A            §§CRN          5S 0H
     A            §§KW           1A  P
     A            §§§S01         1A  P
     A            §§§V01         1A  P
     A            SFLDR1         4S 0H      SFLRCDNBR(CURSOR)
     A            §§§JOB        10A  O  1  1TEXT('Jobname')
     A                                      COLOR(BLU)
     A N82N83N84                        1 26' Anzeige Auswahl Profile '
     A                                      DSPATR(RI)
     A  82
     AO 83
     AO 84                              1 27' Pflege Auswahl Profile '
     A                                      DSPATR(HI)
     A                                      DSPATR(RI)
     A            §§§PGM        10A  O  1 65TEXT('Programmname')
     A                                      COLOR(BLU)
     A                                  2  1USER
     A                                      COLOR(BLU)
     A            LDADTD         8Y 0O  2 65EDTWRD('  .  .    ')
     A                                      COLOR(BLU)
     A            TIMEX          6Y 0O  3 65EDTWRD('  :  :  ')
     A*                                 3 65TIME
     A                                      COLOR(BLU)
     A                                  4  1'(N=Neu Ä=Aen L=Loe A=Enter/Anz)'
     A                                  4 48' Kennwort:'
     A N82N83N84                            DSPATR(ND)
     A            C1KW           4A  B  4 59DSPATR(&§§KW)
     A  61                                  DSPATR(PC)
     A                                  6  1' Profile ab: '
     A            KEYS01    R        H      REFFLD(SYSPROFPFR/S5USRP *LIBL/SYSP-
     A                                      ROFPF)
     A            KEYS02    R        B  6 15REFFLD(SYSPROFPFR/S5PRF  *LIBL/SYSP-
     A                                      ROFPF)
     A                                      DSPATR(&§§§S01)
     A                                      CHANGE(26)
     A N82N83N84                            DSPATR(PC)
     A                                  7  1'  Profile    Beschreibung         -
     A                                                                         -
     A                                           '
     A                                      DSPATR(UL)
     A                                  6 46' Anwender: '
     A            KEYV01    R        B  6 59REFFLD(SYSPROFPFR/S5USRP *LIBL/SYSP-
     A                                      ROFPF)
     A                                      DSPATR(&§§§V01)
     A N82N83N84                            DSPATR(PC)
     A            KEYV02    R        H      REFFLD(SYSPROFPFR/S5USRP *LIBL/SYSP-
     A                                      ROFPF)
     A            KEYB01    R        H      REFFLD(SYSPROFPFR/S5PRF *LIBL/SYSPR-
     A                                      OFPF)
     A            KEYB02    R        H      REFFLD(SYSPROFPFR/S5USRP *LIBL/SYSP-
     A                                      ROFPF)
     A*------------------------------------------------------------------------
     A*MESSAGE-SUBFILE                                                ---------
     A*------------------------------------------------------------------------
     A* NACHRICHTEN-SUBFILE
     A          R MSGSFL                    SFL
     A*%%TS  SD  19980717  135441  GANG        REL-V3R2M0  5763-PW1
     A                                      TEXT('Nachrichten-Subfile')
     A  *DS3                                SFLMSGRCD(19)
     A  *DS4                                SFLMSGRCD(19)
     A            §§§MKY                    SFLMSGKEY
     A            §§§PGQ                    SFLPGMQ(10)
     A*
     A*-------------------------------------------------------------------------
     A*
     A          R MSGSFLC                   SFLCTL(MSGSFL)
     A*%%TS  SD  19980717  131740  GANG        REL-V3R2M0  5763-PW1
     A  33                                  DSPMOD(*DS4)
     A                                      OVERLAY
     A                                      PUTOVR
     A                                      OVRDTA
     A                                      OVRATR
     A                                      SFLDSP
     A                                      SFLDSPCTL
     A                                      SFLINZ
     A  99
     AON99                                  SFLEND
     A  *DS3                                SFLSIZ(0002)
     A  *DS4                                SFLSIZ(0002)
     A  *DS3                                SFLPAG(0001)
     A  *DS4                                SFLPAG(0001)
     A  *DS3                                WINDOW(SYS0015D1)
     A  *DS4                                WINDOW(SYS0015D1)
     A            §§§PGQ                    SFLPGMQ(10)
