      * Physische Datei: WAEEDIHP
      * ANLEGEDATUM: FEBRUAR 2010
      * ÄNDERUNGEN:
      *
     A          R EDIHPF0                   PFILE(WAEEDIHP)
     A          K EDIH030
     A          K EDIH080                   DESCEND
