/*    * PROGRAMMNAME.:TIMU001C                                               */
/*    * FUNKTION.....:CALL TIMU001C                                          */
/*    *               ...                                                    */
/*    * 2004                                                                  */
/*    *                                                                       */
/*    * FASERWERKE-LINGEN GMBH                                                */
/*    * DARMER ESCH 75                                                        */
/*    * 49811 LINGEN                                                          */
/*    *                                                                       */
/*    *-ÄNDERUNGSDIENST-------------------------------------------------------*/
/*    * XX.XX.XX                                              PGMR.....       */
/*    * 04.07.2001                                            GANG            */
/******************************************************************************/
             PGM

/*       SONSTIGES                                          */
             DCL        VAR(&FWLFIRM) TYPE(*CHAR) LEN(01)
/*----------------------------------------------------------------------------*/
             CRTPF      FILE(EDV/§§TBARTY) SRCMBR(TBARTY) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBARTY)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBART0) SRCMBR(TBART0) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBART0)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBART1) SRCMBR(TBART1) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBART1)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBAR1T) SRCMBR(TBAR1T) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBAR1T)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBASFI) SRCMBR(TBASFI) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBASFI)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBASTO) SRCMBR(TBASTO) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBASTO)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBAST1) SRCMBR(TBAST1) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBAST1)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBCALD) SRCMBR(TBCALD) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBCALD)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBCCAU) SRCMBR(TBCCAU) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBCCAU)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBCCA1) SRCMBR(TBCCA1) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBCCA1)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBCCA2) SRCMBR(TBCCA2) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBCCA2)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBCCA3) SRCMBR(TBCCA3) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBCCA3)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBCC2A) SRCMBR(TBCC2A) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBCC2A)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBCC2U) SRCMBR(TBCC2U) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBCC2U)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBCOCT) SRCMBR(TBCOCT) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBCOCT)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBCOPS) SRCMBR(TBCOPS) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBCOPS)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBCOTR) SRCMBR(TBCOTR) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBCOTR)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBCUMA) SRCMBR(TBCUMA) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBCUMA)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBCURR) SRCMBR(TBCURR) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBCURR)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBCUR1) SRCMBR(TBCUR1) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBCUR1)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBDEFA) SRCMBR(TBDEFA) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBDEFA)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBDELI) SRCMBR(TBDELI) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBDELI)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBDISC) SRCMBR(TBDISC) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBDISC)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBELEM) SRCMBR(TBELEM) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBELEM)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBELUM) SRCMBR(TBELUM) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBELUM)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBFIRM) SRCMBR(TBFIRM) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBFIRM)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBHAUT) SRCMBR(TBHAUT) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBHAUT)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBINST) SRCMBR(TBINST) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBINST)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBINVR) SRCMBR(TBINVR) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBINVR)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBKDES) SRCMBR(TBKDES) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBKDES)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBKDE1) SRCMBR(TBKDE1) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBKDE1)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBLANG) SRCMBR(TBLANG) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBLANG)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBMAI1) SRCMBR(TBMAI1) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBMAI1)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBMAI2) SRCMBR(TBMAI2) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBMAI2)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBMAI5) SRCMBR(TBMAI5) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBMAI5)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBM1I5) SRCMBR(TBM1I5) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBM1I5)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBNAGR) SRCMBR(TBNAGR) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBNAGR)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBNATN) SRCMBR(TBNATN) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBNATN)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBPAYM) SRCMBR(TBPAYM) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBPAYM)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBPAY1) SRCMBR(TBPAY1) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBPAY1)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBQUAL) SRCMBR(TBQUAL) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBQUAL)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBQUCA) SRCMBR(TBQUCA) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBQUCA)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBSELU) SRCMBR(TBSELU) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBSELU)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBSHIP) SRCMBR(TBSHIP) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBSHIP)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBSTOR) SRCMBR(TBSTOR) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBSTOR)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBTD04) SRCMBR(TBTD04) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBTD04)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBTD16) SRCMBR(TBTD16) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBTD16)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBTPAY) SRCMBR(TBTPAY) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBTPAY)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBTRIS) SRCMBR(TBTRIS) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBTRIS)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBTRI1) SRCMBR(TBTRI1) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBTRI1)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBUMRT) SRCMBR(TBUMRT) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBUMRT)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBUNIT) SRCMBR(TBUNIT) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBUNIT)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBYARN) SRCMBR(TBYARN) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBYARN)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(EDV/§§TBZONE) SRCMBR(TBZONE) SIZE(999 10)
             MONMSG     MSGID(CPF0000)
             LSTFFD     FILE(EDV/§§TBZONE)
             MONMSG     MSGID(CPF0000)
/*          ----------------------------------------------------------       */
ENDE:
             RCLRSC
             ENDPGM
