/*-------------------------------------------------*/
/* Dometic Order Schnittstellen abfragen           */
/*-------------------------------------------------*/
             PGM

             ADDLIBLE   LIB(WAECOEDI)
             MONMSG     MSGID(CPF2103)
             ADDLIBLE   LIB(BAR_FTP)
             MONMSG     MSGID(CPF2103)

/* Dometic ES Aufträge per FTP holen */
             CALL       PGM(BAR_FTP/FTPORDERS) PARM('es')

/* Dometic ES Aufträge einlesen */
             CALL       PGM(WAECOEDI/IFSORDERS) PARM('es')

/* Dometic ES Aufträge in Übergabedateien stellen */
             CALL       PGM(WAECOEDI/EDI0101C) PARM('78146')

             RMVLIBLE   LIB(WAECOEDI)
             RMVLIBLE   LIB(BAR_FTP)

/* Dometic ES Aufträge in BGFS generieren */
             STRS36PRC  PRC(WWWORDXM) PARM('XML,WAECOES,0')

             ENDPGM
