/*-------------------------------------------------*/
/* Dometic Order Schnittstellen abfragen           */
/*-------------------------------------------------*/
             PGM

             DCL        VAR(&ERROR1)     TYPE(*CHAR) LEN(01) VALUE('0')

             ADDLIBLE   LIB(WAECOEDI)
             MONMSG     MSGID(CPF2103)
             ADDLIBLE   LIB(BAR_FTP)
             MONMSG     MSGID(CPF2103)
             ADDLIBLE   LIB(TVRELWAECO) POSITION(*LAST)
             MONMSG     MSGID(CPF0000) EXEC(CHGVAR VAR(&ERROR1) +
                          VALUE('1'))


/* Dometic CH Aufträge per FTP holen */
             CALL       PGM(BAR_FTP/FTPORDERS) PARM('ch')

/* Dometic CH Aufträge einlesen */
             CALL       PGM(WAECOEDI/IFSORDERS) PARM('ch')

/* Dometic CH Aufträge in Übergabedateien stellen */
             CALL       PGM(WAECOEDI/EDI0101C) PARM('02921')

             RMVLIBLE   LIB(WAECOEDI)
             RMVLIBLE   LIB(BAR_FTP)
             IF         COND(&ERROR1 = '0') THEN(DO)
                RMVLIBLE   LIB(TVRELWAECO)
             ENDDO


/* Dometic CH Aufträge in BGFS generieren */
   /*        STRS36PRC  PRC(WWWORDXM) PARM('XML,WAECOCH,0') */

             ENDPGM
