/*-------------------------------------------------*/
/* Verwalten EDI-Aufträge - Aufrufprogramm         */
/*-------------------------------------------------*/
             PGM        PARM(&KDNR)

             DCL        VAR(&KDNR) TYPE(*CHAR) LEN(7)


/* WWWORD10 aufbauen */
             OVRDBF     FILE(WWWORD10) TOFILE(WAECOEDI/WWWORD10)
             CALL       PGM(EDI0101) PARM(&KDNR) /* EDI0101 aufrufen */
             DLTOVR     FILE(WWWORD10)

/* WWWORD50 aufbauen */
             OVRDBF     FILE(WWWORD50) TOFILE(WAECOEDI/WWWORD50)
             CALL       PGM(EDI0102) PARM(&KDNR) /* EDI0102 aufrufen */
             DLTOVR     FILE(WWWORD50)

/* WWWORD51 aufbauen */
             OVRDBF     FILE(WWWORD51) TOFILE(WAECOEDI/WWWORD51)
             CALL       PGM(EDI0103) PARM(&KDNR) /* EDI0103 aufrufen */
             DLTOVR     FILE(WWWORD51)


/* Italien */
/*           IF         COND(&KDNR *EQ '55278') THEN(DO)  */
/*           STRS36PRC  PRC(WWWORDXM) PARM('XML,WAECOIT') */
/*           ENDDO                                        */

/* Schweiz */
/*           IF         COND(&KDNR *EQ '2921') THEN(DO)   */
/*           STRS36PRC  PRC(WWWORDXM) PARM('XML,WAECOCH') */
/*           ENDDO                                        */

/* Frankreich */
/*           IF         COND(&KDNR *EQ '88505') THEN(DO)  */
/*           STRS36PRC  PRC(WWWORDXM) PARM('XML,WAECOFR') */
/*           ENDDO                                        */

/* UK */
/*           IF         COND(&KDNR *EQ '40631') THEN(DO)  */
/*           STRS36PRC  PRC(WWWORDXM) PARM('XML,WAECOUK') */
/*           ENDDO                                        */

/* Schweden */
/*           IF         COND(&KDNR *EQ '8138') THEN(DO)   */
/*           STRS36PRC  PRC(WWWORDXM) PARM('XML,WAECOSE') */
/*           ENDDO                                        */

/* Spanien  */
/*           IF         COND(&KDNR *EQ '78146') THEN(DO)  */
/*           STRS36PRC  PRC(WWWORDXM) PARM('XML,WAECOES') */
/*           ENDDO                                        */

             ENDPGM
