     A                                      UNIQUE
     A          R PGMAUFR
     A            PROGRAMM      10A         TEXT('Programm')
     A                                      COLHDG('Programm')
     A            LFDNR          3S 0       TEXT('Lfd.Nr.')
     A                                      COLHDG('Lfd.Nr.')
     A            LIB           10A         TEXT('Lib')
     A                                      COLHDG('Lib')
     A            PARA_AUSG      1A         TEXT('Parameter J/N')
     A                                      COLHDG('Parameter J/N')
     A            PARAMETER     10A         TEXT('Parameter1')
     A                                      COLHDG('Parameter1')
     A            PARAMETER2    10A         TEXT('Parameter2')
     A                                      COLHDG('Parameter2')
     A            PARAMETER3    10A         TEXT('Parameter3')
     A                                      COLHDG('Parameter3')
     A            PARAMETER4    10A         TEXT('Parameter4')
     A                                      COLHDG('Parameter4')
     A            PARAMETER5    10A         TEXT('Parameter5')
     A                                      COLHDG('Parameter5')
     A            PARAMETER6    10A         TEXT('Parameter6')
     A                                      COLHDG('Parameter6')
     A            PARAMETER7    10A         TEXT('Parameter7')
     A                                      COLHDG('Parameter7')
     A            PARAMETER8    10A         TEXT('Parameter8')
     A                                      COLHDG('Parameter8')
     A            PARAMETER9    10A         TEXT('Parameter9')
     A                                      COLHDG('Parameter9')
     A            PARAMETE10    10A         TEXT('Parameter10')
     A                                      COLHDG('Parameter10')
     A            LAUF           1A         TEXT('Ausführen J/N')
     A                                      COLHDG('Ausführen J/N')
     A            BATCH          1A         TEXT('Batchlauf J/N')
     A                                      COLHDG('Batchlauf J/N')
     A            BEFEHL         1A         TEXT('Befehl J/N')
     A                                      COLHDG('Befehl J/N')
     A            JOB           10A         TEXT('JOB_Name')
     A                                      COLHDG('JOB_Name')
     A            JOBQ          10A         TEXT('JOBQ')
     A                                      COLHDG('JOBQ')
     A            INHALT_B     200A         TEXT('Inhalt Befehl')
     A                                      COLHDG('Inhalt Befehl')

     A          K LFDNR
     A          K PROGRAMM
