     A*****************************************************************
     A* WAECO: ANSPRECHPARTNER LOGISCHE SICHT TRPAPF00
     A*****************************************************************
     A          R APF00R1                   PFILE(*LIBL/TRPAPF00)
     A*****************************************************************
     A          K APF020
