     D* PROGRAMMNAME.:##E                                                     
     D* FUNKTION.....:E-KARTEN
     D* Oktober 2009   GANG, MANFRED
     D**************************************************************************
     D MD              S              1    DIM(256)
     D MD#2            S              1    DIM(512)
     D ATR             S              1    DIM(63)
     D ATTS            S              1    DIM(1)
     D ATTK            S              1    DIM(1)
     D ATTO            S              1    DIM(1)
     D KEY             S              2    DIM(24)
     D FKTTST          S              1    DIM(6)
