     D* INFORMATIONSTRUKTUREN
     D CTL§§           DS
     D  I§§001                 1     09    INZ('Schlüssel')
     D  I§§002                10     18    INZ('"display"')
     D  I§§003                19     27    INZ('"change"')
     D  I§§004                28     36    INZ('" apply "')
     D  I§§005                37     45    INZ('"delete "')
     D  I§§006                46     55    INZ('" print " ')
     D  I§§007                56     65    INZ('"  copy  "')
     D  I§§008                66     75    INZ('angezeigt')
     D  I§§009                76     83    INZ('geändert')
     D  I§§010                84     91    INZ('angelegt')
     D  I§§011                92     99    INZ('gelöscht')
     D* DATUM
     D                 DS                  INZ
     D  TMHJ                   1      8  0
     D  TMHJT                  1      2  0
     D  TMHJM                  3      4  0
     D  TMHJH                  5      6  0
     D  TMHJJ                  7      8  0
     D                 DS                  INZ
     D  HJMT                   1      8  0
     D  HJMTH                  1      2  0
     D  HJMTJ                  3      4  0
     D  HJMTM                  5      6  0
     D  HJMTT                  7      8  0
