     D* INFORMATIONSTRUKTUREN
     D CTLFT1          DS
     D  I§§F01                01     20    INZ('F1=help             ')
     D  I§§F02                21     40    INZ('F2/(Ä)=change       ')
     D  I§§F03                41     60    INZ('F3=return           ')
     D  I§§F04                61     80    INZ('F4=prompting        ')
     D  I§§F05                81    100    INZ('F5/(A)=updating     ')
     D  I§§F06               101    120    INZ('F6/(N)=create       ')
     D  I§§F07               121    140    INZ('F7=SFLnew ahead     ')
     D  I§§F08               141    160    INZ('F8=SFLnew back      ')
     D  I§§F09               161    180    INZ('F9=to locate        ')
     D  I§§F10               181    200    INZ('F10=System/Command  ')
     D  I§§F11               201    220    INZ('F11=Subfile fold    ')
     D  I§§F12               221    240    INZ('F12=back/break      ')
     D  I§§F13               241    260    INZ('F13=                ')
     D  I§§F14               261    280    INZ('F14=leere Maske     ')
     D  I§§F15               281    300    INZ('F15/(K)=copy        ')
     D  I§§F16               301    320    INZ('F16=                ')
     D  I§§F17               321    340    INZ('F17=start data      ')
     D  I§§F18               341    360    INZ('F18=end data        ')
     D  I§§F19               361    380    INZ('F19=scroll left     ')
     D  I§§F20               381    400    INZ('F20=scroll right    ')
     D  I§§F21               401    420    INZ('F21/(D)=print       ')
     D  I§§F22               421    440    INZ('F22=SQL-bearbeiten  ')
     D  I§§F23               441    460    INZ('F23/(L)=delete      ')
     D  I§§F24               461    480    INZ('F24=more keys       ')
