     D* INFORMATIONSDATENSTRUKTUR BILDSCHIRMDATEI
     D BT01            C                   CONST(X'31')
     D BT02            C                   CONST(X'32')
     D BT03            C                   CONST(X'33')
     D BT04            C                   CONST(X'34')
     D BT05            C                   CONST(X'35')
     D BT06            C                   CONST(X'36')
     D BT07            C                   CONST(X'37')
     D BT08            C                   CONST(X'38')
     D BT09            C                   CONST(X'39')
     D BT10            C                   CONST(X'3A')
     D BT11            C                   CONST(X'3B')
     D BT12            C                   CONST(X'3C')
     D BT13            C                   CONST(X'B1')
     D BT14            C                   CONST(X'B2')
     D BT15            C                   CONST(X'B3')
     D BT16            C                   CONST(X'B4')
     D BT17            C                   CONST(X'B5')
     D BT18            C                   CONST(X'B6')
     D BT19            C                   CONST(X'B7')
     D BT20            C                   CONST(X'B8')
     D BT21            C                   CONST(X'B9')
     D BT22            C                   CONST(X'BA')
     D BT23            C                   CONST(X'BB')
     D BT24            C                   CONST(X'BC')
     D FCLEAR          C                   CONST(X'BD')
     D FENTER          C                   CONST(X'F1')
     D FHELP           C                   CONST(X'F3')
     D FAUF            C                   CONST(X'F4')
     D FUNTEN          C                   CONST(X'F5')
     D FPRINT          C                   CONST(X'F6')
     D FRCDBK          C                   CONST(X'F8')
     D FAUTEN          C                   CONST(X'3F')
     D DSDSPF          DS
     D  §§§CFK               369    369
     D  §§§CLC               370    371
     D  §§§L                 370    370
     D  §§§C                 371    371
     D  §§§DLA               372    375B 0
     D  §§§SFP               374    375B 0
     D  §§§SFL               376    377B 0
     D  §§§SFR               378    379B 0
     D  §§§CLW               380    381
     D  §§§LW                380    380
     D  §§§CW                381    381
     D CURNUM          DS
     D  §§CLIN                 1      2  0
     D  §§CCOL                 3      5  0
     D  §§CPOS                 6      7
     D                 DS
     D  §§§LIN                 1      2B 0
     D  §§§B                   2      2
     D  §§§COL                 3      4B 0
     D  §§§D                   4      4
