     A          R ARTDATENR
     A
     A            #1A           15A
     A            #1            12S 5
     A            #2            12S 5
     A            #3            12S 5
     A            #4            12S 5
     A            #5            12S 5
     A            #6            12S 5
     A            #7            12S 5
     A            #8            12S 5
     A            #9            12S 5
     A          K #1A
