     A*                                     UNIQUE
     A          R A_PREISR
     A            #PRS010        2S 0       TEXT('FIRMA')
     A            #PRS030        3A         TEXT('VERKAUFSARTIKEL LIEFERANTEN')
     A            #PRS040       15A         TEXT('VERKAUFSARTIKEL ARTIKEL NR.')
     A            #PRS050        9S 2       TEXT('NETTO-PREIS')
     A            #PRS070        6S 0       TEXT('GÜLTIG AB JJMMTT')
     A            #GEBUCHT       6S 0       TEXT('GEBUCHT')
     A            #MODUS         1A         TEXT('MODUS UPDATE/NEW')
     A            #VERSION      20A         TEXT('VERSION')

