     A                                      UNIQUE
     A          R ARTNRKF0
     A            LIEFNR         3A         TEXT('LIEFERANTENNUMMER')
     A            ARTNR         15A         TEXT('ARTIKELNUMMER')
     A            SCHEMA         2S 0       TEXT('KALKULATIONSSCHEMA')

     A          K LIEFNR
     A          K ARTNR
