     A                                      UNIQUE
     A          R E_PREIS2MR
     A            JAHR           4S 0       TEXT('JAHR')
     A            LIEFERANT      3A         TEXT('LIEFERANT')
     A            ARTIKEL       15A         TEXT('ARTIKEL')
     A            #PREIS_PM     12S 4       TEXT('PREIS_PM')

     A          K JAHR
     A          K LIEFERANT
     A          K ARTIKEL
