     A                                      UNIQUE
     A          R E_STK_LCPR
     A            JAHR           4S 0       TEXT('JAHR')
     A            LIEFERANT      3A         TEXT('LIEFERANT')
     A            ARTIKEL       15A         TEXT('ARTIKEL')
     A            LCP           12S 4       TEXT('STK_LCP')

     A          K JAHR
     A          K LIEFERANT
     A          K ARTIKEL
