     A                                      UNIQUE
     A          R KALK_F1
     A            JAHR           4S 0       TEXT('JAHR')
     A            LIEFNR         3A         TEXT('LIEFERANTENNUMMER')
     A            ARTNR         15A         TEXT('ARTIKELNUMMER')
     A            ARTBEZ        30A         TEXT('ARTIKELBEZEICHNUNG')
     A            ARTGRP         3A         TEXT('ARTIKELGRUPPE')
     A            STATNR         3A         TEXT('STATISTIKNUMMER')
     A            ABC            1A         TEXT('ABC')
     A            KSCHEMA        2S 0       TEXT('KALKULATIONSSCHEMA')
     A            ULAND          2A         TEXT('URSPRUNGSLAND')
     A            LIEFERANT1    10A         TEXT('LIEFERANT1')
     A            LIEFERANT2    10A         TEXT('LIEFERANT2')
     A            ZOLLNR        12A         TEXT('ZOLLTARIFNUMMER')
     A            ARTZ1          6A         TEXT('ARTIKELZUSATZ 1')
     A            ARTZ2          6A         TEXT('ARTIKELZUSATZ 2')
     A            ARTZ3          6A         TEXT('ARTIKELZUSATZ 3')
     A            WACDVK         2S 0       TEXT('WÄHRUNGSCODE VK')
     A            WACDEK         3A         TEXT('WÄHRUNGSCODE EK')
     A            WEKPR         12S 4       TEXT('WAEHRUNGSEK-PREIS')
     A            DATUMV         8S 0       TEXT('GÜLTIG AB  DATUM')
     A            DATUMB         8S 0       TEXT('GÜLTIG BIS DATUM')
     A            KWAKURS        8S 4       TEXT('KWKURS')
     A            WAKURS         8S 4       TEXT('WKURS')
     A            EKPR          12S 4       TEXT('EK-PREIS')
     A            FRACHTSATZ     8S 4       TEXT('FRACHTSATZ')
     A            FRACHT        12S 4       TEXT('FRACHT')
     A            ZOLLSATZ       8S 4       TEXT('ZOLLSATZ')
     A            ZOLL          12S 4       TEXT('ZOLL')
     A            VERSICHERU    12S 4       TEXT('VERSICHERUNG')
     A            RISIKOSATZ     8S 4       TEXT('RISIKOZUSCHLAGSSATZ')
     A            RISIKOZ       12S 4       TEXT('RISIKOZUSCHLAG')
     A            GKSATZ         8S 4       TEXT('GEMEINKOSTENSATZ')
     A            GK            12S 4       TEXT('GK')
     A            WERKZEUG       6S 2       TEXT('WERKZEUG')
     A            ENTWICKLUN     6S 2       TEXT('ENTWICKLUNGSKOSTEN')
     A            PRODUKTION     6S 2       TEXT('PRODUKTION')
     A            BEISTELL       6S 2       TEXT('BEISTELLUNG')
     A            KONFEKTION     6S 2       TEXT('KONFEKTIONIERUNG')
     A            ENTSORGUNG    12S 4       TEXT('Entsorgungskosten')
     A            ENTSOBASIS    12S 4       TEXT('Gewicht/Basis')
     A            COSTPRS_VJ    12S 4       TEXT('COST PRICE VJ')
     A            COSTPRS_AR    12S 4       TEXT('COST PRICE ARB')
     A            COSTPRS_AJ    12S 4       TEXT('COST PRICE AJ')
     A            COSTPRS_N     12S 4       TEXT('COST PRICE NEU')
     A            STK_LCP       12S 4       TEXT('STK-LCP')
     A            STK_LCPGKZ    12S 4       TEXT('STK-LCP+GKZ RAB')
     A            LCP_GKZ_W     12S 4       TEXT('LCP+GKZ+RZ WERT')
     A            RZ_RABATTS     6S 2       TEXT('RZ IN % AUS SCHEMA')
     A            RZ_WERT       12S 4       TEXT('RZ ALS WERT')
     A            KALKBASIS     12S 4       TEXT('KALKULATIONSBASIS')
     A            ICSS           8S 4       TEXT('ICS SATZ')
     A            ICNS           8S 4       TEXT('ICN SATZ')
     A            EXSS           8S 4       TEXT('EXS SATZ')
     A            EXNS           8S 4       TEXT('EXN SATZ')
     A            OEMS           8S 4       TEXT('OEM SATZ')
     A            ICS           12S 4       TEXT('ICS PREIS')
     A            ICS_AJ        12S 4       TEXT('ICS PREIS AJ')
     A            ICN           12S 4       TEXT('ICN PREIS')
     A            EXS           12S 4       TEXT('EXS PREIS')
     A            EXN           12S 4       TEXT('EXN PREIS')
     A            OEM           12S 4       TEXT('OEM PREIS')
     A            GHNET         12S 4       TEXT('GH NETTO')
     A            GHNETS         8S 4       TEXT('GH NETTO SATZ')
     A            GHRAB         12S 4       TEXT('GH RABATT')
     A            GHRABS         8S 4       TEXT('GH RABATT SATZ')
     A*           GHRABATT      12S 4       TEXT('RABATT')
     A            EVP_AJ        12S 4       TEXT('EVP_AJ')
     A            EVP_N         12S 4       TEXT('EVP NEU')
     A            EVP_A_BR      12S 4       TEXT('EVP AJ BRUTTO')
     A            EVP_NEU1      12S 4       TEXT('EVP NEU 1')
     A            EVP_NEU2      12S 4       TEXT('EVP NEU 2')
     A            MARGE_NEU1    12S 4       TEXT('EVP NEU 1')
     A            MARGE_NEU2    12S 4       TEXT('EVP NEU 2')
     A            EVP_N_BR      12S 4       TEXT('EVP NEU BRUTTO')
     A            PREIS_PM      12S 4       TEXT('PREIS_PM')
     A            ROHS_N        10S 2       TEXT('ROHERLOESSATZ NEU')
     A            ROHS_AJ       10S 2       TEXT('ROHERLOESSATZ AJ')
     A            MIBT          11S 2       TEXT('MISCHPREIS VK')
     A            VKMENGE_VJ    10S 0       TEXT('VKMENGE VJ')
     A            VKMENGE_AJ    10S 0       TEXT('VKMENGE AJ')
     A            KCJMNG_VJ     10S 0       TEXT('KCJ MENGE VJ')
     A            KCJMNG_AJ     10S 0       TEXT('KCJ MENGE AJ')
     A            KCJUMS_VJ     12S 2       TEXT('KCJ UMSATZ VJ')
     A            KCJUMS_AJ     12S 2       TEXT('KCJ UMSATZ AJ')
     A            KCJROH_VJ     12S 2       TEXT('KCJ ROHERLOES VJ')
     A            KCJROH_AJ     12S 2       TEXT('KCJ ROHERLOES AJ')
     A            CCSTCK         4S 0       TEXT('Anzahl Artikel in Stückliste')
     A            CWSTCK         2S 0       TEXT('Anzahl Währungen  Stückliste')
     A            CCSTCK2        4S 0       TEXT('Anzahl Lohnarbeitsstückl.')
     A            CWSTCK2        8S 2       TEXT('Menge A-Summe Stücklisten')
     A            CWSTCK2W      10S 2       TEXT('Wert A-Summe Stücklisten')
     A            ARTGEW        12S 4       TEXT('ARTIKELGEWICHT')
     A            KSCHEMASTD     2S 0       TEXT('KALKULATIONS-STANDARD')
     A            ANLDAT         8S 0       TEXT('ANLAGE_DATUM ART280')
     A            ARTBEZENG     30A         TEXT('DESCRIPTION "ENGLISCH"')
     A            ARTBEZFRA     30A         TEXT('DESCRIPTION "FRÄNZÖS"')
     A            E1            15A         TEXT('ERSATZARTIKEL01')
     A            E2            15A         TEXT('ERSATZARTIKEL02')
     A            E3            15A         TEXT('ERSATZARTIKEL03')
     A            E4            15A         TEXT('ERSATZARTIKEL04')
     A            E5            15A         TEXT('ERSATZARTIKEL05')
     A            E6            15A         TEXT('ERSATZARTIKEL06')
     A            E7            15A         TEXT('ERSATZARTIKEL07')
     A            E8            15A         TEXT('ERSATZARTIKEL08')
     A            E9            15A         TEXT('ERSATZARTIKEL09')
     A            E10           15A         TEXT('ERSATZARTIKEL10')
     A            LAENGE        12S 4       TEXT('LÄNGE')
     A            BREITE        12S 4       TEXT('BREITE')
     A            HOEHE         12S 4       TEXT('HÖHE')
     A            GEWICHT       12S 4       TEXT('GEWICHT')
     A            VLAENGE       12S 4       TEXT('VERP.LÄNGE')
     A            VBREITE       12S 4       TEXT('VERP.BREITE')
     A            VHOEHE        12S 4       TEXT('VERP.HÖHE')
     A            VGEWICHT      12S 4       TEXT('VERP.GEWICHT')
     A            VEH           12S 4       TEXT('VERP.EINHEIT')
0910 A            ##ART270       9S 2       TEXT('PREIS ALT')
0910 A            ##ART280       6S 0       TEXT('DATUM ALT AB')
0910 A            ##ART280B      8S 0       TEXT('DATUM ALT AB TTMMJJJJ')
0910 A            ##ART290       9S 2       TEXT('PREIS AKTUELL')
0910 A            ##ART300       6S 0       TEXT('DATUM AKTUELL AB')
0910 A            ##ART300B      8S 0       TEXT('DATUM GÜLTIG AB TTMMJJJJ')
0910 A            ##ART310       9S 2       TEXT('PREIS NEU')
0910 A            ##ART320       6S 0       TEXT('DATUM NEU AB')
0910 A            ##ART320B      8S 0       TEXT('DATUM NEU AB TTMMJJJJ')
     A            A001          12S 2       TEXT('LAGERBESTAND 1')
     A            A002          12S 2       TEXT('LAGERBESTAND 2')
     A            A003          12S 2       TEXT('LAGERBESTAND 3')
     A            A004          12S 2       TEXT('LAGERBESTAND 4')
     A            A005          12S 2       TEXT('LAGERBESTAND 5')
     A            B001          12S 2       TEXT('INVENTUR MENGE')
     A            B002          12S 2       TEXT('EINKAUF MENGE')
     A            B003          12S 2       TEXT('VERKAUF MENGE')
     A            B004          12S 2       TEXT('KUNDENRÜCKSTELLUNGE')
     A            B005          12S 2       TEXT('FREI')
     A            C001          12S 2       TEXT('BESTAND')
     A            #TESAAV       25A         TEXT('SACHBEARBEITER')
     A            #TEDIAV       25A         TEXT('DISPONENT')
     A            #TEVOZ1        3S 0       TEXT('VORLAUF-ZT. PR')
     A            #TEVOA1        1A         TEXT('VORLAUF-ART PR')
     A            ARTSKU        10A         TEXT('SKU#          ')
     A            FAKTOR#        1A         TEXT('FAKTOR LIEFERANT')
     A            FAKTOR#EK      1A         TEXT('FAKTOR EK     ')
     A            TEMPEK#        2A         TEXT('EINHEIT LAGER   ')
     A            TEMEEK#        2A         TEXT('EINHEIT EK    ')
     A            PRMEPR#        2A         TEXT('EINHEIT LFR   ')
0910 A            ERSETZ         1A         TEXT('ERSETZUNGS KZ')
0910 A            PREISKDU       1A         TEXT('PREISDATEI KUNDE')
0910 A            ARTEAN        15A         TEXT('EAN_CODE ARTIKEL')
0910 A            STK_LCP_A     12S 4       TEXT('STK-LCP ALT')
0910 A            ICS_AJ_A      12S 4       TEXT('ICS_AJ ALT')
     A            SYS01          2A         TEXT('SYSTEMKENNUNG 01 INTERN')
     A            SYS02          2A         TEXT('SYSTEMKENNUNG 02 INTERN')
     A            PDATE           L         TEXT('LAUFDATUM')
0910 A            DRUCK001       1A         TEXT('DRUCKAUSGABE 001')
0910 A            DRUCK002       1A         TEXT('DRUCKAUSGABE 002')
0910 A            DRUCK003       1A         TEXT('DRUCKAUSGABE 003')
0910 A            TSTAMP          Z         TEXT('TIMESTAMP')
     A            STATUS         1A         TEXT('STATUS')
     A            VERSION       10A         TEXT('VERSION')
     A            BUCHUNG       20A         TEXT('BUCHUNGEN')
     A            BUCHUNG2      20A         TEXT('BUCHUNGEN')
     A            ICS_          12S 4       TEXT('ICS PREIS SBGPRS00')
     A            ICN_          12S 4       TEXT('ICN PREIS SBGPRS00')
     A            EXS_          12S 4       TEXT('EXS PREIS SBGPRS00')
     A            EXN_          12S 4       TEXT('EXN PREIS SBGPRS00')
     A            OEM_          12S 4       TEXT('OEM PREIS SBGPRS00')

     A          K JAHR
     A          K LIEFNR
     A          K ARTNR
     A          K VERSION
