     A                                      UNIQUE
     A          R KALK_PB3F1
     A            GHRABATT      10S 2       TEXT('RABATT')
     A            LNLISO         2A         TEXT('URSPRUNGSLAND')
     A            ZOLLNR        12A         TEXT('ZOLLTARIFNUMMER')
     A            ID            19A         TEXT('ID')
     A            JAHR           4S 0       TEXT('JAHR')
     A            LIEFNR         3A         TEXT('LIEFERANTENNUMMER')
     A            ARTNR         15A         TEXT('ARTIKELNUMMER')
     A            ARTGRP         3A         TEXT('ARTIKELGRUPPE')
     A            STATNR         3A         TEXT('STATISTIKNUMMER')
     A            ARTBEZ        30A         TEXT('ARTIKELBEZEICHNUNG')
     A            VARP           3A         TEXT('VARIANTE POS')
     A            KOTE          15A         TEXT('KOMPONENTE')
     A            KBZ1          30A         TEXT('BEZEICHNUNG1')
     A            ABC            1A         TEXT('ABC')
     A            ARTZ1          6A         TEXT('ARTIKELZUSATZ 1')
     A            ARTZ2          6A         TEXT('ARTIKELZUSATZ 2')
     A            ARTZ3          6A         TEXT('ARTIKELZUSATZ 3')
     A            WACDVK         2S 0       TEXT('WÄHRUNGSCODE VK')
     A            WACDEK         3A         TEXT('WÄHRUNGSCODE EK')
     A            KSCHEMA        2S 0       TEXT('KALKULATIONSSCHEMA')
     A            SCHBEZ        50A         TEXT('KALKULATIONSBEZ.')
     A            PB            50A         TEXT('PB')
     A            WEKPR          9S 4       TEXT('WAEHRUNGSEK-PREIS')
     A            KWAKURS        4S 2       TEXT('KWKURS')
     A            WAKURS         4S 2       TEXT('WKURS')
     A            EKPR          12S 2       TEXT('EK-PREIS')
     A            FRACHT         7S 2       TEXT('FRACHT')
     A            FRACHTSATZ     5S 4       TEXT('FRACHTSATZ')
     A            ZOLL           7S 2       TEXT('ZOLL')
     A            ZOLLSATZ       5S 4       TEXT('ZOLLSATZ')
     A            BEISTELL       6S 2       TEXT('BEISTELLUNG')
     A            BEIAUSPRO      6S 2       TEXT('BEISTELLUNG AUS PRODUKTION')
     A            ENTWICKLUN     6S 2       TEXT('ENTWICKLUNGSKOSTEN')
     A            VERSICHERU     6S 2       TEXT('VERSICHERUNG')
     A            COSTPRS       10S 2       TEXT('COST PRICE')
     A            RISIKOZ       10S 2       TEXT('RISIKOZUSCHLAG')
     A            RISIKOSATZ     4S 2       TEXT('RISIKOZUSCHLAGSSATZ')
     A            KALKBASIS     10S 2       TEXT('KALKULATIONSBASIS')
     A            ICS           10S 2       TEXT('ICS PREIS')
     A            ICN           10S 2       TEXT('ICN PREIS')
     A            EXS           10S 2       TEXT('EXS PREIS')
     A            EXN           10S 2       TEXT('EXN PREIS')
     A            OEM           10S 2       TEXT('OEM PREIS')
     A            GHNET         10S 2       TEXT('GH NETTO')
     A            GHRAB         10S 2       TEXT('GH RABATT')
     A            EV01          10S 2       TEXT('EV01')
     A            EV02          10S 0       TEXT('EV02')
     A            EVP            9S 2       TEXT('ENDVERBRAUCHERPREIS')
     A            ZU            10S 2       TEXT('ZU')
     A            PALT          12S 2       TEXT('PALT')
     A            PNEU          12S 2       TEXT('PNEU')
     A            ICSS           4S 2       TEXT('ICS SATZ')
     A            ICNS           4S 2       TEXT('ICN SATZ')
     A            EXSS           4S 2       TEXT('EXS SATZ')
     A            EXNS           4S 2       TEXT('EXN SATZ')
     A            OEMS           4S 2       TEXT('OEM SATZ')
     A            GHNETS         4S 2       TEXT('GH NETTO SATZ')
     A            GHRABS         4S 2       TEXT('GH RABATT SATZ')
     A            PREIS_PM      15S 2       TEXT('PREIS_PM')
     A            VKALTINCL     12S 2       TEXT('VKALTINCL')
     A            VKNEUINCL     12S 2       TEXT('VKNEUINCL')
     A            MIBT          11S 2       TEXT('MINDESTBETRAG')

     A          K ID
     A          K JAHR
     A          K LIEFNR
     A          K ARTNR
     A          K KOTE
