     A*****************************************************************
     A* WAECO: LOGISCHE SICHT KALK_FILE
     A*****************************************************************
     A          R KALK_F1                   PFILE(BAR_KALK/KALK_FILE)
     A*****************************************************************
     A          K JAHR
     A          K VERSION
     A          K LIEFNR
     A          K ARTNR
