     A*****************************************************************
     A* WAECO: LOGISCHE SICHT KALKSCHZU
     A*****************************************************************
     A          R KALKSZUF1                 PFILE(BAR_KALK/KALKSCHZU)
     A*****************************************************************
     A          K DOMSTATNR
     A          K WINSTATNR
