     A*****************************************************************
     A* WAECO: LOGISCHE SICHT KALK_FILE
     A*****************************************************************
     A          R KALK_F1                   PFILE(BAR_KALK/KALK_CH)
     A*****************************************************************
     A          K VERSION
     A          K ARTNR
