     A*****************************************************************
     A* WAECO: LOGISCHE SICHT KCJ____31
     A*****************************************************************
     A          R KCJ____31                 PFILE(BAR_KALK/KCJ____31)
     A*****************************************************************
     A          K LIEFNR
     A          K ARTNR
     A          K JAHR
