     A                                      UNIQUE
     A          R MARINER
     A            JAHR           4S 0       TEXT('JAHR')
     A            LIEFERANT      3A         TEXT('LIEFERANT')
     A            ARTIKEL       15A         TEXT('ARTIKEL')

     A          K JAHR
     A          K LIEFERANT
     A          K ARTIKEL
