     A                                      UNIQUE
     A          R K_KUNDER
     A            FIRMA          1A         TEXT('FIRMA')
     A            KUNDE          5A         TEXT('KUNDE')
     A            VERTRETER     10A         TEXT('VERTRETER')
     A            AKTIV          1A         TEXT('AKTIV')
     A
     A          K KUNDE
