     A                                      UNIQUE
     A          R PREISAKTR
     A            ARTNR         15A         TEXT('ARTIKELNUMMER')
     A            ARTBEZ        30A         TEXT('ARTIKELBEZEICHNUNG')
     A            KUNDE         10A         TEXT('                  ')
     A            ICS_          12S 4       TEXT('ICS PREIS SBGPRS00')
     A            ICS_VON        8S 0       TEXT('              ')
     A            ICS_BIS        8S 0       TEXT('              ')
     A            ICN_          12S 4       TEXT('ICN PREIS SBGPRS00')
     A            ICN_VON        8S 0       TEXT('              ')
     A            ICN_BIS        8S 0       TEXT('              ')
     A            EXS_          12S 4       TEXT('EXS PREIS SBGPRS00')
     A            EXS_VON        8S 0       TEXT('              ')
     A            EXS_BIS        8S 0       TEXT('              ')
     A            EXN_          12S 4       TEXT('EXN PREIS SBGPRS00')
     A            EXN_VON        8S 0       TEXT('              ')
     A            EXN_BIS        8S 0       TEXT('              ')
     A            OEM_          12S 4       TEXT('OEM PREIS SBGPRS00')
     A            OEM_VON        8S 0       TEXT('              ')
     A            OEM_BIS        8S 0       TEXT('              ')
     A            EVP_AJ        12S 4       TEXT('EVP_AJ')
     A            EVP_VON        8S 0       TEXT('              ')
     A            EVP_BIS        8S 0       TEXT('              ')

     A            ICS_2         12S 4       TEXT('ICS PREIS SBGPRS00')
     A            ICS_VON2       8S 0       TEXT('              ')
     A            ICS_BIS2       8S 0       TEXT('              ')
     A            ICN_2         12S 4       TEXT('ICN PREIS SBGPRS00')
     A            ICN_VON2       8S 0       TEXT('              ')
     A            ICN_BIS2       8S 0       TEXT('              ')
     A            EXS_2         12S 4       TEXT('EXS PREIS SBGPRS00')
     A            EXS_VON2       8S 0       TEXT('              ')
     A            EXS_BIS2       8S 0       TEXT('              ')
     A            EXN_2         12S 4       TEXT('EXN PREIS SBGPRS00')
     A            EXN_VON2       8S 0       TEXT('              ')
     A            EXN_BIS2       8S 0       TEXT('              ')
     A            OEM_2         12S 4       TEXT('OEM PREIS SBGPRS00')
     A            OEM_VON2       8S 0       TEXT('              ')
     A            OEM_BIS2       8S 0       TEXT('              ')
     A            EVP_AJ2       12S 4       TEXT('EVP_AJ')
     A            EVP_VON2       8S 0       TEXT('              ')
     A            EVP_BIS2       8S 0       TEXT('              ')
     A            VERSION       10A         TEXT('VERSION')
0910 A            TSTAMP          Z         TEXT('TIMESTAMP')

     A          K ARTNR
     A          K KUNDE
     A          K TSTAMP
