     A*****************************************************************
     A* WAECO: LOGISCHE SICHT SCHEMA
     A*****************************************************************
     A          R SCHEMA                    PFILE(BAR_KALK/SCHEMA)
     A*****************************************************************
     A          K SCHEMA
