     A*****************************************************************
     A* WAECO: LOGISCHE SICHT SLAZS
     A*****************************************************************
     A          R SLAZ1                     PFILE(BAR_KALK/SLAZS)
     A*****************************************************************
     A          K SLAZFIRM
     A          K SLAZTENR
