     A*****************************************************************
     A* WAECO: LOGISCHE SICHT TRENDEKP
     A*****************************************************************
     A          R TRENDEKP                  PFILE(BAR_KALK/TRENDEKP)
     A*****************************************************************
     A          K PRTENR
     A          K PREZPR                    DESCEND
