     A*****************************************************************
     A* WAECO: LOGISCHE SICHT ZOLLTA2
     A*****************************************************************
     A          R ZOLLTA2                   PFILE(BAR_KALK/ZOLLTA2)
     A*****************************************************************
     A          K TARIF1
