      * PROGRAMMNAME.:#CHGPFMR                                                
      * FUNKTION.....:ÄNDERN VON TEXTEN, ATTRIBUT VORANSTELLEN
      * 05.12.98       GANG
      *
      * Faserwerke-Lingen GmbH
      * Darmer Esch 75
      * 49811 Lingen
      *
      *-ÄNDERUNGSDIENST---------------------------------------------------------
      * XX.XX.XX                                              PGMR.....
      *-------------------------------------------------------------------------
      **************************************************************************
     H/COPY ##H
      *
     E**************************************************************************
     E                    MD        256  1
     E                    ATR        63  1
     I**************************************************************************
     I/COPY ##I001
     I/COPY ##I002
     I*-------------------------------------------------------------------------
     I* PROGRAMMSPEZIFISCHE ZUWEISUNGEN
     I*-------------------------------------------------------------------------
     C**************************************************************************
     C* VORLAUFKARTEN
     C**************************************************************************
     C           *ENTRY    PLIST
     C                     PARM           MD
     C                     PARM           X       20
     C*
     C                     EXSR MODATR
     C                     MOVEAMD        TXT   256
     C                     MOVELATR,X     MD,1
     C                     MOVEATXT       MD,2
     C                     MOVE '1'       *INLR
     C*
     C**************************************************************************
     C* MODATR: VARIABLE STEUERUNG DER FELDATTRIBUTE/FELDGRUPPE FÜLLEN
     C**************************************************************************
     C*
     C           MODATR    BEGSR
     C                     CLEARATR
     C                     CALL '#MODATR'              97
     C                     PARM           ATR
     C                     ENDSR
     C*
