      * PROGRAMMNAME.:SYS0006R                                                
      * FUNKTION.....:........-VERARBEITUNG
      * 05.12.98       GANG, MANFRED
     * UPDATE         FILE(§000PHY1) TOFILE(*LIBL/SYSPROFPF)
      * READ/F.UPDATE  FILE(§000LOG1) TOFILE(*LIBL/SYSPROFL1)
      *
      * Faserwerke-Lingen GmbH
      * Darmer Esch 75
      * 49811 Lingen
      *
      *-ÄNDERUNGSDIENST---------------------------------------------------------
      * XX.XX.XX                                              PGMR.....
      *-------------------------------------------------------------------------
     F**************************************************************************
     FSYS0016DCF  E                    WORKSTN      KINFSR *PSSR
     F                                              KINFDS DSDSPF
     F            SYS0016D0                         KRENAME§DDS1§D0
     F            SYS0016D1                         KRENAME§DDS1§D1
     F            SYS0016D2                         KRENAME§DDS1§D2
     F            SYS0016D3                         KRENAME§DDS1§D3
     F§000LOG1IF  E           K        DISK         KINFSR *PSSR
     F            SYSPROFPFR                        KRENAMELOG01R
     F                                              KINFDS DSF1
     F§000PHY1UF  E                    DISK         KINFSR *PSSR A
     F            SYSPROFPFR                        KRENAMEPHY01R
     F*                                             KCOMIT
     E**************************************************************************
     E/COPY ##E
     I*-------------------------------------------------------------------------
     ILOG01R
     I              S5PRF                           §KEY01
     I              S5USRP                          §KEY02
     IPHY01R
     I              S5PRF                           §KEY01
     I              S5USRP                          §KEY02
     I§DDS1§D3
     I* KEY-AREA
     I              D3PRF                           S1KY01
     I              D3USRP                          S1KY02
     I* HIDDEN-KEY-AREA
     I              H1PRF                           H1KY01
     I              H1USRP                          H1KY02
     I*-------------------------------------------------------------------------
     IDSF1        DS
     I                                       11  150F1STS
     I                                    B 397 4000F1RRN
     I*-------------------------------------------------------------------------
     I* PROGRAMMSPEZIFISCHE ZUWEISUNGEN FÜR MELDUNGEN
     ICTLMSG      DS
     I I            '"Profile"           '    1  30 IMSG01
     I I                                     31  60 IMSG02
     I I                                     61  90 IMSG03
     ISFLMSG      DS
     I I            '"Profilesteuerung"  '    1  20 I§§§01
     ICTLEOF      DS
     I I                                      1  10 IEOF01
     I I            '"Profileschlüssel"  '   11  40 IEOF02
     I I                                     41  70 IEOF03
     ICTLCOL      DS
     I I            X'29'                     1   1 C§§§01
     ICTL001      DS
     I I            'SYS0016D3'               1   9 §§§§§1
     I*-----------Dateischlüsselbereich ----------------------------------------
     IKEYDAT      DS
     I I                                      1  10 §KEY01
     I I                                     11  20 §KEY02
     I*-----------Startposition Schlüssel---------------------------------------
     IKEYS        DS
     I I                                      1  10 KEYS01
     I I                                     11  20 KEYS02
     I*-----------Key in D3FMT  -Sätze Display-Area-----------------------------
     IKEYFMT      DS
     I I                                      1  10 S1KY01
     I I                                     11  20 S1KY02
     I*-----------Key in D3FMT  -Sätze Hidden-Area------------------------------
     IKEYHID      DS
     I I                                      1  10 H1KY01
     I I                                     11  20 H1KY02
     I*-----------Clear-Key-Area------------------------------------------------
     IKEYC        DS
     I I            '          '              1  10 KEYC01
     I I            '          '             11  20 KEYC02
     IKEYM        DS
     I I            '          '              1  10 KEYM01
     I I            '          '             11  20 KEYM02
     I*-------------------------------------------------------------------------
     I/COPY ##I001
     I/COPY ##I002
     I/COPY ##I003
     I*-------------------------------------------------------------------------
     C**************************************************************************
     C*VORLAUFKARTEN ÜBERGABEBEREICHE                                  *********
     C*-------------------------------------------------------------------------
     C*
     C           *ENTRY    PLIST
     C                     PARM           DSPMOD  1        BILDS.-MODUS
     C                     PARM           §§XP             X-KOORDINATE
     C                     PARM           §§YP             Y-KOORDINATE
     C                     PARM           FUNKT   9        FUNKTIONEN
     C                     PARM           PKYS01           SCHLÜSSEL
     C                     PARM           PKYS02           SCHLÜSSEL
     C                     PARM           CTLRWT  1        REWRITE J/N
     C*
     C                     MOVEL*LOVAL    KEYC01
     C                     MOVEL*LOVAL    KEYC02
     C                     MOVEL*HIVAL    KEYM01
     C                     MOVEL*HIVAL    KEYM02
     C*
     C           *LIKE     DEFN KEYS01    PKYS01
     C                     MOVELPKYS01    KEYS01
     C           *LIKE     DEFN KEYS02    PKYS02
     C                     MOVELPKYS02    KEYS02
     C*
     C                     Z-ADD69        FTLNG            LÄNGE TASTE
     C*                    30+   56789.
     C                     MOVEA'000010'  FKTTST           TASTATUR
     C*AUS *LDA
     C           FXRRN     IFNE *ZERO
     C           FXRRN     CHAIN§000PHY1             91    INPUT-READ
     C  N91                MOVEL§KEY01    KEYS01
     C  N91                MOVEL§KEY02    KEYS02
     C  N91                UNLCK§000PHY1
     C                     ENDIF
     I/COPY ##VORLAUF
     C*
     C           KEYC      IFNE KEYS
     C                     MOVEL'J'       CTLLD
     C                     MOVELKEYDAT    KEYFMT
     C                     END
     C*
     C*EIGENE FUNKTIONSTASTE FÜR BEARBEITUNG DATEI
     C*                    Z-ADD16        NEUFNR
     C                     Z-ADD*ZERO     CTLARB
     C*                    MOVELI§§§01    NEUFKT
     C                     EXSR FKTPGM
     C*
     C*-------------------------------------------------------------------------
     C* DATEI-SCHLÜSSEL
     C* §000LOG1:
     C           KEY001    KLIST
     C                     KFLD           §KEY01
     C                     KFLD           §KEY02
     C*
     C           KEYSR1    KLIST
     C                     KFLD           S1KY01
     C                     KFLD           S1KY02
     C*
     C* WINDOW AUSGEBEN
     C                     WRITE§DDS1§D1                   KOPFZEILE
     C                     WRITE§DDS1§D2                   FUSSZEILE
     C*
     C/COPY ##D3DIAL                                      DIALOGSCHL.
     C*
     C**************************************************************************
     C* SR1100: SONSTIGE ZUWEISUNGEN NACH READ FORMAT
     C*-------------------------------------------------------------------------
     C*
     C           SR1100    BEGSR
     C*
     C*
     C           ##1100    ENDSR
     C*
     C/COPY ##D3CTLA                                       SR1101
     C*
     C**************************************************************************
     C* SR1120: SONSTIGE PRÜFUNGEN
     C*-------------------------------------------------------------------------
     C*
     C           SR1120    BEGSR
     C*
     C                     MOVE '0'       CTLPRF  1
     C*
     C           ##1120    ENDSR
     C*
     C**************************************************************************
     C* SR1121: SÄTZE AUFBEREITEN FÜR DIALOGSATZ #1
     C*-------------------------------------------------------------------------
     C*
     C           SR1121    BEGSR
     C*
     C                     MOVELKEYDAT    KEYFMT           DISPLAY KEY
     C                     MOVELS5DESC    D3DESC
     C                     MOVELS5BERE    D3BERE
     C                     MOVELS5AKT     D3AKT
     C                     MOVELS5EDAT    D3EDAT
     C                     MOVELS5ADAT    D3ADAT
     C                     MOVELS5USR     D3USR
     C                     MOVELS5STEP    D3STEP
     C                     MOVELKEYDAT    KEYHID           SAVE-AREA
     C                     MOVELS5DESC    H1DESC
     C                     MOVELS5BERE    H1BERE
     C                     MOVELS5AKT     H1AKT
     C                     MOVELS5EDAT    H1EDAT
     C                     MOVELS5ADAT    H1ADAT
     C                     MOVELS5USR     H1USR
     C                     MOVELS5STEP    H1STEP
     C                     Z-ADDF1RRN     S1F1RR           RELATIV.KEY
     C                     MOVEAFUNKT     *IN,81
     C*
     C           ##1121    ENDSR
     C*
     C**************************************************************************
     C* SR1150: CLEAR D3
     C*-------------------------------------------------------------------------
     C*
     C           SR1150    BEGSR
     C*
     C                     CLEARKEYFMT
     C                     CLEARD3DESC
     C                     CLEARD3BERE
     C                     CLEARD3AKT
     C                     CLEARD3EDAT
     C                     CLEARD3ADAT
     C                     CLEARD3USR
     C                     CLEARD3STEP
     C                     CLEARS1F1RR
     C*
     C           ##1150    ENDSR
     C*
     C**************************************************************************
     C* SR1198: VARIABLE ATTRIBUTSTEUERUNG PROTECTED (AATR,33)
     C*-------------------------------------------------------------------------
     C*
     C           SR1198    BEGSR
     C* KEYBEREICH
     C                     MOVEAATR,33    §§KY01
     C                     MOVEAATR,33    §§KY02
     C* SONSTIGE
     C                     MOVEAATR,33    §§DESC
     C                     MOVEAATR,33    §§AKT
     C                     MOVEAATR,33    §§BERE
     C                     MOVEAATR,33    §§EDAT
     C                     MOVEAATR,33    §§ADAT
     C                     MOVEAATR,33    §§USR
     C                     MOVEAATR,33    §§STEP
     C* CONTROL-RECORD
     C                     MOVEAATR,33    §§OP
     C*
     C           ##1198    ENDSR
     C*
     C**************************************************************************
     C* SR1199: VARIABLE ATTRIBUTSTEUERUNG
     C*-------------------------------------------------------------------------
     C*
     C           SR1199    BEGSR
     C* KEYBEREICH
     C                     MOVEAATTK      §§KY01
     C                     MOVEAATTK      §§KY02
     C* SONSTIGE
     C                     MOVEAATTS      §§DESC
     C                     MOVEAATTS      §§AKT
     C                     MOVEAATTS      §§BERE
     C                     MOVEAATR,33    §§EDAT
     C                     MOVEAATR,33    §§ADAT
     C                     MOVEAATR,33    §§USR
     C                     MOVEAATTS      §§STEP
     C* CONTROL-RECORD
     C                     MOVEAATTO      §§OP
     C*
     C           ##1199    ENDSR
     C*
     C**************************************************************************
     C* SR1201: F4=BEDIENERFÜHRUNG
     C*-------------------------------------------------------------------------
     C*
     C           SR1200    BEGSR
     C*
     C           §§CRR     IFEQ §§§§§1
     C*
     C                     SELEC                           START SELECT
     C* S1PROFILE
     C* ---------
     C           §§CRF     WHEQ 'D3USRP'                   SFL-AREA
     C                     CLEARFXRRN
     C                     CALL 'SYSM005C'             97
     C                     IN   LDA
     C           CTLTST    IFEQ '03'
     C                     EXSR RETURN                     TASTEN-PGM
     C                     ENDIF
     C           FXRRN     IFNE *ZERO
     C           FXRRN     CHAIN§000PHY1             91
     C  N91                UNLCK§000PHY1
     C  N91                EXSR SR1121
     C  N91                EXSR SR1199
     C  N91                MOVEL'AL00027' MSG
     C  N91                EXSR SNDMSG
     C   91                MOVE 'F'       CTLVLD
     C                     ENDIF
     C* POSITION UNGÜLTIG
     C                     OTHER
     C                     MOVEL'AL00002' MSG
     C                     EXSR SNDMSG
     C                     MOVE 'F'       CTLVLD
     C*
     C                     ENDSL                           END SELECT
     C* FUNKTIONSTASTENAKTUALISIERUNG
     C                     Z-ADD*ZERO     CTLARB
     C                     EXSR FKTPGM
     C*
     C* POSITION UNGÜLTIG
     C                     ELSE
     C                     MOVEL'AL00002' MSG
     C                     EXSR SNDMSG
     C                     MOVE 'F'       CTLVLD
     C                     ENDIF
     C*
     C*
     C           ##1200    ENDSR
     C*
     C/COPY ##D3OPTA                                       SR1401
     C/COPY ##OPCODE                                       SR1500
     C**************************************************************************
     C* SR1501: PRÜFUNGEN FÜR FORMAT D3
     C*-------------------------------------------------------------------------
     C*
     C           SR1501    BEGSR
     C*
     C                     EXSR SR1199                     CLEAR
     C           D3OP      IFNE *BLANK
     C                     EXSR SR1500                     PRÜFUNGEN
     C                     ENDIF
     C                     SETOF                     60
     C           CTLVLD    IFEQ 'F'
     C                     SETON                     60
     C                     MOVEAATR,9     §§OP
     C                     ENDIF
     C*
     C           KEYFMT    IFNE KEYHID
     C           CTLVLD    ANDNE'F'
     C           KEYSR1    CHAIN§000LOG1             91
     C           *IN91     IFEQ '0'
     C                     MOVEL'AL00012' MSG
     C                     MOVELI§§§01    TXT24  24
     C                     MOVE S1KY01    TXT24
     C                     MOVEATXT24     MD
     C                     EXSR SNDMSG
     C                     MOVE 'F'       CTLVLD
     C                     SETON                     62
     C                     END
     C                     END
     C*
     C*                    EXSR SR1503                     PRÜFUNGEN
     C*
     C           ##1501    ENDSR
     C*
     C**************************************************************************
     C* SR1502: SATZMODIFIZIERUNG DURCH EINEN ANDEREN ANWENDER?
     C*-------------------------------------------------------------------------
     C*
     C           SR1502    BEGSR
     C*
     C           KEYHID    IFNE KEYDAT
     C           H1DESC    ORNE S5DESC
     C           H1BERE    ORNE S5BERE
     C           H1STEP    ORNE S5STEP
     C                     MOVEL'AL00015' MSG
     C                     EXSR SNDMSG
     C                     MOVE 'F'       CTLVLD
     C                     SETON                     60
     C                     MOVEAATR,9     §§OP
     C                     MOVE ' '       CTLMOD           KEIN  UPDATE
     C                     ENDIF
     C           H1KY01    IFNE §KEY01
     C                     SETON                     62
     C                     MOVEAATR,9     §§KY01
     C                     ENDIF
     C           H1KY02    IFNE §KEY02
     C                     SETON                     62
     C                     MOVEAATR,9     §§KY02
     C                     ENDIF
     C           H1DESC    IFNE S5DESC
     C                     SETON                     71
     C                     MOVEAATR,9     §§DESC
     C                     ENDIF
     C           H1BERE    IFNE S5BERE
     C                     SETON                     72
     C                     MOVEAATR,9     §§BERE
     C                     ENDIF
     C           H1AKT     IFNE S5AKT
     C                     SETON                     73
     C                     MOVEAATR,9     §§AKT
     C                     ENDIF
     C           H1STEP    IFNE S5STEP
     C                     SETON                     79
     C                     MOVEAATR,9     §§STEP
     C                     ENDIF
     C*
     C           ##1502    ENDSR
     C*
     C**************************************************************************
     C* SR1503: KENNWORTEINGABE OK
     C*-------------------------------------------------------------------------
     C*
     C           SR1503    BEGSR
     C*
     C                     CALL 'KNWPRF1'              97
     C                     PARM           D3KW
     C                     PARM 'D'       MODUS   1
     C                     PARM ' '       RTNCOD  1
     C                     PARM           §§§PGM
     C                     MOVE '0'       *IN61
     C           RTNCOD    IFNE '0'
     C                     MOVE 'F'       CTLVLD
     C                     MOVE '1'       *IN61
     C                     MOVEAATR,9     §§KW
     C                     MOVE ' '       CTLMOD           KEIN  UPDATE
     C                     ENDIF
     C*
     C           ##1503    ENDSR
     C*
     C**************************************************************************
     C* SR1505: OP-CODE UND DATENSATZ STEHEN IM WIDERSPRUCH
     C*-------------------------------------------------------------------------
     C*
     C           SR1505    BEGSR
     C*
     C           *IN91     IFEQ '0'
     C*
     C           D3OP      IFEQ 'N'
     C           §§§CFK    OREQ BT06
     C                     MOVEL'AL00031' MSG              KEINE SÄTZE
     C                     EXSR SNDMSG
     C                     MOVE 'F'       CTLVLD
     C                     MOVE ' '       CTLMOD           KEIN  UPDATE
     C                     SETON                     61
     C                     SETON                     62
     C                     MOVEAATR,9     §§KY01
     C                     MOVEAATR,9     §§KY02
     C                     ENDIF
     C           D3OP      IFEQ 'Ä'
     C           §§§CFK    OREQ BT02
     C           CTLRWT    IFNE 'J'
     C           KEYFMT    ANDNEKEYHID
     C                     MOVEL'AL00031' MSG              KEINE SÄTZE
     C                     EXSR SNDMSG
     C                     MOVE 'F'       CTLVLD
     C                     MOVE ' '       CTLMOD           KEIN  UPDATE
     C                     MOVEAATR,9     §§KY01
     C                     MOVEAATR,9     §§KY02
     C                     SETON                     62
     C                     ENDIF
     C                     ENDIF
     C*
     C                     ENDIF
     C*
     C           ##1505    ENDSR
     C*
     C**************************************************************************
     C* SR1506: KEINE ÄNDERUNGEN VORGENOMMEN
     C*-------------------------------------------------------------------------
     C*
     C           SR1506    BEGSR
     C*
     C           KEYHID    IFEQ KEYFMT
     C           H1DESC    ANDEQD3DESC
     C           H1DESC    ANDEQD3DESC
     C           H1AKT     ANDEQD3AKT
     C           H1BERE    ANDEQD3BERE
     C           H1STEP    ANDEQD3STEP
     C                     MOVEL'AL00048' MSG
     C                     MOVELS1KY01    IMSG02
     C                     MOVELI§§009    IMSG03
     C                     MOVEACTLMSG    MD
     C                     EXSR SNDMSG
     C                     MOVE 'F'       CTLVLD
     C                     SETON                     60
     C                     MOVEAATR,9     §§OP
     C                     MOVE ' '       CTLMOD           KEIN  UPDATE
     C                     ENDIF
     C*
     C           ##1506    ENDSR
     C*
     C**************************************************************************
     C* SR1525: SONSTIGE PRÜFUNGEN IM PROGRAMM
     C*-------------------------------------------------------------------------
     C*
     C           SR1525    BEGSR
     C*
     C           D3AKT     IFNE 'A'
     C           D3AKT     ANDNE'I'
     C                     SETON                     73
     C                     MOVEAATR,9     §§AKT
     C                     MOVEL'AL00042' MSG
     C                     EXSR SNDMSG
     C                     MOVE 'F'       CTLVLD
     C                     MOVE ' '       CTLMOD           KEIN  UPDATE
     C                     ENDIF
     C*
     C           ##1525    ENDSR
     C*
     C**************************************************************************
     C* SR1526: STEP J/N
     C*-------------------------------------------------------------------------
     C*
     C           SR1526    BEGSR
     C*
     C           D3STEP    IFNE 'J'
     C           D3STEP    ANDNE'N'
     C                     SETON                     79
     C                     MOVEAATR,9     §§STEP
     C                     MOVEL'AL00052' MSG
     C                     EXSR SNDMSG
     C                     MOVE 'F'       CTLVLD
     C                     MOVE ' '       CTLMOD           KEIN  UPDATE
     C                     ENDIF
     C*
     C           ##1526    ENDSR
     C*
     C**************************************************************************
     C* SR1601: SÄTZE KOPIEREN
     C*-------------------------------------------------------------------------
     C*
     C           SR1601    BEGSR
    C* KOPIER-MODUS
     C                     MOVE '1'       *IN60
     C                     MOVEL'AL00026' MSG
     C                     EXSR SNDMSG
     C                     MOVE 'F'       CTLVLD
     C           ##1601    ENDSR
     C*
     C**************************************************************************
     C* SR1701: SÄTZE KOPIEREN
     C*-------------------------------------------------------------------------
     C*
     C           SR1701    BEGSR
    C* DRUCK-MODUS
     C                     MOVE '1'       *IN60
     C                     MOVEL'AL00026' MSG
     C                     EXSR SNDMSG
     C                     MOVE 'F'       CTLVLD
     C*
     C           ##1701    ENDSR
     C*
     C**************************************************************************
     C* SR1801: SÄTZE ANLEGEN/UPDATEN UPDATE-DATEI #1:
     C*-------------------------------------------------------------------------
     C*
     C           SR1801    BEGSR
     C*
     C           S1F1RR    IFNE *ZERO
     C                     MOVE 'U'       CTLMOD           MODUS UPDATE
     C           S1F1RR    CHAIN§000PHY1             91
     C                     EXSR SR1502
     C                     ELSE
     C                     MOVE 'W'       CTLMOD           MODUS WRITE
     C                     CLEARPHY01R
     C                     END
     C                     EXSR SR1505
     C                     EXSR SR1506
     C                     EXSR SR1525
     C                     EXSR SR1526
     C           S1F1RR    IFNE *ZERO
     C           CTLMOD    ANDEQ' '
     C                     UNLCK§000PHY1                   ENTSPERREN
     C                     ENDIF
     C*
     C           CTLMOD    IFNE ' '
     C                     MOVELKEYFMT    KEYDAT           IN DATA-AREA
     C                     MOVELD3DESC    S5DESC
     C                     MOVELD3BERE    S5BERE
     C                     MOVELD3AKT     S5AKT
     C                     MOVEL§§§USR    S5USR
     C                     MOVELD3STEP    S5STEP
     C                     MOVELKEYDAT    KEYHID           SAVE-AREA
     C                     MOVELS5DESC    H1DESC
     C                     MOVELS5BERE    H1BERE
     C                     MOVELS5AKT     H1AKT
     C                     MOVEL§§§USR    H1USR
     C                     MOVELS5STEP    H1STEP
     C                     CLEARD3OP
     C           CTLMOD    IFEQ 'W'
     C           S1KY01    IFEQ *BLANK
     C                     MOVEL§§§USR    S1KY01           IN DATA-AREA
     C                     ENDIF
     C                     Z-ADDLDADTP    S5ADAT
     C                     Z-ADDLDADTP    H1ADAT
     C                     WRITEPHY01R
     C                     ADD  1         CRTREC
     C                     ADD  1         E1CRT
     C                     MOVE 'J'       CTLCHG  1
     C                     MOVE 'J'       CTLLD
     C                     MOVELI§§010    IMSG03
     C                     EXSR MSG001
     C                     ELSE
     C                     MOVELLDADTP    S5EDAT
     C                     MOVELLDADTP    H1EDAT
     C                     UPDATPHY01R
     C                     ADD  1         MODREC
     C                     ADD  1         E1MOD
     C                     MOVE 'J'       CTLCHG  1
     C                     MOVELI§§009    IMSG03
     C                     EXSR MSG001
     C                     END
     C                     END
     C*
     C           ##1801    ENDSR
     C*
     C**************************************************************************
     C* SR1901: SÄTZE LÖSCHEN UPDATE-DATEI #1: DATEI
     C*-------------------------------------------------------------------------
     C*
     C           SR1901    BEGSR
     C*
     C           KEYSR1    SETLL§000LOG1
     C                     DO   *HIVAL
     C           KEYSR1    READE§000LOG1                 91
     C   91                LEAVE
     C                     Z-ADDF1RRN     X1RRN  150
     C           X1RRN     DELETPHY01R               93
     C                     SETON                     86    PROTECTED
     C                     CLEARD3OP
     C                     EXSR SRATTR
     C                     EXSR SR1199
     C                     CLEARKEYHID
     C                     ADD  1         DLTREC
     C                     ADD  1         E1DLT
     C                     MOVE 'J'       CTLCHG  1
     C                     MOVELI§§011    IMSG03
     C                     EXSR MSG001
     C                     END
     C*
     C           ##1901    ENDSR
     C*
     C**************************************************************************
     C* SR2201: SQL ÜBER FKT.22 BEI 87 UND 88
     C*-------------------------------------------------------------------------
     C*
     C           SR2201    BEGSR
    C* SQL-MODUS
     C*
     C*
     C           ##2201    ENDSR
     C*
     C**************************************************************************
     C* SRFK13: ???
     C*-------------------------------------------------------------------------
     C*
     C           SRFK13    BEGSR
     C*
     C*
     C           ##FK13    ENDSR
     C*
     C**************************************************************************
     C* SRFK16: ???
     C*-------------------------------------------------------------------------
     C*
     C           SRFK16    BEGSR
     C*
     C*
     C           ##FK16    ENDSR
     C*
     C**************************************************************************
     C* INITIALISIERUNGSROUTINE
     C*-------------------------------------------------------------------------
     C*
     C           *INZSR    BEGSR
     C* *LDA DEFINIEREN/LESEN
     C           *NAMVAR   DEFN *LDA      LDA
     C                     IN   LDA
     C*
     C* NACHRICHTEN-SFL INITIALISIEREN
     C                     MOVEL'*'       §§§PGQ
     C                     EXSR CLRMSG
     C*
     C                     ENDSR
     C*
     C**************************************************************************
     C* PROGRAMM VERLASSEN
     C*-------------------------------------------------------------------------
     C*
     C           RETURN    BEGSR
     C                     WRITE§DDS1§D0
     C                     OUT  LDA
     C                     MOVE '1'       *INLR
     C                     RETRN
     C                     ENDSR
     C*
     C**************************************************************************
     C/COPY ##PSSR                                         Errorroutine
     C/COPY ##MESSAGES                                     Nachrichten
     C/COPY ##MODATR                                       variabl.Attr.
     C/COPY ##TASTATUR                                     TastatDef.
