      * Physische Datei: #LBLB
      * ANLEGEDATUM: JULI 2010
      * ÄNDERUNGEN:
      * AUSSCHLUSS: NUR SÄTZE MITSTATUS 1 GEBUCHT, 2 STORNIERT
      * FIBSTA IN POSITION IST ENTSCHEIDEND
     A
     A          R #BILLSR0                  JFILE(PRJ626P PRJ627P)
     A**                                    TEXT('BILLS & POSITIONEN')
     A          J                           JOIN(1 2)
     A**        J                           JOIN(PRJ626P PRJ627P)
     A                                      JFLD(RENR  RENR)
     A            RENR                      JREF(1)
     A            RECLIF                    JREF(1)
     A            LIFNR                     JREF(1)
     A            HANR                      JREF(1)
     A            KRDABW                    JREF(1)
     A            WSCHL                     JREF(1)
     A            GIPKU                     JREF(1)
     A            BTRINL                    JREF(1)
     A            BTRASL                    JREF(1)
     A            WKBEZ                     JREF(1)
     A            KRSART                    JREF(1)
     A            WKUR                      JREF(1)
     A            WEINH                     JREF(1)
     A            WKMON                     JREF(1)
     A            WKJHR                     JREF(1)
     A            TAGSKT1                   JREF(1)
     A            SKT1                      JREF(1)
     A            TAGSKT2                   JREF(1)
     A            SKT2                      JREF(1)
     A            TAGLST                    JREF(1)
     A            REDAT                     JREF(1)
     A            VALDAT                    JREF(1)
     A            BUCDAT                    JREF(1)
     A            JAH                       JREF(1)
     A            STKABW                    JREF(1)
     A            STKMAT                    JREF(1)
     A            ISTMAT                    JREF(1)
     A            ISTMGK                    JREF(1)
     A            REBTR                     JREF(1)
     A            ST1                       JREF(1)
     A            KTOSNS                    JREF(1)
     A            SNSBTR                    JREF(1)
     A            KTOMW                     JREF(1)
     A            KTOMWK                    JREF(1)
     A            KTOART                    JREF(1)
     A            FIBSTA                    JREF(1)
     A            IFFART                    JREF(1)
     A            IFFDAT                    JREF(1)
     A            USRNAM                    JREF(1)
     A            AENDAT                    JREF(1)
     A            BEM1                      JREF(1)
     A            BEM2                      JREF(1)
     A            RECVB                     JREF(1)
     A*
     A*****       RENR                      JREF(2)
     A            REPOS                     JREF(2)
     A            WENR                      JREF(2)
     A*****       BUCDAT                    JREF(2)
     A            BUCKEY                    JREF(2)
     A            ARTNUM                    JREF(2)
     A            ARTNUMVAR                 JREF(2)
     A            KSTSTL                    JREF(2)
     A            AFTNUM                    JREF(2)
     A            AFTPOS                    JREF(2)
     A            BELNUM                    JREF(2)
     A            BSTNUM                    JREF(2)
     A            BSTPOS                    JREF(2)
     A*****       JAH                       JREF(2)
     A            RECMNG                    JREF(2)
     A            RECENH                    JREF(2)
     A            RECBTR                    JREF(2)
     A            STEBTR                    JREF(2)
     A            STEPRO                    JREF(2)
     A            BSTABW                    JREF(2)
     A*****       STKMAT                    JREF(2)
     A*****       STKABW                    JREF(2)
     A            ABWPRZ                    JREF(2)
     A            STKMGK                    JREF(2)
     A*****       ISTMAT                    JREF(2)
     A*****       ISTMGK                    JREF(2)
     A*****       KTOART                    JREF(2)
     A*****       KTOMW                     JREF(2)
     A*****       KTOMWK                    JREF(2)
     A            KTOSLL                    JREF(2)
     A            KTOHAB                    JREF(2)
     A            KTOSTE                    JREF(2)
     A            KTOSTKABW                 JREF(2)
     A            KTOVERGMK                 JREF(2)
     A            FIBSLLMAT                 JREF(2)
     A            FIBSLLMGK                 JREF(2)
     A            FIBSLLABW                 JREF(2)
     A*           #FIBSTA                   JREF(PRJ627P)
     A*****       IFFART                    JREF(2)
     A            IFFMNG                    JREF(2)
     A            REG                       JREF(2)
     A*****       USRNAM                    JREF(2)
     A*****       AENDAT                    JREF(2)
     A*****       BEM1                      JREF(2)
     A*****       BEM2                      JREF(2)
     A            R01                       JREF(2)
     A            R02                       JREF(2)
     A            R03                       JREF(2)
     A            R04                       JREF(2)
     A            M01                       JREF(2)
     A            M02                       JREF(2)
     A            M03                       JREF(2)
     A            M04                       JREF(2)
     A            KTOSLLIN                  JREF(2)
     A            KTOSLLOT                  JREF(2)
     A          K RENR
     A          O M04                       CMP(NE 0)
