     A*****************************************************************
     A*FIRMA UND TIMESTAMP *******************************************
     A*****************************************************************
     A*
     A          R BLPO1                     PFILE(BLPO)
     A*
     A          K BLPOFIRM
     A          K BLPOWEJJ
     A          K BLPOWENR
     A          O BLPOWEJJ                  CMP(LT 2010)
