     A*****************************************************************
     A*FIRMA UND TIMESTAMP *******************************************
     A*****************************************************************
     A*
     A          R BWAE1                     PFILE(BWAE)
     A*
     A          K AEFIRM
     A          K AEWEJJ
     A          K AEWENR
     A          O AEWEJJ                    CMP(LT 2010)
