     A                                      UNIQUE
     A          R #LBLBR                    TEXT('STEUERUNGSDATEI')
     A            #STATUS        2A         COLHDG('STATUS           ')
     A            #STATUSWAE     2A         COLHDG('STATUS WAE       ')
     A            #STATUSBEP     2A         COLHDG('STATUS BEP       ')
     A            #AELFNRR      10A         TEXT('RECHNUNG LIEFER.')
     A            #RWERT        11S 2       COLHDG('RECHNUNGSWERT    ')
     A            #WERTN        11S 2       COLHDG('WERT FREI        ')
     A            #WERTA        10A         COLHDG('WERT FREI        ')
     A            #STORNO        1A         COLHDG('STORNO HANDLING  ')
     A            #WE#EL        14S 0       COLHDG('WE#EL-SYSTEM     ')
     A*
     A            #LBLBLOCK      1A         COLHDG('SATZ-SPERRE      ')
     A            #LBLBJNAM     10A         COLHDG('LTZ.ÄND.JOB-NA   ')
     A            #LBLBJDAT      8S 0       COLHDG('LTZ.ÄND.JOBDAT   ')
     A            #LBLBJZEI      6S 0       COLHDG('LTZ.ÄND.JOB-ZT   ')
     A            #LBLBUSER     10A         COLHDG('LTZ.ÄND. USER    ')
     A            #LBLBPROG     10A         COLHDG('LTZ.ÄND. PROG    ')
     A            #LBLBBIBL     10A         COLHDG('LTZ. ÄND. BIBL   ')
     A            #LBLBFIRM      2A         COLHDG('FIRMEN-NR        ')
     A            #LBLBTMST     26S 0       COLHDG('TIMESTAMP        ')
     A            #LBLBBSTY      4A         COLHDG('BESTANDS-ART     ')
     A            #LBLBWKNR      3A         COLHDG('WERKS-NR         ')
     A            #LBLBLANR      3A         COLHDG('LAGER-NR         ')
     A            #LBLBBSLA      3A         COLHDG('BESTANDS-LG-NR   ')
     A            #LBLBTENR     15A         COLHDG('IDENT-NR         ')
     A            #ARTNUM       11S         TEXT('STK#')
     A            #LBLBFBNR     20A         COLHDG('FAB-NR           ')
     A            #LBLBGEBI     15A         COLHDG('GEBINDE-NR       ')
     A            #LBLBCONT     10A         COLHDG('CONTAINER-NR     ')
     A            #LBLBBHNR     10A         COLHDG('BEHÄLTER-NR      ')
     A            #LBLBLORT      8A         COLHDG('LAGER-PLATZ      ')
     A            #LBLBCHAR     20A         COLHDG('CHARGEN-NR       ')
     A            #LBLBFUMG     11S 4       COLHDG('FÜLLMENGE        ')
     A            #LBLBKDNR     10A         COLHDG('KUNDEN-NR        ')
     A            #LBLBLFNR     10A         COLHDG('LIEFERANTEN-NR   ')
     A            #LBLBMEIN      1A         COLHDG('MENGEN-EINHEIT   ')
     A            #LBLBLSTC      3A         COLHDG('LG-BUCHUNGS-CD   ')
     A            #LBLBBDAT      8S 0       COLHDG('BUCHUNGS-DATUM   ')
     A            #LBLBBZEI      6S 0       COLHDG('BUCHUNGS-ZEIT    ')
     A            #LBLBBWMG     13S 4       COLHDG('BUCHUNGS-MENGE   ')
     A            #LBLBBWME      1A         COLHDG('MENGEN-EINHEIT   ')
     A            #LBLBSTMG     13S 4       COLHDG('STAMM-MENGE      ')
     A            #LBLBSTKZ      1A         COLHDG('STORNO-KZ        ')
     A            #LBLBLGBS     13S 4       COLHDG('LGB VOR BUCH     ')
     A            #LBLBDANA     10A         COLHDG('VERURSACHER      ')
     A            #LBLBDAKY     40A         COLHDG('DATEI-CODE       ')
     A            #LBLBKOTR     10A         COLHDG('KONTO            ')
     A            #LBLBKSST     10A         COLHDG('KOSTEN-STELLE    ')
     A            #LBLBKOAR     10A         COLHDG('KOSTEN-ART       ')
     A            #LBLBMOKZ      1A         COLHDG('MONATS-ABSCHL    ')
     A            #LBLBFBKZ      1A         COLHDG('FIBU-ÜBERNAHME   ')
     A            #LBLBDRKZ      1A         COLHDG('DRUCK-KZ         ')
     A            #LBLBRGKZ      1A         COLHDG('REORGANISATION   ')
     A            #LBLBCSKZ      1A         COLHDG('CS-SCHNITTST     ')
     A            #LBLBKZ01      1A         COLHDG('FREIGABE         ')
     A            #LBLBKZ02      1A         COLHDG('FREIGABE         ')
     A            #LBLBBEZ1     30A         COLHDG('BUCH-TEXT 1      ')
     A            #LBLBBEZ2     30A         COLHDG('BUCH-TEXT 2      ')
     A            #LBLBUTMS     26S 0       COLHDG('UMB. TIMESTAMP   ')
     A            #LBLBBSEI     11S 2       COLHDG('BSTD-EINHEIT     ')
     A            #LBLBQSST      2A         COLHDG('QS-STATUS        ')
     A            #LBLBQSTM     26S 0       COLHDG('TIMESTAMP QS     ')
     A            #LBLBWBKT     10A         COLHDG('KONTO            ')
     A            #LBLBEBKT     10A         COLHDG('KOSTEN-KONTO     ')
     A            #LBLBSPKZ      1A         COLHDG('SPERR-KZ         ')
     A            #LBLBSPGR      2A         COLHDG('SPERR-GRUND      ')
     A            #LBLBFRIN     17A         COLHDG('FREIFELD INT     ')
     A            #LBLBFREX     20A         COLHDG('FREIFELD EXT     ')
     A*
     A            #BUCHUNG      10A         COLHDG('                 ')
     A            #ERRORTXT     80A         COLHDG('                 ')
     A            #TSTAMP         Z         TEXT('TIMESTAMP')
     A            #STATUSX       2A         TEXT('STATUS')
     A            #ARTNUMS      10S 0       TEXT('STKU-#')
     A            #BUCKEY        2A         TEXT('BUCKEY EL-SYSTEM')
     A            #BBEP          1A         TEXT('BESTELLPOSITION')
     A            #BBEP2         1A         TEXT('BESTELLPOSITION DE')
     A            #BWAE          1A         TEXT('WE/RECHNUNGEN')
     A            #BWAE2         1A         TEXT('WE/RECHNUNGEN DET')
     A            #BGFS          1A         TEXT('BGFS')
     A            #BGFS2         1A         TEXT('BGFS DETAIL')
     A            #AEFIRM        2A         TEXT('BESTELLKEY FIRMA')
     A            #AEBEJJ        4S 0       TEXT('BESTELLKEY JJ   ')
     A            #AEBENR        6A         TEXT('BESTELLKEY BELGEG')
     A            #AEBEPO        4S 0       TEXT('BESTELLKEY POSIT')
     A            #AELFNR       10A         TEXT('WARENEINGANG LFR')
     A            #AEWEJJ        4S 0       TEXT('WARENEINGANGJAHR')
     A            #AEWENR        6A         TEXT('WARENEINGANGS#')
     A          K #LBLBFIRM
     A          K #LBLBTMST
