     A*****************************************************************
     A* WAECO: LOGISCHE SICHT WWWORD50AV
     A*****************************************************************
     A          R ORH00R1                   PFILE(WAECOEDI/WWWORD10AV)
     A*****************************************************************
     A          K ORH010
     A          K ORH040
