     A*****************************************************************
     A* WAECO: LOGISCHE SICHT WWWORD50AV
     A*****************************************************************
     A          R ORD00R1                   PFILE(WAECOEDI/WWWORD50AV)
     A*****************************************************************
     A          K ORD010
     A          K ORD040
