      * Physische Datei: WAEEDILP
      * ANLEGEDATUM: FEBRUAR 2010
      * ÄNDERUNGEN:
      *
     A          R EDILPF0                   PFILE(WAEEDILP)
     A          K EDIL030
     A          K TSTAMP                    DESCEND
