     A*****************************************************************
     A* WAECO: LOGISCHE SICHT WWWORK10
     A*****************************************************************
     A          R ORK00R1                   PFILE(WAECOEDI/WWWORK10)
     A*****************************************************************
     A          K ORK010
     A          K ORK040
