/*-------------------------------------------------*/
/* FTP Command zum senden von Files (Ba.2014)      */
/*                                                */
/*-------------------------------------------------*/
             PGM
             DCL        VAR(&MD) TYPE(*CHAR) LEN(256) VALUE(' ')
             DCL        VAR(&ERROR2)  TYPE(*CHAR) LEN(01) VALUE('0')
             OVRDBF     FILE(INPUT) TOFILE(BAR_FTP/QCLSRC) MBR(BankCMD)
             OVRDBF     FILE(OUTPUT) TOFILE(BAR_FTP/QCLSRC) +
                          MBR(BankLOG)
             ADDLIBLE   LIB(GANG) POSITION(*LAST)
             MONMSG     MSGID(CPF0000) EXEC(CHGVAR VAR(&ERROR2) +
                          VALUE('1'))
             CALL     PGM(DUMMY512) PARM(&MD '#DC0010' ' ' ' ' +
                  'OUTPUT    '  'BAR_FTP' '*ADD')
             MONMSG     MSGID(CPF0000)
             FTP        RMTSYS('10.90.10.114')
             ENDPGM
