/*-------------------------------------------------*/
/* FTP Command zum senden von Files (Ba.2014)      */
/* Dometic Server Siegen - Sanktionsmonitor       */
/*-------------------------------------------------*/
             PGM
             OVRDBF     FILE(INPUT) TOFILE(BAR_FTP/QCLSRC) MBR(DETHCMD)
             OVRDBF     FILE(OUTPUT) TOFILE(BAR_FTP/QCLSRC) +
                          MBR(DETHLOG)
             FTP        RMTSYS('ftp.dethleffs.de')
             ENDPGM
