     *************************************************************
     F*      WAECO International GmbH                            *
     F*                                                          *
     F*      Hollefeldstrasse 63                                 *
     F*                                                          *
     F*      48282 Emsdetten                                     *
     F*                                                          *
     F************************************************************
     F*  PROGRAMMFUNKTION:                                       *
     F*  SLAZS reoganisieren                                     *
     F************************************************************
     fslazs     up   e           k disk

     c                   if        slazvest<>1

     c                   delete    slaz1

     c                   endif

