/*    * PROGRAMMNAME.:#PREAKTC2                                              */
/*    * FUNKTION.....:ERMITTELN PREISE IN DATEI #PREISAKT                    */
/*    *               TEMPORÄRE DATEI VORGESCHALTET #KUND_T                  */
/*    *               eingabe neus jahr und vorjahr JJJJMMTT                 */
/*    * 11/2011        SCHNEIDER                                              */
/*    *                                                                       */
/*    *                                                                       */
/*    *-ÄNDERUNGSDIENST-------------------------------------------------------*/
/*    * XX.XX.XX                                          PGMR.....           */
/******************************************************************************/
             PGM        PARM(&PDATU &PDATUVJ)

             DCL        VAR(&PDATU) TYPE(*CHAR) LEN(8)
             DCL        VAR(&PDATUVJ) TYPE(*CHAR) LEN(8)

/*             PROGRAMMAUFRUF                                                */
             SBMJOB     CMD(CALL PGM(TVRELWAECO/#PREAKTC2B) +
                          PARM(&PDATU &PDATUVJ)) JOB(PREISE) +
                          JOBD(MODWAO/JDTREND) JOBQ(QSYSNOMAX)

             ENDPGM
